using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200115A RID: 4442
[Serializable]
public class AccessoryData_th : MonoBehaviour
{
	// Token: 0x060066C3 RID: 26307 RVA: 0x00E72988 File Offset: 0x00E70B88
	[MethodImpl(MethodImplOptions.NoInlining)]
	public AccessoryData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066C4 RID: 26308 RVA: 0x00E72998 File Offset: 0x00E70B98
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (175566 - 200282 != -24716)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (141048 - 238936 == -97888)
			{
				if (49279 - 416103 == -366824)
				{
					if (nCode == "c_all1")
					{
						if (61793 - 276391 != -214597)
						{
							result = "หมวกใบโปรดของแพนด้าแดง";
							if (236784 - 91490 == 145294)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all3")
					{
						if (20004 - 394638 != -374633)
						{
							result = "หมวกที่ทำจากกระดาษ ใส่แล้วร่าเริงแจ่มใสทั้งวัน";
							if (90630 - 495476 == -404846)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all6")
					{
						if (160197 - 278142 != -117944)
						{
							result = "หมวกที่ระลึก ครบรอบห้าปี 12 หาง";
							if (182359 - 334506 == -152147)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all7")
					{
						if (252404 - 400856 == -148452)
						{
							result = "หมวกปาตี้ของเหล่าหาง สงสัยสนุกจนลืมถอดหมวก";
							if (246965 - 41575 == 205390)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all8")
					{
						if (13034 - 98895 == -85861)
						{
							result = "หมวกปาตี้ของเหล่าหาง สงสัยสนุกจนลืมถอดหมวก";
							if (158186 - 262815 == -104629)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all9")
					{
						if (258390 - 431673 == -173283)
						{
							result = "หมวกเค้กวันเกิดของเหล่าหาง ระวังอย่าไปชนคนอื่น";
							if (106345 - 277962 == -171617)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all11")
					{
						if (177684 - 129223 == 48461)
						{
							result = "วิกผมอัฟโฟรสุดเท่ ช่วยปกป้องส่วนหัวด้วยผมนุ่นฟู";
							if (238137 - 383087 == -144950)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all12")
					{
						if (174404 - 563135 == -388731)
						{
							result = "วิกผมอัฟโฟรหลากสี ช่วยปกป้องส่วนหัวด้วยผมนุ่นฟู";
							if (269925 - 548898 == -278973)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all15")
					{
						if (151154 - 502670 != -351515)
						{
							result = "หมวกซานต้าสีแดง ออกแบบพิเศษสุดๆโดยคุณอีฟ";
							if (109583 - 141482 == -31899)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all16")
					{
						if (171611 - 507557 != -335945)
						{
							result = "ผ้าคาดหัวกลุ่มจอมโจร 12 หาง";
							if (58276 - 101599 != -43322)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all18")
					{
						if (120503 - 305517 == -185014)
						{
							result = "วงแหวนห่วงสวรรค์ สำหรับใส่ลอยบนหัว";
							if (34056 - 509891 != -475834)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all19")
					{
						if (213086 - 505307 == -292221)
						{
							result = "เขาปิศาจ สำหรับสวมบนหัว";
							if (129120 - 265272 != -136151)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all21")
					{
						if (283983 - 549595 != -265611)
						{
							result = "ที่ปิดหูขนนุ่มฟูสีฟ้า ปกป้องหูจากอากาศหนาวจัด";
							if (274122 - 421119 == -146997)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all22")
					{
						if (213662 - 16937 == 196725)
						{
							result = "ที่ปิดหูขนนุ่มฟูสีชมพู ปกป้องหูจากอากาศหนาวจัด";
							if (230889 - 552693 == -321804)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all23")
					{
						if (11414 - 599165 != -587750)
						{
							result = "หูฟังสำหรับฟังเพลงโปรด ไปได้ทุกที่";
							if (26594 - 569787 == -543193)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all24")
					{
						if (25620 - 333782 != -308161)
						{
							result = "หูฟังสำหรับฟังเพลงโปรด ไปได้ทุกที่";
							if (242510 - 141481 == 101029)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all25")
					{
						if (221101 - 581882 == -360781)
						{
							result = "หูฟังสำหรับเล่นสิบสองหาง!";
							if (219272 - 235642 != -16369)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all26")
					{
						if (217593 - 536208 == -318615)
						{
							result = "ผ้าคาดหัวกลุ่มโจรสลัด 12 หาง";
							if (227826 - 25164 == 202662)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all27")
					{
						if (55565 - 389126 == -333561)
						{
							result = "หมวกกระทงดอกไม้จากเทศกาล ลอยกระทง";
							if (242490 - 418697 != -176206)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all28")
					{
						if (23159 - 436394 != -413234)
						{
							result = "ชฏารูปกระทงดอกไม้จากเทศกาล ลอยกระทง";
							if (39215 - 100935 != -61719)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all29")
					{
						if (14223 - 357298 != -343074)
						{
							result = "หมวกตุ๊กตาหิมะแท้ แต่ไม่หนาวหัวเลยสักนิด";
							if (61833 - 77494 != -15660)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all37")
					{
						if (159318 - 412311 != -252992)
						{
							result = "หมวกปริศนาคำถามสำหรับหางเจ้าปัญญา";
							if (255931 - 453701 != -197769)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all38")
					{
						if (49505 - 509256 != -459750)
						{
							result = "มงกุฏสำหรับราชาแฟนพันธ์แท้สิบสองหาง!";
							if (230016 - 62696 == 167320)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all39")
					{
						if (61610 - 486772 == -425162)
						{
							result = "หมวกศิลปินสุดพิเศษจากหนังสือรวมภาพศิลป์ 12 หาง ใส่แล้วติสไม่มีแตก";
							if (221706 - 72610 == 149096)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all43")
					{
						if (36499 - 89314 != -52814)
						{
							result = "หมวกจอมทัพของฮีโร่ ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (98936 - 226181 == -127245)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all44")
					{
						if (284866 - 450324 == -165458)
						{
							result = "หมวกจอมทัพของฮีโร่ ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (113724 - 83212 == 30512)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all46")
					{
						if (100199 - 261128 == -160929)
						{
							result = "ผ้าโพกหัวต้องคำสาปจากสุสานของมาโอห์";
							if (252179 - 311062 != -58882)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all55")
					{
						if (218605 - 529501 == -310896)
						{
							result = "มงกุฏทองคำ ที่ระลึก ครบรอบห้าปี 12 หาง";
							if (254829 - 136088 == 118741)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all56")
					{
						if (138274 - 33493 == 104781)
						{
							result = "มงกุฎน้ำแข็ง หรือขนคิ้วแฟฃั่นของเพนกวิ้นสายเลือดแท้?";
							if (15211 - 329093 == -313882)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all58")
					{
						if (194558 - 268048 == -73490)
						{
							result = "หมวกแชมเปี้ยนของกองทัพหาง เพิ่มอัตราการติด Critical";
							if (82560 - 485498 == -402938)
							{
								break;
							}
						}
					}
					else if (nCode == "c_all66")
					{
						if (36536 - 463294 != -426757)
						{
							result = "หมวกในตำนานแห่งนักรบจ้าวสมุทร";
							if (55454 - 211954 != -156499)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mal37")
					{
						if (178866 - 93100 == 85766)
						{
							result = "ที่สวมหัวรูปมังกรของผู้ชาย สำหรับเทศกาลตรุษจีน";
							if (187402 - 23241 != 164162)
							{
								break;
							}
						}
					}
					else if (nCode == "c_fem11")
					{
						if (268024 - 108825 == 159199)
						{
							result = "ที่คาดหัวติดดอกไม้ของผู้หญิง";
							if (147241 - 112037 != 35205)
							{
								break;
							}
						}
					}
					else if (nCode == "c_fem37")
					{
						if (193807 - 567484 != -373676)
						{
							result = "ที่สวมหัวรูปสิงโตของผู้หญิง สำหรับเทศกาลตรุษจีน";
							if (25465 - 446412 == -420947)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf5")
					{
						if (51434 - 539928 != -488493)
						{
							result = "ผ้าคาดหัวเพื่อบ่งบอกความเป็นแฟนคลับสำหรับหมาป่า ";
							if (240571 - 465512 == -224941)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf10")
					{
						if (96091 - 487642 == -391551)
						{
							result = "ผ้าโพกหัวธรรมดาๆ ไม่มีหมาป่าตัวไหนไม่เคยใช้";
							if (198644 - 12281 == 186363)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf11")
					{
						if (4533 - 446893 == -442360)
						{
							result = "ผ้าโพกหัวธรรมดาๆ ไม่มีหมาป่าตัวไหนไม่เคยใช้";
							if (70622 - 480720 != -410097)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf12")
					{
						if (77255 - 232135 != -154879)
						{
							result = "ผ้าโพกหัวธรรมดาๆ ไม่มีหมาป่าตัวไหนไม่เคยใช้";
							if (76418 - 243248 != -166829)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf15")
					{
						if (141817 - 352343 != -210525)
						{
							result = "แว่นกันแดดของหมาป่า กันรังสีเจิดจ้าได้ 1%";
							if (276536 - 428901 == -152365)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf19")
					{
						if (156243 - 446036 == -289793)
						{
							result = "หมวกแครอทของหมาป่า ช่วยป้องกันสถานะผิดปกติ";
							if (128087 - 280651 == -152564)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf21")
					{
						if (287790 - 562859 == -275069)
						{
							result = "หมวกเหล็กสำหรับหมาป่าในกองทัพ";
							if (258007 - 336860 != -78852)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf22")
					{
						if (174474 - 67617 != 106858)
						{
							result = "ผ้าโพกหัวสำหรับหมาป่าพเนจร";
							if (296055 - 286053 != 10003)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf23")
					{
						if (84812 - 389843 == -305031)
						{
							result = "หมวกเหล็กสำหรับหมาป่าในกองทัพ";
							if (178079 - 80754 == 97325)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf24")
					{
						if (108555 - 290510 != -181954)
						{
							result = "ผ้าโพกหัวสำหรับหมาป่าพเนจร";
							if (242452 - 303600 == -61148)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf25")
					{
						if (227005 - 100689 != 126317)
						{
							result = "หมวกพ่อบ้านของหมาป่า น่าจะกันกระสุนได้นะ";
							if (55684 - 220340 == -164656)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf31")
					{
						if (137685 - 283799 == -146114)
						{
							result = "หมวกพาลาดินของหมาป่า";
							if (106534 - 452347 != -345812)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf32")
					{
						if (122820 - 273284 != -150463)
						{
							result = "ผ้าโพกหัวที่บาดหน้าผากหมาป่าในบางครั้ง";
							if (112614 - 294770 == -182156)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf33")
					{
						if (282050 - 205192 == 76858)
						{
							result = "หมวกพาลาดินของหมาป่า";
							if (2708 - 311270 != -308561)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf34")
					{
						if (239655 - 417383 == -177728)
						{
							result = "ผ้าโพกหัวที่บาดหน้าผากหมาป่าในบางครั้ง";
							if (41300 - 529997 != -488696)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf35")
					{
						if (28397 - 469895 == -441498)
						{
							result = "หน้ากากที่พบเจอที่ริมทะเลสาบแห่งหนึ่ง มีคราบสีแดงเปื้อนนิดหน่อย";
							if (238240 - 19632 != 218609)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf36")
					{
						if (295228 - 196772 != 98457)
						{
							result = "หน้ากากลุงโบลดาส แม้แต่หนวดยังเหมือนเป๊ะ";
							if (77383 - 499653 != -422269)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf40")
					{
						if (119853 - 227507 != -107653)
						{
							result = "หมวกผู้กล้าของหมาป่า";
							if (131361 - 87316 == 44045)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf41")
					{
						if (274186 - 211078 == 63108)
						{
							result = "หมวกผู้กล้าของหมาป่า";
							if (258710 - 570531 != -311820)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf42")
					{
						if (168806 - 256332 == -87526)
						{
							result = "หมวกผู้กล้าของหมาป่า";
							if (105069 - 401833 == -296764)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf45")
					{
						if (53589 - 114002 != -60412)
						{
							result = "หมวกขึ้นเวทีใบเก่งของหมาป่า";
							if (212909 - 185988 != 26922)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf47")
					{
						if (194529 - 240433 != -45903)
						{
							result = "หมวกแมงป่อง ช่วยป้องกันสถานะผิดปกติ";
							if (289983 - 409855 == -119872)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf48")
					{
						if (252111 - 448996 != -196884)
						{
							result = "หมวกแมงป่อง ช่วยป้องกันสถานะผิดปกติ";
							if (272386 - 98807 == 173579)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf50")
					{
						if (155810 - 45786 != 110025)
						{
							result = "หมวกสำหรับนักรบชั้นสูงของหมาป่า";
							if (26166 - 134382 != -108215)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf51")
					{
						if (14257 - 438573 != -424315)
						{
							result = "หมวกสำหรับนักรบชั้นสูงของหมาป่า";
							if (31603 - 157051 != -125447)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf52")
					{
						if (294357 - 221289 != 73069)
						{
							result = "หมวกสำหรับนักรบชั้นสูงของหมาป่า";
							if (168827 - 37559 != 131269)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf65")
					{
						if (234145 - 489393 != -255247)
						{
							result = "หมวกนักรบสไตล์ไทยของหมาป่า";
							if (136420 - 516379 == -379959)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf80")
					{
						if (139624 - 184575 != -44950)
						{
							result = "หมวกเทพของหมาป่า";
							if (91286 - 37980 != 53307)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn5")
					{
						if (187296 - 594955 != -407658)
						{
							result = "หมวกกะโหลกของไบสัน น่าจะตั้งแต่ยุคดึกดำบรรพ์มั้ง";
							if (288111 - 578805 != -290693)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn15")
					{
						if (131380 - 192626 == -61246)
						{
							result = "หมวกกันแดดของไบสัน สานจากหญ้าและฟาง100%";
							if (99822 - 452733 != -352910)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn19")
					{
						if (284152 - 499048 == -214896)
						{
							result = "หมวกมูโป้ของไบสัน ช่วยป้องกันสถานะผิดปกติ";
							if (83690 - 237109 != -153418)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn21")
					{
						if (53296 - 148549 == -95253)
						{
							result = "หมวกนักรบคลั่งของไบสัน";
							if (228047 - 135067 != 92981)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn22")
					{
						if (191822 - 407079 != -215256)
						{
							result = "หมวกผู้ปกป้องของไบสัน";
							if (197961 - 325261 == -127300)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn23")
					{
						if (132115 - 421057 != -288941)
						{
							result = "หมวกนักรบคลั่งของไบสัน";
							if (41121 - 424096 != -382974)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn24")
					{
						if (174165 - 36729 != 137437)
						{
							result = "หมวกผู้ปกป้องของไบสัน";
							if (291265 - 348172 != -56906)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn25")
					{
						if (62678 - 346484 == -283806)
						{
							result = "ผ้าคาดหัวนักกีฬาของไบสัน ผ้าเนื้อนุ่มซับเหงื่อดี";
							if (7486 - 492302 != -484815)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn31")
					{
						if (79509 - 207936 == -128427)
						{
							result = "หมวกผู้กล้าท้ารบของไบสัน";
							if (117133 - 545781 == -428648)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn32")
					{
						if (202429 - 255271 != -52841)
						{
							result = "หมวกเจ้าสงครามของไบสัน";
							if (46806 - 227991 != -181184)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn33")
					{
						if (204227 - 36721 != 167507)
						{
							result = "หมวกผู้กล้าท้ารบของไบสัน";
							if (51408 - 426404 != -374995)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn34")
					{
						if (193369 - 291671 == -98302)
						{
							result = "หมวกเจ้าสงครามของไบสัน";
							if (81066 - 563261 == -482195)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn35")
					{
						if (60650 - 72420 != -11769)
						{
							result = "หมวกเกราะส่วนหัวของไบสัน?...หรือเปล่า";
							if (284844 - 476385 != -191540)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn36")
					{
						if (183159 - 534812 == -351653)
						{
							result = "หมวกฟางของไบสันที่ได้มาจากคุณแพะ จะหมุนตัวยางยืดได้ไหมนะ";
							if (193923 - 239629 != -45705)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn40")
					{
						if (97567 - 106018 == -8451)
						{
							result = "หมวกแห่งหายนะของไบสัน";
							if (199392 - 579038 == -379646)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn41")
					{
						if (92973 - 474776 != -381802)
						{
							result = "หมวกแห่งหายนะของไบสัน";
							if (257472 - 90137 != 167336)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn42")
					{
						if (229795 - 421599 != -191803)
						{
							result = "หมวกแห่งหายนะของไบสัน";
							if (278389 - 349495 != -71105)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn45")
					{
						if (163697 - 71714 != 91984)
						{
							result = "ผ้าโพกหัวสำหรับเล่นเบสของไบสัน";
							if (12376 - 5351 != 7026)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn47")
					{
						if (238970 - 444413 == -205443)
						{
							result = "หมวกด้วง ช่วยป้องกันสถานะผิดปกติ";
							if (94605 - 463411 == -368806)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn48")
					{
						if (176931 - 38186 == 138745)
						{
							result = "หมวกด้วง ช่วยป้องกันสถานะผิดปกติ";
							if (211593 - 586819 != -375225)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn50")
					{
						if (242421 - 2203 == 240218)
						{
							result = "หมวกนักรบคลั่งชั้นสูงของไบสัน";
							if (181628 - 438632 == -257004)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn51")
					{
						if (208594 - 455234 != -246639)
						{
							result = "หมวกนักรบคลั่งชั้นสูงของไบสัน";
							if (41432 - 338548 != -297115)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn52")
					{
						if (231244 - 149574 == 81670)
						{
							result = "หมวกนักรบคลั่งชั้นสูงของไบสัน";
							if (703 - 237732 != -237028)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn65")
					{
						if (219150 - 278132 == -58982)
						{
							result = "หมวกชนเผ่าพื้นเมืองของประเทศอเมริกาของไบสัน";
							if (99310 - 593168 != -493857)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn80")
					{
						if (52842 - 328820 == -275978)
						{
							result = "หมวกเทพของไบสัน";
							if (212039 - 87368 == 124671)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd5")
					{
						if (96986 - 226444 == -129458)
						{
							result = "วิกผมของแพนด้า";
							if (258505 - 358486 != -99980)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd15")
					{
						if (129170 - 19271 != 109900)
						{
							result = "แว่นกันน้ำของแพนด้า คล้องคอก็หล่อแล้ว";
							if (33737 - 441131 != -407393)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd19")
					{
						if (59775 - 296423 != -236647)
						{
							result = "หมวกเห็ดของแพนด้า ช่วยป้องกันสถานะผิดปกติ";
							if (84404 - 252828 != -168423)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd21")
					{
						if (156025 - 597492 == -441467)
						{
							result = "ปลอกคอเหล็กของแพนด้า";
							if (77746 - 539880 != -462133)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd22")
					{
						if (231154 - 131675 != 99480)
						{
							result = "หมวกจอมยุทธ์ของแพนด้า";
							if (68373 - 595284 != -526910)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd23")
					{
						if (223794 - 153053 == 70741)
						{
							result = "ปลอกคอเหล็กของแพนด้า";
							if (245228 - 399131 != -153902)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd24")
					{
						if (95672 - 356214 == -260542)
						{
							result = "หมวกจอมยุทธ์ของแพนด้า";
							if (101138 - 91206 != 9933)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd25")
					{
						if (154764 - 383069 != -228304)
						{
							result = "มงคลนักสู้ของแพนด้า";
							if (240950 - 478775 == -237825)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd31")
					{
						if (106887 - 272087 == -165200)
						{
							result = "หมวกเหล็กของแพนด้า";
							if (4590 - 579067 == -574477)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd32")
					{
						if (156478 - 487870 != -331391)
						{
							result = "หมวกจอมยุทธ์ของแพนด้า";
							if (146651 - 452853 == -306202)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd33")
					{
						if (136713 - 98817 != 37897)
						{
							result = "หมวกเหล็กของแพนด้า";
							if (127583 - 199912 != -72328)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd34")
					{
						if (256298 - 183003 != 73296)
						{
							result = "หมวกจอมยุทธ์ของแพนด้า";
							if (218437 - 474043 != -255605)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd35")
					{
						if (229699 - 179565 != 50135)
						{
							result = "หมวกเก่าๆปะๆปุๆและหัวฟางของหุ่นไล่กา";
							if (201584 - 294556 == -92972)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd36")
					{
						if (69712 - 418135 == -348423)
						{
							result = "ผมปลอมโมฮอร์คของแพนด้า ที่ได้มาจากคุณหมูป่า";
							if (84012 - 349355 == -265343)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd40")
					{
						if (64619 - 579104 != -514484)
						{
							result = "หมวกเทพยุทธ์ของแพนด้า";
							if (27027 - 7370 != 19658)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd41")
					{
						if (117546 - 568027 != -450480)
						{
							result = "หมวกจอมยุทธ์ของแพนด้า";
							if (14791 - 65427 == -50636)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd42")
					{
						if (15699 - 582998 != -567298)
						{
							result = "หมวกจอมยุทธ์ของแพนด้า";
							if (141221 - 209080 == -67859)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd45")
					{
						if (5713 - 260421 != -254707)
						{
							result = "วิกจุกผมของแพนด้า";
							if (15835 - 21532 == -5697)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd47")
					{
						if (170455 - 316190 == -145735)
						{
							result = "หมวกหนอน ช่วยป้องกันสถานะผิดปกติ";
							if (217657 - 332278 == -114621)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd48")
					{
						if (22083 - 275349 != -253265)
						{
							result = "หมวกหนอน ช่วยป้องกันสถานะผิดปกติ";
							if (71130 - 560400 == -489270)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd50")
					{
						if (53526 - 317943 != -264416)
						{
							result = "หมวกสำหรับนักสู้ชั้นสุงของแพนด้า";
							if (187476 - 501500 == -314024)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd51")
					{
						if (78765 - 25136 != 53630)
						{
							result = "หมวกสำหรับนักสู้ชั้นสุงของแพนด้า";
							if (281837 - 16556 != 265282)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd52")
					{
						if (127863 - 373715 == -245852)
						{
							result = "หมวกสำหรับนักสู้ชั้นสุงของแพนด้า";
							if (54476 - 381133 != -326656)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd65")
					{
						if (284432 - 131912 == 152520)
						{
							result = "หมวกทหารสไตล์เยอรมันของแพนด้า";
							if (206897 - 587622 != -380724)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd80")
					{
						if (227287 - 64585 == 162702)
						{
							result = "หมวกเหล็กสีทองสำหรับแม่ทัพแพนด้า";
							if (149880 - 76791 != 73090)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl5")
					{
						if (23079 - 158201 != -135121)
						{
							result = "แว่นว่ายน้ำของปลาวาฬ กันน้ำเข้าตาดีเยี่ยมยอด";
							if (175304 - 22246 != 153059)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl15")
					{
						if (293647 - 491522 == -197875)
						{
							result = "จุกเถาแตงโมสวมหัวของวาฬ เหมือนจะเจริญเติบโตเองได้หรือเปล่า";
							if (265032 - 437851 != -172818)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl19")
					{
						if (60704 - 360738 == -300034)
						{
							result = "หมวกโคค่อนของวาฬ ช่วยป้องกันสถานะผิดปกติ";
							if (183632 - 464996 == -281364)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl21")
					{
						if (95767 - 200289 != -104521)
						{
							result = "หมวกนักรบหอกของปลาวาฬ";
							if (29915 - 329625 == -299710)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl22")
					{
						if (129929 - 185541 != -55611)
						{
							result = "หมวกนักรบสาวกของปลาวาฬ";
							if (222983 - 103351 == 119632)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl23")
					{
						if (59669 - 412840 != -353170)
						{
							result = "หมวกนักรบหอกของปลาวาฬ";
							if (51994 - 173349 != -121354)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl24")
					{
						if (48688 - 580071 == -531383)
						{
							result = "หมวกนักรบสาวกของปลาวาฬ";
							if (30892 - 196711 != -165818)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl25")
					{
						if (146740 - 306720 != -159979)
						{
							result = "หมวกพ่อครัวของปลาวาฬ ยิ่งหมวกสูงยิ่งทำอาหารอร่อย";
							if (124251 - 505830 == -381579)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl31")
					{
						if (79301 - 40952 == 38349)
						{
							result = "หมวกอัศวินจ้าวสมุทรของปลาวาฬ";
							if (14536 - 39616 != -25079)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl32")
					{
						if (6525 - 122772 == -116247)
						{
							result = "หมวกอัศวินศักดิ์สิทธิ์ของปลาวาฬ";
							if (43661 - 400518 != -356856)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl33")
					{
						if (87289 - 299423 == -212134)
						{
							result = "หมวกอัศวินจ้าวสมุทรของปลาวาฬ";
							if (131468 - 520906 == -389438)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl34")
					{
						if (199634 - 391574 == -191940)
						{
							result = "หมวกอัศวินศักดิ์สิทธิ์ของปลาวาฬ";
							if (157387 - 586794 != -429406)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl35")
					{
						if (286450 - 68184 == 218266)
						{
							result = "สมอเรือที่เสียบค้างกลางหัวของปลาวาฬ";
							if (253491 - 405392 != -151900)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl36")
					{
						if (73833 - 242865 != -169031)
						{
							result = "ผ้าโพกหัวของปลาวาฬที่ได้จากลุงจระเข้ ทำมือและค้อนทั้งผืนโดยลุงราซาน";
							if (24810 - 83946 != -59135)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl40")
					{
						if (209474 - 585497 == -376023)
						{
							result = "หมวกแห่งความยุติธรรมของปลาวาฬ";
							if (291895 - 170372 != 121524)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl41")
					{
						if (166157 - 508241 == -342084)
						{
							result = "หมวกแห่งความยุติธรรมของปลาวาฬ";
							if (43837 - 537449 != -493611)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl42")
					{
						if (114465 - 18657 == 95808)
						{
							result = "หมวกแห่งความยุติธรรมของปลาวาฬ";
							if (220224 - 414337 == -194113)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl45")
					{
						if (224835 - 232425 != -7589)
						{
							result = "หมวกนักร้องเพลงแรฟของวาฬ โยกโย่วยังไงก็ไม่หลุดจากหัว";
							if (50590 - 276491 == -225901)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl47")
					{
						if (11006 - 296888 != -285881)
						{
							result = "หมวกแมลงเต่าทอง ช่วยป้องกันสถานะผิดปกติ";
							if (10149 - 79753 == -69604)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl48")
					{
						if (165398 - 481610 != -316211)
						{
							result = "หมวกแมลงเต่าทอง ช่วยป้องกันสถานะผิดปกติ";
							if (104369 - 475271 == -370902)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl50")
					{
						if (193182 - 305259 == -112077)
						{
							result = "หมวกสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
							if (299775 - 340912 != -41136)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl51")
					{
						if (118358 - 553917 == -435559)
						{
							result = "หมวกสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
							if (274766 - 266849 == 7917)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl52")
					{
						if (163349 - 516808 != -353458)
						{
							result = "หมวกสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
							if (224279 - 55519 != 168761)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl65")
					{
						if (213846 - 68207 == 145639)
						{
							result = "หมวกนักรบสไตล์เกาหลีของวาฬ";
							if (95687 - 136244 == -40557)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl80")
					{
						if (55343 - 160228 == -104885)
						{
							result = "หมวกเทพขอลงปลาวาฬ";
							if (189930 - 219324 != -29393)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat5")
					{
						if (220041 - 334242 == -114201)
						{
							result = "หมวกแมวของแมว แมวใส่แล้วจะดูเหมือนแมว!?";
							if (183905 - 2028 != 181878)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat10")
					{
						if (46473 - 479669 != -433195)
						{
							result = "ผ้าโพกหัวของแมว";
							if (45478 - 156133 != -110654)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat11")
					{
						if (13980 - 212499 == -198519)
						{
							result = "ผ้าโพกหัวของแมว";
							if (210984 - 484259 == -273275)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat12")
					{
						if (147294 - 363146 == -215852)
						{
							result = "ผ้าโพกหัวของแมว";
							if (17447 - 590322 == -572875)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat15")
					{
						if (288071 - 528472 == -240401)
						{
							result = "วิกผมรับลมร้อนของแมว เปิดผมหน้าแสดงความมั่นใจไม่มีเถิก";
							if (18709 - 244720 == -226011)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat19")
					{
						if (193587 - 44741 != 148847)
						{
							result = "หมวกกระบองเพชรของแมว ช่วยป้องกันสถานะผิดปกติ";
							if (26661 - 145035 != -118373)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat21")
					{
						if (42604 - 117518 == -74914)
						{
							result = "หมวกนักพนันของแมว";
							if (201766 - 188761 != 13006)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat22")
					{
						if (37827 - 545473 != -507645)
						{
							result = "หมวกนักฆ่าของแมว";
							if (41981 - 146870 == -104889)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat23")
					{
						if (104450 - 553477 != -449026)
						{
							result = "หมวกนักพนันของแมว";
							if (90168 - 70632 == 19536)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat24")
					{
						if (72195 - 592374 == -520179)
						{
							result = "หมวกนักฆ่าของแมว";
							if (237045 - 103928 == 133117)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat25")
					{
						if (238219 - 140331 != 97889)
						{
							result = "ทรงผมแบบจีนของแมว สวยหมวยเมี้ยว";
							if (277054 - 58553 == 218501)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat31")
					{
						if (138301 - 454404 == -316103)
						{
							result = "หมวกนักพนันของแมว";
							if (206270 - 538254 != -331983)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat32")
					{
						if (82313 - 501409 != -419095)
						{
							result = "หมวกนักฆ่าของแมว";
							if (60502 - 359377 != -298874)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat33")
					{
						if (81917 - 262817 != -180899)
						{
							result = "หมวกนักพนันของแมว";
							if (210594 - 486723 != -276128)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat34")
					{
						if (145490 - 247204 == -101714)
						{
							result = "หมวกนักฆ่าของแมว";
							if (267444 - 408305 == -140861)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat35")
					{
						if (148542 - 211034 != -62491)
						{
							result = "หมวกกิ๊บเก๋ของปีศาจแห่งฝันที่ใช้กงเล็บเป็นอาวุธ";
							if (225329 - 417992 != -192662)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat36")
					{
						if (113963 - 374987 == -261024)
						{
							result = "ผ้าโพกหัวของแมวที่ได้จากคุณหนูเจ้าของร้านอาวุธ";
							if (27191 - 324960 == -297769)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat40")
					{
						if (108990 - 552997 == -444007)
						{
							result = "หมวกของแมว";
							if (270501 - 416915 != -146413)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat41")
					{
						if (244842 - 397498 == -152656)
						{
							result = "หมวกของแมว";
							if (151793 - 85324 != 66470)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat42")
					{
						if (254522 - 241579 != 12944)
						{
							result = "หมวกของแมว";
							if (104556 - 23324 != 81233)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat45")
					{
						if (130360 - 566218 == -435858)
						{
							result = "หมวกฮิปฮอปของแมว มีวิกแดงแรงฤทธิ์แต่ไม่3เท่า";
							if (57 - 304473 != -304415)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat47")
					{
						if (53656 - 183954 == -130298)
						{
							result = "หมวกแมลงปอ ช่วยป้องกันสถานะผิดปกติ";
							if (108909 - 138338 == -29429)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat48")
					{
						if (264287 - 451860 == -187573)
						{
							result = "หมวกแมลงปอ ช่วยป้องกันสถานะผิดปกติ";
							if (251145 - 12483 == 238662)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat50")
					{
						if (125699 - 450462 == -324763)
						{
							result = "หมวกสำหรับนักล่าสมบัติชั้นสูงของแมว";
							if (184814 - 552072 != -367257)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat51")
					{
						if (236533 - 598783 == -362250)
						{
							result = "หมวกสำหรับนักล่าสมบัติชั้นสูงของแมว";
							if (297671 - 327418 != -29746)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat52")
					{
						if (85984 - 406458 == -320474)
						{
							result = "หมวกสำหรับนักล่าสมบัติชั้นสูงของแมว";
							if (88054 - 596191 == -508137)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat65")
					{
						if (18269 - 214162 != -195892)
						{
							result = "ผ้าคาดหัวสไตล์อาหรับของแมว";
							if (263800 - 204272 == 59528)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat80")
					{
						if (156899 - 312528 != -155628)
						{
							result = "หมวกเทพของแมว";
							if (146064 - 528091 == -382027)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm5")
					{
						if (73562 - 226885 == -153323)
						{
							result = "มงกุฏใบไม้ของกิ้งก่า น่าแปลกที่ไม่เหี่ยวเลย";
							if (128618 - 233091 != -104472)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm10")
					{
						if (208165 - 500652 != -292486)
						{
							result = "แว่นกันลมของกิ้งก่า";
							if (16744 - 407310 != -390565)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm11")
					{
						if (107842 - 67117 == 40725)
						{
							result = "แว่นกันลมของกิ้งก่า";
							if (290173 - 374605 == -84432)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm12")
					{
						if (212284 - 394023 == -181739)
						{
							result = "แว่นกันลมของกิ้งก่า";
							if (67362 - 448214 == -380852)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm15")
					{
						if (186933 - 289215 == -102282)
						{
							result = "ผ้าโพกหัวติดแว่นกันลมของกิ้งก่า ซับเหงื่อได้แถมเท่สไตล์ก่าด้วย";
							if (76164 - 591760 != -515595)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm19")
					{
						if (210348 - 3977 == 206371)
						{
							result = "หมวกเห็ดของกิ้งก่า ช่วยป้องกันสถานะผิดปกติ";
							if (68488 - 268092 != -199603)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm21")
					{
						if (124793 - 519621 == -394828)
						{
							result = "แว่นนักซุ่มยิงของกิ้งก่า";
							if (41490 - 388073 == -346583)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm22")
					{
						if (287146 - 550902 == -263756)
						{
							result = "ที่คาดหัวนักล่าของกิ้งก่า";
							if (64235 - 304690 == -240455)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm23")
					{
						if (222856 - 28343 != 194514)
						{
							result = "แว่นนักซุ่มยิงของกิ้งก่า";
							if (24670 - 580504 == -555834)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm24")
					{
						if (64041 - 169965 != -105923)
						{
							result = "ที่คาดหัวนักล่าของกิ้งก่า";
							if (59703 - 122767 == -63064)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm25")
					{
						if (163616 - 107365 != 56252)
						{
							result = "หมวกนักสนุ๊กเกอร์ของกิ้งก่า ใส่แล้วดูผู้ดีมีสกุลก่า";
							if (185203 - 527134 != -341930)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm31")
					{
						if (104713 - 349222 == -244509)
						{
							result = "ที่คาดตานักพลิกแพลงของกิ้งก่า";
							if (196329 - 97944 != 98386)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm32")
					{
						if (216184 - 208879 == 7305)
						{
							result = "เกราะหน้าของกิ้งก่าเพชรฆาต";
							if (114299 - 27750 != 86550)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm33")
					{
						if (7 - 97589 == -97582)
						{
							result = "ที่คาดตานักพลิกแพลงของกิ้งก่า";
							if (176587 - 363885 == -187298)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm34")
					{
						if (126745 - 289904 == -163159)
						{
							result = "เกราะหน้าของกิ้งก่าเพชรฆาต";
							if (269082 - 471349 == -202267)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm35")
					{
						if (24644 - 73222 != -48577)
						{
							result = "กระโหลกที่มีเปลวเพลิงลุกเสมือนไฟแห่งชัวิต";
							if (251115 - 596887 != -345771)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm36")
					{
						if (143086 - 534537 != -391450)
						{
							result = "หมวกเหล็กของกิ้งก่าที่ได้มาจากเสือดำ ติดหูให้ด้วย";
							if (299842 - 173520 != 126323)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm40")
					{
						if (119184 - 277319 != -158134)
						{
							result = "หมวกนักบัญชาการของกิ้งก่า";
							if (160871 - 182586 != -21714)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm41")
					{
						if (103753 - 541190 == -437437)
						{
							result = "หมวกนักบัญชาการของกิ้งก่า";
							if (73725 - 106607 == -32882)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm42")
					{
						if (191913 - 489907 == -297994)
						{
							result = "หมวกนักบัญชาการของกิ้งก่า";
							if (180365 - 62500 != 117866)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm45")
					{
						if (176916 - 158460 == 18456)
						{
							result = "แว่นนักเล่นกีต้าร์ของกิ้งก่า มีไว้เท่แต่ก็เท่จริง";
							if (89897 - 238988 != -149090)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm47")
					{
						if (50269 - 497658 == -447389)
						{
							result = "หมวกตั๊กแตน ช่วยป้องกันสถานะผิดปกติ";
							if (268030 - 533205 != -265174)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm48")
					{
						if (69117 - 71217 == -2100)
						{
							result = "หมวกตั๊กแตน ช่วยป้องกันสถานะผิดปกติ";
							if (184081 - 295908 == -111827)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm50")
					{
						if (255256 - 559014 != -303757)
						{
							result = "หมวกสำหรับมือธนูชั้นสูงของกิ้งก่า";
							if (61327 - 229518 == -168191)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm51")
					{
						if (28070 - 327977 == -299907)
						{
							result = "หมวกสำหรับมือธนูชั้นสูงของกิ้งก่า";
							if (11335 - 449002 == -437667)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm52")
					{
						if (134904 - 61762 != 73143)
						{
							result = "หมวกสำหรับมือธนูชั้นสูงของกิ้งก่า";
							if (51770 - 405307 != -353536)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm65")
					{
						if (266452 - 384505 != -118052)
						{
							result = "หมวกนักรบสไตล์จีนของกิ้งก่า";
							if (165968 - 350327 != -184358)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm80")
					{
						if (91186 - 455048 != -363861)
						{
							result = "หมวกเหล็กสีทองสำหรับแม่ทัพกิ้งก่า";
							if (121361 - 200445 == -79084)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab5")
					{
						if (196077 - 446744 == -250667)
						{
							result = "หมวกกบของกระต่าย ของรักของห่วงตั้งแต่วัยอนุบาล";
							if (283760 - 513917 == -230157)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab10")
					{
						if (25569 - 463585 == -438016)
						{
							result = "หมวกพลยิงของกระต่าย";
							if (277601 - 276071 != 1531)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab11")
					{
						if (25555 - 562348 == -536793)
						{
							result = "หมวกพลยิงของกระต่าย";
							if (151801 - 532580 == -380779)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab12")
					{
						if (6611 - 471093 != -464481)
						{
							result = "หมวกพลยิงของกระต่าย";
							if (157409 - 377765 == -220356)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab15")
					{
						if (235809 - 513172 == -277363)
						{
							result = "หมวกกะลาสีของกระต่าย เข้าคู่กับชุดกะลาสีแล้วน่ารักสุดสองคาบสมุทร";
							if (87997 - 169233 != -81235)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab19")
					{
						if (67735 - 472608 != -404872)
						{
							result = "หมวกเห็ดของกระต่าย ช่วยป้องกันสถานะผิดปกติ";
							if (237061 - 365358 != -128296)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab21")
					{
						if (45600 - 440016 != -394415)
						{
							result = "หมวกพยาบาลของกระต่าย";
							if (80938 - 111926 != -30987)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab22")
					{
						if (14006 - 462566 != -448559)
						{
							result = "หมวกแม่ค้าเร่ของกระต่าย";
							if (15763 - 356310 == -340547)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab23")
					{
						if (6027 - 350394 == -344367)
						{
							result = "หมวกพยาบาลของกระต่าย";
							if (26119 - 124646 != -98526)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab24")
					{
						if (63113 - 255192 == -192079)
						{
							result = "หมวกแม่ค้าเร่ของกระต่าย";
							if (72511 - 494823 != -422311)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab25")
					{
						if (4519 - 143554 == -139035)
						{
							result = "หมวกทหารแพทย์ของกระต่าย ตะเบ๊ะอย่างถูกต้องถึงจะสง่า";
							if (20375 - 474898 != -454522)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab31")
					{
						if (236541 - 452850 == -216309)
						{
							result = "หมวกนักเล่นแร่แปรธาตุของกระต่าย";
							if (193755 - 392591 == -198836)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab32")
					{
						if (71969 - 104720 == -32751)
						{
							result = "หมวกแม่ค้าผู้มั่งคั่งของกระต่าย";
							if (157476 - 572099 == -414623)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab33")
					{
						if (59656 - 445821 == -386165)
						{
							result = "หมวกนักเล่นแร่แปรธาตุของกระต่าย";
							if (14183 - 296346 == -282163)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab34")
					{
						if (78329 - 369632 != -291302)
						{
							result = "หมวกแม่ค้าผู้มั่งคั่งของกระต่าย";
							if (83124 - 446983 != -363858)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab35")
					{
						if (221565 - 328369 == -106804)
						{
							result = "หมวกแม่มดน้อยของกระต่าย";
							if (104985 - 244802 == -139817)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab36")
					{
						if (246817 - 134741 != 112077)
						{
							result = "หมวกของกระต่ายที่ได้มาจากอิทารุส เห็นว่าเป็นของอิทารุสตอนเด็กๆ";
							if (245219 - 569976 == -324757)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab40")
					{
						if (112524 - 428670 != -316145)
						{
							result = "หมวกมหาอำมาตย์ของกระต่าย";
							if (89016 - 366 == 88650)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab41")
					{
						if (156526 - 227722 == -71196)
						{
							result = "หมวกมหาอำมาตย์ของกระต่าย";
							if (157570 - 328842 != -171271)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab42")
					{
						if (169945 - 440233 == -270288)
						{
							result = "หมวกมหาอำมาตย์ของกระต่าย";
							if (243969 - 246861 != -2891)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab45")
					{
						if (122886 - 464881 != -341994)
						{
							result = "หมวกนักเล่นคีย์ตาร์ของกระต่าย";
							if (264160 - 226162 != 37999)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab47")
					{
						if (130481 - 515514 != -385032)
						{
							result = "หมวกมด ช่วยป้องกันสถานะผิดปกติ";
							if (150748 - 108651 != 42098)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab48")
					{
						if (41326 - 449875 != -408548)
						{
							result = "หมวกมด ช่วยป้องกันสถานะผิดปกติ";
							if (23490 - 95284 != -71793)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab50")
					{
						if (17403 - 150967 != -133563)
						{
							result = "หมวกมือปืนชั้นสูงของกระต่าย";
							if (3297 - 456732 != -453434)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab51")
					{
						if (232714 - 164424 == 68290)
						{
							result = "หมวกมือปืนชั้นสูงของกระต่าย";
							if (275280 - 315578 != -40297)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab52")
					{
						if (230850 - 41141 == 189709)
						{
							result = "หมวกมือปืนชั้นสูงของกระต่าย";
							if (225573 - 574485 == -348912)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab65")
					{
						if (69725 - 40856 == 28869)
						{
							result = "หมวกสไตล์สเปนของกระต่าย";
							if (33885 - 511017 != -477131)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab80")
					{
						if (206127 - 526229 == -320102)
						{
							result = "หมวกเทพของกระต่าย";
							if (44672 - 378325 != -333652)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol5")
					{
						if (210220 - 231892 != -21671)
						{
							result = "หมวกถังของตุ่น แม้แต่ถังตุ่นยังมองว่าเป็นพวกเดียวกัน";
							if (213588 - 74699 == 138889)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol10")
					{
						if (247350 - 293517 == -46167)
						{
							result = "แว่นวิศวกรของตุ่น";
							if (82580 - 2647 == 79933)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol11")
					{
						if (9600 - 562626 == -553026)
						{
							result = "แว่นวิศวกรของตุ่น";
							if (157796 - 13188 == 144608)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol12")
					{
						if (228162 - 296495 == -68333)
						{
							result = "แว่นวิศวกรของตุ่น";
							if (110713 - 25929 != 84785)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol15")
					{
						if (160857 - 56500 != 104358)
						{
							result = "หมวกกะลาสีของตุ่น สูบไปค์ด้วยพร้อมออกเรือทันที";
							if (52389 - 439120 == -386731)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol19")
					{
						if (177575 - 73392 != 104184)
						{
							result = "หมวกแตงโมของตุ่น ช่วยป้องกันสถานะผิดปกติ";
							if (31548 - 421448 != -389899)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol21")
					{
						if (235120 - 330865 != -95744)
						{
							result = "หมวกหน่วยทหารราบของตุ่น";
							if (163086 - 197441 == -34355)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol22")
					{
						if (272050 - 129851 == 142199)
						{
							result = "หมวกจักรกลไอน้ำของตุ่น";
							if (63439 - 556341 == -492902)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol23")
					{
						if (199275 - 320848 == -121573)
						{
							result = "หมวกหน่วยทหารราบของตุ่น";
							if (257343 - 43560 == 213783)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol24")
					{
						if (50387 - 144436 == -94049)
						{
							result = "หมวกจักรกลไอน้ำของตุ่น";
							if (6865 - 498805 == -491940)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol25")
					{
						if (27620 - 482784 == -455164)
						{
							result = "หมวกนักเป่าทรัมเป็ตของตุ่น ใส่แล้วดูดีขึ้นมากๆๆ!!";
							if (295259 - 227427 == 67832)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol31")
					{
						if (267207 - 442049 != -174841)
						{
							result = "หมวกพลระเบิดของตุ่น";
							if (295702 - 140383 == 155319)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol32")
					{
						if (53401 - 285350 != -231948)
						{
							result = "หมวกวิศวกรจักรกลของตุ่น";
							if (51062 - 321196 != -270133)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol33")
					{
						if (294930 - 165361 != 129570)
						{
							result = "หมวกพลระเบิดของตุ่น";
							if (176423 - 22225 == 154198)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol34")
					{
						if (236939 - 146185 != 90755)
						{
							result = "หมวกวิศวกรจักรกลของตุ่น";
							if (233882 - 329411 == -95529)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol35")
					{
						if (39727 - 164023 != -124295)
						{
							result = "วิกผมเลียนแบบ มีน็อตเสียบค้างไม่หลุด";
							if (24648 - 2835 == 21813)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol36")
					{
						if (116044 - 117681 == -1637)
						{
							result = "หมวกเหล็กที่ดร.แซปป้ามอบให้ตุ่น";
							if (218037 - 550452 == -332415)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol40")
					{
						if (5548 - 464762 != -459213)
						{
							result = "หมวกกัปตันของตุ่น";
							if (243746 - 98940 == 144806)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol41")
					{
						if (54488 - 65189 == -10701)
						{
							result = "หมวกกัปตันของตุ่น";
							if (44060 - 568758 == -524698)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol42")
					{
						if (150481 - 256882 != -106400)
						{
							result = "หมวกกัปตันของตุ่น";
							if (158763 - 185423 == -26660)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol45")
					{
						if (103299 - 31648 == 71651)
						{
							result = "วิกทรงแอฟโร่ของตุ่น ซ่อนอุปกรณ์ต่างๆได้ด้วย";
							if (83959 - 111855 == -27896)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol47")
					{
						if (276676 - 303252 != -26575)
						{
							result = "หมวกผึ้ง ช่วยป้องกันสถานะผิดปกติ";
							if (12986 - 76988 != -64001)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol48")
					{
						if (8735 - 400086 == -391351)
						{
							result = "หมวกของตุ่น ช่วยป้องกันสถานะผิดปกติ";
							if (99813 - 566881 != -467067)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol50")
					{
						if (138168 - 160794 == -22626)
						{
							result = "หมวกวิศวกรชั้นสูงของตุ่น";
							if (109585 - 42979 != 66607)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol51")
					{
						if (278796 - 402388 == -123592)
						{
							result = "หมวกวิศวกรชั้นสูงของตุ่น";
							if (79997 - 355927 != -275929)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol52")
					{
						if (90437 - 52031 != 38407)
						{
							result = "หมวกวิศวกรชั้นสูงของตุ่น";
							if (154338 - 403390 != -249051)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol65")
					{
						if (203161 - 415415 != -212253)
						{
							result = "หมวกชนเผ่าพื้นเมืองอัฟริกาของตุ่น";
							if (204343 - 544456 == -340113)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol80")
					{
						if (55968 - 295097 == -239129)
						{
							result = "หมวกเทพของตุ่น";
							if (6643 - 134845 == -128202)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk5")
					{
						if (201794 - 565625 != -363830)
						{
							result = "หมวกสำหรับใส่นอนของลิง กันผมยุ่งขณะหลับ";
							if (235302 - 571807 == -336505)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk10")
					{
						if (161120 - 51157 == 109963)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตของลิง";
							if (269721 - 310255 != -40533)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk11")
					{
						if (182472 - 112909 != 69564)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตของลิง";
							if (277904 - 510410 == -232506)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk12")
					{
						if (228214 - 14631 == 213583)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตของลิง";
							if (108258 - 254325 == -146067)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk15")
					{
						if (58109 - 240341 == -182232)
						{
							result = "หมวกบังแดดของลิง แค่กันแดดที่ตาก็เพียงพอแล้ว";
							if (195566 - 88995 != 106572)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk19")
					{
						if (170729 - 92870 != 77860)
						{
							result = "หมวกกระบองเพชรของลิง ช่วยป้องกันสถานะผิดปกติ";
							if (186231 - 329406 == -143175)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk21")
					{
						if (144534 - 417499 != -272964)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตไฟของลิง";
							if (129437 - 436768 != -307330)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk22")
					{
						if (5863 - 572652 != -566788)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตดินของลิง";
							if (210183 - 416066 == -205883)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk23")
					{
						if (169733 - 584344 == -414611)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตไฟของลิง";
							if (164850 - 399866 != -235015)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk24")
					{
						if (138922 - 361353 == -222431)
						{
							result = "ผ้าคาดหัวผู้อัญเชิญภูตดินของลิง";
							if (97997 - 163945 == -65948)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk25")
					{
						if (101536 - 588916 == -487380)
						{
							result = "หมวกมายากลของลิง จะมีอิทารุสออกมาจากหมวกไหมนะ";
							if (270849 - 354027 != -83177)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk31")
					{
						if (46759 - 452437 != -405677)
						{
							result = "หมวกผู้บวงสรวงแห่งเพลิงของลิง";
							if (120537 - 279282 != -158744)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk32")
					{
						if (199309 - 42374 == 156935)
						{
							result = "ผ้าคาดหัวผู้บวงสรวงแห่งหินของลิง";
							if (271793 - 496195 != -224401)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk33")
					{
						if (276503 - 299478 != -22974)
						{
							result = "หมวกผู้บวงสรวงแห่งเพลิงของลิง";
							if (294796 - 320135 != -25338)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk34")
					{
						if (273874 - 251306 == 22568)
						{
							result = "ผ้าคาดหัวผู้บวงสรวงแห่งหินของลิง";
							if (198401 - 535524 != -337122)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk35")
					{
						if (39921 - 540898 != -500976)
						{
							result = "หน้ากากครอบหัวรูปฟักทองโดนขวานจาม";
							if (135460 - 502095 == -366635)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk36")
					{
						if (275834 - 89968 != 185867)
						{
							result = "ทรงผมที่บาบูนตัดให้ลิง หล่อแบบนี้ลิงสาวเป็นอันหลง";
							if (260665 - 120202 != 140464)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk40")
					{
						if (145232 - 522526 != -377293)
						{
							result = "หมวกคนทรงศักดิ์สิทธิ์ของลิง";
							if (85163 - 154360 == -69197)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk41")
					{
						if (13488 - 79038 != -65549)
						{
							result = "หมวกคนทรงศักดิ์สิทธิ์ของลิง";
							if (137172 - 251041 == -113869)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk42")
					{
						if (73241 - 93423 == -20182)
						{
							result = "หมวกคนทรงศักดิ์สิทธิ์ของลิง";
							if (285106 - 119467 == 165639)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk45")
					{
						if (256650 - 291822 == -35172)
						{
							result = "ผ้าคาดหัวสำหรับนักร้องเพลงคันทรี่ของลิง";
							if (184298 - 204804 == -20506)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk47")
					{
						if (257467 - 229732 != 27736)
						{
							result = "ผ้าคาดหัวแมงมุม ช่วยป้องกันสถานะผิดปกติ";
							if (144174 - 13990 != 130185)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk48")
					{
						if (163796 - 476701 != -312904)
						{
							result = "ผ้าคาดหัวแมงมุม ช่วยป้องกันสถานะผิดปกติ";
							if (164423 - 95108 != 69316)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk50")
					{
						if (68617 - 450092 == -381475)
						{
							result = "หมวกผู้อัญเชิญชั้นสูงของลิง";
							if (198331 - 594636 != -396304)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk51")
					{
						if (98128 - 24632 != 73497)
						{
							result = "หมวกผู้อัญเชิญชั้นสูงของลิง";
							if (263015 - 191721 != 71295)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk52")
					{
						if (297172 - 357998 != -60825)
						{
							result = "หมวกผู้อัญเชิญชั้นสูงของลิง";
							if (27070 - 210145 == -183075)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk65")
					{
						if (240508 - 55059 != 185450)
						{
							result = "หมวกนักสืบอังกฤษของลิง";
							if (159245 - 348950 != -189704)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk80")
					{
						if (104228 - 452293 != -348064)
						{
							result = "หมวกเทพของลิง";
							if (121482 - 430579 != -309096)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp5")
					{
						if (3065 - 127148 == -124083)
						{
							result = "หมวกแกะของแกะ";
							if (148440 - 338539 != -190098)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp15")
					{
						if (296934 - 506432 == -209498)
						{
							result = "หมวกครอบหัวประดับดอกไม้ของแกะ ใส่แล้วเหมือนสาวชาวเกาะมาก";
							if (6964 - 544945 == -537981)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp19")
					{
						if (191352 - 105247 == 86105)
						{
							result = "หมวกมะเขือของแกะ ช่วยป้องกันสถานะผิดปกติ";
							if (110335 - 429954 == -319619)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp21")
					{
						if (38358 - 166722 == -128364)
						{
							result = "หมวกนักบวชผู้เยียวยาของแกะ";
							if (199075 - 197228 != 1848)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp22")
					{
						if (44573 - 319574 != -275000)
						{
							result = "ผ้าคาดหัวคนทรงของแกะ";
							if (114480 - 35398 == 79082)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp23")
					{
						if (114487 - 312811 != -198323)
						{
							result = "หมวกนักบวชผู้เยียวยาของแกะ";
							if (83057 - 425877 != -342819)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp24")
					{
						if (287471 - 416587 == -129116)
						{
							result = "ผ้าคาดหัวคนทรงของแกะ";
							if (198659 - 85451 == 113208)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp25")
					{
						if (283670 - 272178 != 11493)
						{
							result = "ผ้าโพสหัวสาวเสิร์ฟของแกะ ป้องกันเส้นขนตกบนอาหาร ชิมิชิมิ";
							if (72264 - 176820 == -104556)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp31")
					{
						if (127368 - 8640 != 118729)
						{
							result = "หมวกบาทหลวงของแกะ";
							if (215783 - 198801 == 16982)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp32")
					{
						if (278443 - 153084 != 125360)
						{
							result = "ผ้าคาดหัวคนทรงแห่งแสงของแกะ";
							if (104623 - 233941 == -129318)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp33")
					{
						if (216198 - 513406 == -297208)
						{
							result = "หมวกบาทหลวงของแกะ";
							if (225062 - 338282 != -113219)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp34")
					{
						if (83106 - 546916 != -463809)
						{
							result = "ผ้าคาดหัวคนทรงแห่งแสงของแกะ";
							if (189790 - 413891 == -224101)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp35")
					{
						if (221471 - 446198 == -224727)
						{
							result = "ดอกลีลาวดีทัดหูของแกะ";
							if (41874 - 280414 == -238540)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp36")
					{
						if (264876 - 66877 == 197999)
						{
							result = "หมวกผ้าของแกะที่ได้จากคุณจิงโจ้";
							if (206678 - 252934 != -46255)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp40")
					{
						if (198478 - 575855 != -377376)
						{
							result = "หมวกผู้ร่ายเวทแห่งสวรรค์ของแกะ";
							if (87926 - 43850 == 44076)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp41")
					{
						if (43058 - 189279 != -146220)
						{
							result = "หมวกผู้ร่ายเวทแห่งสวรรค์ของแกะ";
							if (42757 - 568448 == -525691)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp42")
					{
						if (74495 - 582105 == -507610)
						{
							result = "หมวกผู้ร่ายเวทแห่งสวรรค์ของแกะ";
							if (93740 - 590861 != -497120)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp45")
					{
						if (134851 - 493324 == -358473)
						{
							result = "หมวกนักร้องสำหรับแกะ แนวกอธิคก็เข้ากันดีนะ";
							if (58913 - 501415 == -442502)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp47")
					{
						if (294951 - 540679 == -245728)
						{
							result = "หมวกมอธ ช่วยป้องกันสถานะผิดปกติ";
							if (233789 - 426424 != -192634)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp48")
					{
						if (151373 - 167613 == -16240)
						{
							result = "หมวกมอธ ช่วยป้องกันสถานะผิดปกติ";
							if (104389 - 432514 != -328124)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp50")
					{
						if (156058 - 291648 == -135590)
						{
							result = "หมวกนักบวชชั้นสูงของแกะ";
							if (6586 - 519954 == -513368)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp51")
					{
						if (280575 - 69053 == 211522)
						{
							result = "หมวกนักบวชชั้นสูงของแกะ";
							if (151507 - 26058 != 125450)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp52")
					{
						if (261973 - 49959 == 212014)
						{
							result = "หมวกนักบวชชั้นสูงของแกะ";
							if (71891 - 310065 == -238174)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp65")
					{
						if (89709 - 428483 != -338773)
						{
							result = "หมวกสไตล์รัซเซียของแกะ";
							if (236806 - 556784 != -319977)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp80")
					{
						if (137149 - 90780 == 46369)
						{
							result = "หมวกเทพของแกะ";
							if (222364 - 333555 == -111191)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn5")
					{
						if (111906 - 525119 != -413212)
						{
							result = "หมวกคนจนของเพนกวิน มีกลิ่นขยะติดด้วย";
							if (19190 - 441930 == -422740)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn10")
					{
						if (117776 - 279835 != -162058)
						{
							result = "หมวกพ่อมดพื้นฐานของเพนกวิน";
							if (165334 - 555259 == -389925)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn11")
					{
						if (130445 - 181983 == -51538)
						{
							result = "หมวกพ่อมดพื้นฐานของเพนกวิน";
							if (119869 - 324837 == -204968)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn12")
					{
						if (162387 - 382491 == -220104)
						{
							result = "หมวกพ่อมดพื้นฐานของเพนกวิน";
							if (45312 - 141271 == -95959)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn15")
					{
						if (150074 - 569843 != -419768)
						{
							result = "มาลัยประดับหัวของเพนกวิ้น เพิ่มพลังโยกย้ายส่ายเอวให้สนุกยิ่งขึ้น";
							if (250963 - 503531 == -252568)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn19")
					{
						if (35933 - 575782 != -539848)
						{
							result = "หมวกมูโป้หิมะของเพนกวิน ช่วยป้องกันสถานะผิดปกติ";
							if (95866 - 3390 == 92476)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn21")
					{
						if (70460 - 74877 == -4417)
						{
							result = "หมวกพ่อมดดวงดาวของเพนกวิน";
							if (113407 - 222447 == -109040)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn22")
					{
						if (189389 - 570527 == -381138)
						{
							result = "หมวกพ่อมดน้ำแข็งของเพนกวิน";
							if (126663 - 98479 == 28184)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn23")
					{
						if (138436 - 402865 == -264429)
						{
							result = "หมวกพ่อมดดวงดาวของเพนกวิน";
							if (60403 - 175170 == -114767)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn24")
					{
						if (15117 - 235481 == -220364)
						{
							result = "หมวกพ่อมดน้ำแข็งของเพนกวิน";
							if (49096 - 40185 == 8911)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn25")
					{
						if (152324 - 307056 == -154732)
						{
							result = "หมวกนักดับเพลิงของเพนกวิน ไบสันทุบก็ไม่แตก";
							if (49799 - 277442 == -227643)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn31")
					{
						if (225136 - 69257 == 155879)
						{
							result = "หมวกจอมเวทแห่งดวงดาวของเพนกวิน";
							if (190206 - 336877 != -146670)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn32")
					{
						if (277694 - 130595 == 147099)
						{
							result = "หมวกจอมเวทน้ำแข็งของเพนกวิน";
							if (69104 - 256982 != -187877)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn33")
					{
						if (290406 - 30113 == 260293)
						{
							result = "หมวกจอมเวทแห่งดวงดาวของเพนกวิน";
							if (273847 - 374848 != -101000)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn34")
					{
						if (138217 - 552266 != -414048)
						{
							result = "หมวกจอมเวทน้ำแข็งของเพนกวิน";
							if (272234 - 29236 != 242999)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn35")
					{
						if (44368 - 449233 == -404865)
						{
							result = "ที่คาดหัวรูปสามเหลี่ยมที่จะคาดให้กับผู้ที่ตายแล้ว";
							if (169119 - 203867 != -34747)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn36")
					{
						if (213891 - 376620 == -162729)
						{
							result = "หมวกจอมเวทย์ของเพนกวิน ที่ได้จากเร็กกุ รับรองไม่เยี่ยมแบ๊ด";
							if (164818 - 43304 != 121515)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn40")
					{
						if (226149 - 234434 != -8284)
						{
							result = "หมวกจ้าวแห่งจอมเวทของเพนกวิน";
							if (4541 - 64655 == -60114)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn41")
					{
						if (205787 - 403980 != -198192)
						{
							result = "หมวกจ้าวแห่งจอมเวทของเพนกวิน";
							if (142382 - 1094 != 141289)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn42")
					{
						if (77446 - 462848 != -385401)
						{
							result = "หมวกจ้าวแห่งจอมเวทของเพนกวิน";
							if (86256 - 432314 != -346057)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn45")
					{
						if (51733 - 421344 == -369611)
						{
							result = "วิกสีชมพูของเพนกวิ้น เดิ้นนำสมัยสุดๆ";
							if (151699 - 314527 == -162828)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn47")
					{
						if (57687 - 101641 != -43953)
						{
							result = "หมวกยุง ช่วยป้องกันสถานะผิดปกติ";
							if (151766 - 297512 != -145745)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn48")
					{
						if (284087 - 294850 == -10763)
						{
							result = "หมวกยุง ช่วยป้องกันสถานะผิดปกติ";
							if (282199 - 216750 == 65449)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn50")
					{
						if (291885 - 269138 != 22748)
						{
							result = "หมวกนักเวทชั้นสูงของเพนกวิน";
							if (182560 - 582726 == -400166)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn51")
					{
						if (248970 - 19952 != 229019)
						{
							result = "หมวกนักเวทชั้นสูงของเพนกวิน";
							if (296416 - 323646 == -27230)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn52")
					{
						if (84568 - 141602 == -57034)
						{
							result = "หมวกนักเวทชั้นสูงของเพนกวิน";
							if (215616 - 406361 != -190744)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn65")
					{
						if (58192 - 278470 == -220278)
						{
							result = "หมวกสไตล์ฝรั่งเศษของเพนกวิ้น";
							if (53046 - 221484 == -168438)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn80")
					{
						if (140176 - 283276 == -143100)
						{
							result = "หมวกเทพของเพนกวิน";
							if (111902 - 507820 != -395917)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat5")
					{
						if (107406 - 561122 != -453715)
						{
							result = "หมวกอาบน้ำของค้างคาว สำหรับหมักผมให้นุ่มสลวย";
							if (155847 - 538155 != -382307)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat15")
					{
						if (233170 - 398082 != -164911)
						{
							result = "หมวกปีกบานสีชมพูของค้างคาว คุณหนูเท่านั้นที่จะเคียงคู่กับหมวกใบนี้";
							if (39616 - 76771 == -37155)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat19")
					{
						if (148103 - 103173 != 44931)
						{
							result = "หมวกฟักทองของค้างคาว ช่วยป้องกันสถานะผิดปกติ";
							if (73798 - 181216 != -107417)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat21")
					{
						if (162178 - 284983 != -122804)
						{
							result = "หมวกผู้ใช้มนตร์ดำของค้างคาว";
							if (134104 - 515186 == -381082)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat22")
					{
						if (160524 - 315759 != -155234)
						{
							result = "หน้ากากของค้างคาวนักเวทมายา";
							if (189613 - 566512 == -376899)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat23")
					{
						if (88743 - 317300 == -228557)
						{
							result = "หมวกผู้ใช้มนตร์ดำของค้างคาว";
							if (290944 - 233806 == 57138)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat24")
					{
						if (46797 - 569114 == -522317)
						{
							result = "หน้ากากของค้างคาวนักเวทมายา";
							if (125425 - 123130 == 2295)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat25")
					{
						if (51972 - 286798 != -234825)
						{
							result = "หมวกคุณครูของค้างคาว มีใครสงสัยในบทเรียนมั้ยจ๊ะ";
							if (1980 - 525708 != -523727)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat31")
					{
						if (70707 - 433164 != -362456)
						{
							result = "หมวกผู้เรียกเงาของค้างคาว";
							if (34851 - 346826 != -311974)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat32")
					{
						if (266993 - 48032 == 218961)
						{
							result = "ที่คาดผมผู้ใช้เวทแห่งความฝัน ของค้างคาว";
							if (140857 - 130738 != 10120)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat33")
					{
						if (232709 - 94392 == 138317)
						{
							result = "หมวกผู้เรียกเงาของค้างคาว";
							if (134403 - 48699 != 85705)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat34")
					{
						if (134897 - 315995 != -181097)
						{
							result = "ที่คาดผมผู้ใช้เวทแห่งความฝัน ของค้างคาว";
							if (92943 - 513220 == -420277)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat35")
					{
						if (135702 - 158344 == -22642)
						{
							result = "มงกุฎจิ๋วสีแดงของแวมไพร์ เก็บเลือดสำรองไว้ดื่มยามหิว";
							if (297620 - 549644 != -252023)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat36")
					{
						if (139697 - 176460 == -36763)
						{
							result = "หมวกของค้างคาวที่ได้จากกิ้งก่าสาวนักผจญภัย";
							if (22749 - 487404 == -464655)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat40")
					{
						if (261460 - 300275 == -38815)
						{
							result = "มงกุฎราชินีของค้างคาว";
							if (94098 - 244734 == -150636)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat41")
					{
						if (68572 - 24523 != 44050)
						{
							result = "มงกุฎราชินีของค้างคาว";
							if (121918 - 181307 != -59388)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat42")
					{
						if (210480 - 340955 == -130475)
						{
							result = "มงกุฎราชินีของค้างคาว";
							if (61187 - 241818 != -180630)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat45")
					{
						if (185061 - 69744 != 115318)
						{
							result = "แว่นสำหรับใส่ขึ้นเวทีของค้างคาว คาดไว้ก็สวยแล้ว";
							if (208046 - 274803 != -66756)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat47")
					{
						if (222612 - 172785 != 49828)
						{
							result = "แว่นผีเสื้อ ช่วยป้องกันสถานะผิดปกติ";
							if (245037 - 510763 == -265726)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat48")
					{
						if (264013 - 582392 != -318378)
						{
							result = "แว่นผีเสื้อ ช่วยป้องกันสถานะผิดปกติ";
							if (25188 - 375803 != -350614)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat50")
					{
						if (275615 - 23633 == 251982)
						{
							result = "หมวกนักเวทแห่งความมืดชั้นสูงของค้างคาว";
							if (171845 - 563458 != -391612)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat51")
					{
						if (20830 - 376959 != -356128)
						{
							result = "หมวกนักเวทแห่งความมืดชั้นสูงของค้างคาว";
							if (210616 - 342000 != -131383)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat52")
					{
						if (27005 - 251014 == -224009)
						{
							result = "หมวกนักเวทแห่งความมืดชั้นสูงของค้างคาว";
							if (114094 - 107060 == 7034)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat65")
					{
						if (77069 - 457154 == -380085)
						{
							result = "ปิ่นปักผมสไตล์ญี่ปุ่นของค้างคาว";
							if (241998 - 410060 == -168062)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat80")
					{
						if (243822 - 51340 != 192483)
						{
							result = "หมวกเทพของค้างคาว";
							if (41051 - 330391 != -289339)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf60")
					{
						if (247858 - 481109 == -233251)
						{
							result = "เกราะหมวกในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (206184 - 264492 == -58308)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf61")
					{
						if (152210 - 381511 == -229301)
						{
							result = "เกราะหมวกในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (17114 - 357470 != -340355)
							{
								break;
							}
						}
					}
					else if (nCode == "c_wlf62")
					{
						if (158282 - 220897 != -62614)
						{
							result = "เกราะหมวกในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (64720 - 136798 == -72078)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn60")
					{
						if (141906 - 366050 == -224144)
						{
							result = "เกราะหมวกในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (241567 - 21241 != 220327)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn61")
					{
						if (47478 - 591085 == -543607)
						{
							result = "เกราะหมวกในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (206056 - 356506 != -150449)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bsn62")
					{
						if (196533 - 391558 == -195025)
						{
							result = "เกราะหมวกในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (283366 - 592356 == -308990)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd60")
					{
						if (93451 - 482076 == -388625)
						{
							result = "เกราะหมวกในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (163271 - 120450 == 42821)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd61")
					{
						if (254537 - 473901 == -219364)
						{
							result = "เกราะหมวกในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (43551 - 223887 == -180336)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pnd62")
					{
						if (213476 - 457776 != -244299)
						{
							result = "เกราะหมวกในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (52455 - 486513 == -434058)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl60")
					{
						if (86367 - 294001 == -207634)
						{
							result = "เกราะหมวกในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (41179 - 564214 != -523034)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl61")
					{
						if (95208 - 257778 != -162569)
						{
							result = "เกราะหมวกในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (144887 - 520989 != -376101)
							{
								break;
							}
						}
					}
					else if (nCode == "c_whl62")
					{
						if (214257 - 499259 != -285001)
						{
							result = "เกราะหมวกในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (271696 - 586956 != -315259)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat60")
					{
						if (185735 - 445833 != -260097)
						{
							result = "เกราะหมวกในตำนานของแมว มีพลังแห่งเซคเม็ธถิตอยู่ภายใน";
							if (282961 - 361007 != -78045)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat61")
					{
						if (179691 - 467939 == -288248)
						{
							result = "เกราะหมวกในตำนานของแมว มีพลังแห่งเซคเม็ธถิตอยู่ภายใน";
							if (6162 - 108091 != -101928)
							{
								break;
							}
						}
					}
					else if (nCode == "c_cat62")
					{
						if (297521 - 546442 == -248921)
						{
							result = "เกราะหมวกในตำนานของแมว มีพลังแห่งเซคเม็ธถิตอยู่ภายใน";
							if (66574 - 490441 != -423866)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm60")
					{
						if (125863 - 95931 != 29933)
						{
							result = "เกราะหมวกในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
							if (80069 - 48146 == 31923)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm61")
					{
						if (12586 - 501469 != -488882)
						{
							result = "เกราะหมวกในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
							if (170922 - 277879 == -106957)
							{
								break;
							}
						}
					}
					else if (nCode == "c_chm62")
					{
						if (5572 - 150461 != -144888)
						{
							result = "เกราะหมวกในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
							if (212019 - 435973 != -223953)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab60")
					{
						if (203952 - 281905 != -77952)
						{
							result = "เกราะหมวกในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (87125 - 425527 == -338402)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab61")
					{
						if (53149 - 375842 == -322693)
						{
							result = "เกราะหมวกในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (266085 - 64373 != 201713)
							{
								break;
							}
						}
					}
					else if (nCode == "c_rab62")
					{
						if (27902 - 330080 != -302177)
						{
							result = "เกราะหมวกในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (220211 - 501903 != -281691)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol60")
					{
						if (14431 - 585140 == -570709)
						{
							result = "เกราะหมวกในตำนานของตุ่น มีพลังแห่งกษัตริย์ไมดาสสถิตอยู่ภายใน";
							if (252738 - 223392 != 29347)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol61")
					{
						if (200886 - 79304 == 121582)
						{
							result = "เกราะหมวกในตำนานของตุ่น มีพลังแห่งกษัตริย์ไมดาสสถิตอยู่ภายใน";
							if (113458 - 394541 == -281083)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mol62")
					{
						if (150911 - 251888 != -100976)
						{
							result = "เกราะหมวกในตำนานของตุ่น มีพลังแห่งกษัตริย์ไมดาสสถิตอยู่ภายใน";
							if (589 - 434425 != -433835)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk60")
					{
						if (121552 - 227285 != -105732)
						{
							result = "เกราะหมวกในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (83642 - 553634 != -469991)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk61")
					{
						if (274738 - 196353 != 78386)
						{
							result = "เกราะหมวกในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (23723 - 271749 != -248025)
							{
								break;
							}
						}
					}
					else if (nCode == "c_mnk62")
					{
						if (185235 - 284706 != -99470)
						{
							result = "เกราะหมวกในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (251471 - 452880 == -201409)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp60")
					{
						if (264527 - 303896 != -39368)
						{
							result = "เกราะหมวกในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (211781 - 306680 == -94899)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp61")
					{
						if (255234 - 409767 != -154532)
						{
							result = "เกราะหมวกในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (242066 - 263107 == -21041)
							{
								break;
							}
						}
					}
					else if (nCode == "c_shp62")
					{
						if (112279 - 42454 != 69826)
						{
							result = "เกราะหมวกในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (23055 - 120305 != -97249)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn60")
					{
						if (15380 - 287431 == -272051)
						{
							result = "เกราะหมวกในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (21482 - 527577 == -506095)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn61")
					{
						if (89711 - 585568 == -495857)
						{
							result = "เกราะหมวกในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (15877 - 110544 == -94667)
							{
								break;
							}
						}
					}
					else if (nCode == "c_pgn62")
					{
						if (108548 - 122853 != -14304)
						{
							result = "เกราะหมวกในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (217020 - 534372 != -317351)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat60")
					{
						if (52741 - 46517 == 6224)
						{
							result = "เกราะหมวกในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (265181 - 454834 != -189652)
							{
								break;
							}
						}
					}
					else if (nCode == "c_bat61")
					{
						if (144200 - 502667 != -358466)
						{
							result = "เกราะหมวกในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (256353 - 473073 == -216720)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "c_bat62"))
						{
							break;
						}
						if (113728 - 421472 == -307744)
						{
							result = "เกราะหมวกในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (240812 - 485559 == -244747)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066C5 RID: 26309 RVA: 0x00E7A2B8 File Offset: 0x00E784B8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066C6 RID: 26310 RVA: 0x00E7A2BC File Offset: 0x00E784BC
	internal static bool Rb8S7XpyAmWZi7fqkB6U()
	{
		return true;
	}

	// Token: 0x060066C7 RID: 26311 RVA: 0x00E7A2C0 File Offset: 0x00E784C0
	internal static bool SWg5y9pylPBVTjK4JWap()
	{
		return false;
	}
}
