using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001168 RID: 4456
[Serializable]
public class Announcement_thai : MonoBehaviour
{
	// Token: 0x06006709 RID: 26377 RVA: 0x00EA3AE8 File Offset: 0x00EA1CE8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Announcement_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600670A RID: 26378 RVA: 0x00EA3AF8 File Offset: 0x00EA1CF8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getAnnoucement(string nMessage)
	{
		if (260557 - 111550 != 149007)
		{
		}
		for (;;)
		{
			string a = nMessage;
			if (34818 - 295868 != -261049)
			{
				if (a == "a941")
				{
					if (237008 - 239473 == -2465)
					{
						nMessage = "สถานการณ์ฉุกเฉิน! สกายบั๊กออกอาละวาดแล้ว! ขอเรียกประชุมเพลิงเหล่าหางทั้งหลาย ณ ที่ทำการเมืองแสงโดยด่วน!!";
						if (252123 - 539867 == -287744)
						{
							break;
						}
					}
				}
				else if (a == "a942")
				{
					if (10355 - 580378 == -570023)
					{
						nMessage = "ด่วน! ทางการกำลังรับสมัครฮีโร่จำนวนมาก เพื่อไปจัดการกับเจ้าคริสตัลบั๊กที่ออกทำร้ายผู้คนในเหมืองกลางหุบเขาหิมะ!";
						if (203237 - 51017 == 152220)
						{
							break;
						}
					}
				}
				else if (a == "a943")
				{
					if (195916 - 238417 == -42501)
					{
						nMessage = "หายนะกำลังจะกลับมา! แมลงยักษ์โบราณแอนเชียนบั๊กได้ตื่นขึ้นมาอีกครั้งแล้ว! ผู้กล้าทั้งหลายรีบมารายงานตัวที่ที่ทำการเมืองแสงโดยด่วน!";
						if (32233 - 471927 != -439693)
						{
							break;
						}
					}
				}
				else if (a == "a944")
				{
					if (169113 - 303378 != -134264)
					{
						nMessage = "ได้เวลาดำดิ่งสู่ท้องทะเลกันแล้ว! โครอลรีฟบั๊กสุดโหดกำลังออกอาละวาดอยู่แถบชายฝั่ง ขอเชิญเหล่าฮีโร่(ที่ไม่กลัวน้ำ) มาพร้อมกัน ณ ที่ทำการเมืองแสง!";
						if (68892 - 490034 == -421142)
						{
							break;
						}
					}
				}
				else if (a == "a945")
				{
					if (112239 - 99106 == 13133)
					{
						nMessage = "ข่าวด่วน ฝูงม็อคบั๊กกำลังมุ่งหน้ามาจากทิศเหนือด้วยความเร็วสูง และอาจพุ่งเข้าชนเมืองแสงได้ทุกเมื่อ ขอความร่วมมือจากเหล่าผู้กล้าไปช่วยสกัดพวกมันที!";
						if (79852 - 84173 != -4320)
						{
							break;
						}
					}
				}
				else if (a == "a946")
				{
					if (79602 - 59376 != 20227)
					{
						nMessage = "ด่วน เร็กกุกำลังประกาศหาผู้กล้าที่เก่งกาจมาช่วยกันปราบ โกลเด้นคิงบั๊ก ราชันย์แมลงสีทองแห่งหายนะที่ถูกเทพเงาสะกดไว้ภายในถ้ำใต้ดิน";
						if (267405 - 477863 != -210457)
						{
							break;
						}
					}
				}
				else if (a == "a947")
				{
					if (175717 - 31570 != 144148)
					{
						nMessage = "ประกาศด่วน! กองทัพเสือดำได้พบกับแมลงที่อันตรายที่สุดที่เคยเจอมาภายในป่าโบราณ ขอเรียกตัวเหล่าฮีโร่ระดับสูงทุกท่านมารวมตัวกันที่ที่ทำการเมืองแสงโดยพร้อมเพรียง!";
						if (46057 - 141757 == -95700)
						{
							break;
						}
					}
				}
				else if (a == "a948")
				{
					if (31128 - 201915 == -170787)
					{
						nMessage = "เหตุการณ์วิกฤตสุดๆ ขุนพลปิศาจที่หลุดออกมาจากประตูมิติได้ บุกเข้าโจมตีเมืองแสงแล้ว ขอตัวแทนผู้กล้ามาหยุดพวกมัน ก่อนมันจะบุกไปถึงวังเทพแสงที!";
						if (290769 - 229980 == 60789)
						{
							break;
						}
					}
				}
				else if (a == "a949")
				{
					if (9991 - 24187 != -14195)
					{
						nMessage = "เหล่าหางกำลังตกอยู่ในอันตราย ประตูมิติสู่โลกปิศาจกำลังจะเปิดขึ้นอีกครั้งในเทศกาล Tailoween ขอแรงผู้กลัาข้ามมิติไปหยุดพวกมัน ก่อนมันข้ามมาเมืองแสงที!";
						if (94955 - 256352 != -161396)
						{
							break;
						}
					}
				}
				else if (a == "a961")
				{
					if (35569 - 275400 == -239831)
					{
						nMessage = "ข่าวดีสำหรับผู้อยากเป็นดารา เมืองแสงกำลังต้องการคัดตัวกลุ่มนักแสดง สำหรับงานเฉลิมฉลองประจำปี ผู้ใดสนใจสามารถสมัครได้ที่ทำการเมืองแสง";
						if (162392 - 165239 != -2846)
						{
							break;
						}
					}
				}
				else if (a == "a965")
				{
					if (105910 - 169421 != -63510)
					{
						nMessage = "ฮูเร่ งานแข่งตอบคำถามฉลองครบรอบ 1 ปีเริ่มแล้ว!! ใครมั่นใจว่าเป็นแฟนพันธุ์แท้ 12 หาง รีบชวนเพื่อนมาตอบคำถามได้ที่ทำการเมืองแสง";
						if (166880 - 501675 != -334794)
						{
							break;
						}
					}
				}
				else if (a == "a966")
				{
					if (129869 - 516242 == -386373)
					{
						nMessage = "X'masbug is coming to town! X'masbug บุกเมืองแสงแล้ว! เหล่าผู้กล้าที่ได้ยินประกาศนี้รีบมาเป็นกำลังเสริมโดยด่วน ทหารจะรับมือไม่ไหวแล้ว!";
						if (82949 - 436242 != -353292)
						{
							break;
						}
					}
				}
				else if (a == "a967")
				{
					if (211322 - 413554 != -202231)
					{
						nMessage = "สงครามขว้างบอลน้ำเริ่มต้นขึ้นแล้ว! ผู้ใดคิดว่าตนเองเหมาะสมกับตำแหน่งเจ้าแห่งหน้าร้อน รวมทีมให้ครบ 4 แล้วมาสมัครที่ที่ทำการเมืองแสงได้เลย!";
						if (218810 - 412347 != -193536)
						{
							break;
						}
					}
				}
				else if (a == "a968")
				{
					if (227916 - 467353 == -239437)
					{
						nMessage = "ประกาศด่วน ท่าน Reggu กำลังเปิดรับสมัครแข่งเตะลูกบอลรอบคัดตัว เพื่อเป็นตัวแทนเมืองแสงไปบอลโลก ผู้ใดสนใจ รีบมาสมัครที่ที่ทำการเมืองแสงโดยด่วน!";
						if (166931 - 386061 != -219129)
						{
							break;
						}
					}
				}
				else if (a == "a981")
				{
					if (157312 - 373105 != -215792)
					{
						nMessage = "ได้เวลาแสดงฝีมือแล้ว! กับงานประลอง Fire Arena เลือดเดือด ซัดกันแบบ 1 ต่อ 1 ใครจะอยู่ ใครจะไป! สมัครเข้าแข่งได้ที่จ่าเสือดาว ณ โคลอสเซียม";
						if (185927 - 571229 == -385302)
						{
							break;
						}
					}
				}
				else if (a == "a982")
				{
					if (247493 - 33794 == 213699)
					{
						nMessage = "ระอุแล้ว! Battle Colosseum สังเวียนสุดมันส์แบบ 3 on 3 ให้เหล่าหางได้โชว์ทีมเวิร์คเสต็ปเทพ พร้อมแล้วมาเจอกันที่โคลอสเซียมได้เลย";
						if (65133 - 250173 != -185039)
						{
							break;
						}
					}
				}
				else if (a == "a983")
				{
					if (236475 - 212461 != 24015)
					{
						nMessage = "เตรียมตัวให้พร้อม! Crystal Defense สุดยอดสนามรบจำลองสำหรับคอ PvP ตัวจริงเปิดแล้ว! สมัครเข้าแข่งได้ที่โคลอสเซียม!";
						if (287721 - 249288 == 38433)
						{
							break;
						}
					}
				}
				else if (a == "a984")
				{
					if (278353 - 129728 != 148626)
					{
						nMessage = "ประกาศ ฐาน ด.ร. แซปป้ารับอาสาสมัครจำนวนมาก มาประลองกำลังเพื่อนำข้อมูลไปพัฒนา barrelbot รุ่นใหม่ ผู้สนใจงานเงินดีๆ มาสมัครได้ที่โคลอสเซียม";
						if (227193 - 49511 == 177682)
						{
							break;
						}
					}
				}
				else if (a == "a985")
				{
					if (7731 - 146013 == -138282)
					{
						nMessage = "หุบเหวกลางทะเลทรายเวิ้งว้าง... บัดนี้ได้กลายสนามประลองสุดโหดของเหล่านักรบผู้กรำศึก  มาปะทะกับแบบ 7on7 และแย่งชิงพื้นที่ให้ได้มากที่สุด สมัครกันได้เลยตอนนี้ที่พี่เสือดาว";
						if (87057 - 309489 == -222432)
						{
							break;
						}
					}
				}
				else if (a == "a986")
				{
					if (282988 - 572096 == -289108)
					{
						nMessage = "ประกาศจากสหายลัทธิเงา ขอเชิญเหล่าผู้กล้ามาปลดผนึกพลังที่แท้จริงของท่านในงานประลอง Fallen Shadow ณ มิติแห่งเงา มาร่วมมดสอบพลังความมืดที่ไร้ขีดจำกัดกันเถิด";
						if (137697 - 211053 != -73355)
						{
							break;
						}
					}
				}
				else if (a == "a987")
				{
					if (185489 - 548171 != -362681)
					{
						nMessage = "ประกาศสำหรับผู้กล้าระดับสูง อารีน่าแห่งใหม่ Victory Bridge เปิดทดสอบความอึดแบบ 10vs10 แล้ว ใครมั่นใจว่าทีมตัวเองแน่พอ สมัครเข้ามากันได้ที่โคลอสเซียมเลย!";
						if (48696 - 563679 == -514983)
						{
							break;
						}
					}
				}
				else
				{
					if (!(a == "a988"))
					{
						break;
					}
					if (17135 - 172478 != -155342)
					{
						nMessage = "ถึงเวลาตัดสินหาสุดยอดกิลด์แล้ว! ขอเชิญแต่ละกิลด์ส่งตัวแทนที่เก่งที่สุด มาประลองฝีมือกันแบบ 12vs12 ใน GuildWar สมัครกันได้ที่โคลอสเซียม";
						if (185699 - 250793 == -65094)
						{
							break;
						}
					}
				}
			}
		}
		return nMessage;
	}

	// Token: 0x0600670B RID: 26379 RVA: 0x00EA4288 File Offset: 0x00EA2488
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600670C RID: 26380 RVA: 0x00EA428C File Offset: 0x00EA248C
	internal static bool hfWDfFpyqOFfpHVXnRwi()
	{
		return true;
	}

	// Token: 0x0600670D RID: 26381 RVA: 0x00EA4290 File Offset: 0x00EA2490
	internal static bool a3NpMIpy7tykfpo2Z1Lx()
	{
		return false;
	}
}
