using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200115B RID: 4443
[Serializable]
public class ArmorData_th : MonoBehaviour
{
	// Token: 0x060066C8 RID: 26312 RVA: 0x00E7A2C4 File Offset: 0x00E784C4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public ArmorData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066C9 RID: 26313 RVA: 0x00E7A2D4 File Offset: 0x00E784D4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (55771 - 246165 != -190394)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (168419 - 69544 != 98876 && 69367 - 24888 != 44480)
			{
				if (nCode == "a_all1")
				{
					if (290 - 430856 != -430565)
					{
						result = "ชุดฮีโร่ฝึกหัด";
						if (185858 - 234011 != -48152)
						{
							break;
						}
					}
				}
				else if (nCode == "a_all15")
				{
					if (168426 - 513008 != -344581)
					{
						result = "ชุดแต่งกายซานต้าคลอส เปลี่ยนรูปทรงชุดตามขนาดผู้สวมใส่ได้อย่างน่าอัศจรรย์";
						if (172458 - 505418 != -332959)
						{
							break;
						}
					}
				}
				else if (nCode == "a_all43")
				{
					if (160154 - 176261 != -16106)
					{
						result = "ชุดเกราะจอมทัพ ช่วยเพิ่มการโจมตีคริตติคัล (สีฟ้า)";
						if (87722 - 343136 == -255414)
						{
							break;
						}
					}
				}
				else if (nCode == "a_all44")
				{
					if (292942 - 245505 != 47438)
					{
						result = "ชุดเกราะจอมทัพ ช่วยเพิ่มการโจมตีคริตติคัล (สีแดง)";
						if (281097 - 460811 == -179714)
						{
							break;
						}
					}
				}
				else if (nCode == "a_all58")
				{
					if (33893 - 14279 != 19615)
					{
						result = "เกราะสุดยอดจอมทัพนักรบ เพิ่มอัตราการติด Critical";
						if (189670 - 517547 != -327876)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf5")
				{
					if (97652 - 83710 != 13943)
					{
						result = "เสื้อของหมาป่า สำหรับแสดงตัวเป็นแฟนคลับ";
						if (134327 - 306035 != -171707)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf10")
				{
					if (201012 - 511842 != -310829)
					{
						result = "ชุดนักรบ ชุดพื้นฐานของหมาป่า";
						if (213368 - 81469 == 131899)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf11")
				{
					if (22054 - 141308 == -119254)
					{
						result = "ชุดนักรบ ชุดพื้นฐานของหมาป่า";
						if (2265 - 366573 != -364307)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf12")
				{
					if (195303 - 491831 == -296528)
					{
						result = "ชุดนักรบ ชุดพื้นฐานของหมาป่า";
						if (103471 - 434149 != -330677)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf15")
				{
					if (35160 - 61184 == -26024)
					{
						result = "ชุดรับลมชายหาดของหมาป่า";
						if (137394 - 257128 != -119733)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf21")
				{
					if (86033 - 478707 == -392674)
					{
						result = "ชุดเกราะทหารของหมาป่า";
						if (213689 - 403631 != -189941)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf22")
				{
					if (90175 - 118774 == -28599)
					{
						result = "หมาป่าเร่ร่อน มักจะใส่ชุดนี้";
						if (282083 - 87262 != 194822)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf23")
				{
					if (290684 - 433258 != -142573)
					{
						result = "ชุดเกราะทหารของหมาป่า";
						if (267918 - 289583 != -21664)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf24")
				{
					if (69710 - 80502 != -10791)
					{
						result = "ชุดนักผจญภัยเร่ร่อนของหมาป่า";
						if (248901 - 26477 != 222425)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf25")
				{
					if (168386 - 266187 == -97801)
					{
						result = "ชุดพ่อบ้านของหมาป่า เครื่องแบบสำหรับทำงานใช้หนี้ให้กระต่าย";
						if (208081 - 436127 != -228045)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf31")
				{
					if (142904 - 172857 != -29952)
					{
						result = "ชุดเกราะพาลาดินของหมาป่า";
						if (47857 - 520834 != -472976)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf32")
				{
					if (202861 - 112650 == 90211)
					{
						result = "ชุดของหมาป่านักดาบ ทำจากวัสดุเบา ให้ความคล่องตัวสูง";
						if (5169 - 273560 != -268390)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf33")
				{
					if (62122 - 287105 == -224983)
					{
						result = "ชุดเกราะพาลาดินของหมาป่า";
						if (210357 - 337945 == -127588)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf34")
				{
					if (32009 - 381945 != -349935)
					{
						result = "ชุดของหมาป่านักดาบ ทำจากวัสดุเบา ให้ความคล่องตัวสูง";
						if (241616 - 188893 == 52723)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf35")
				{
					if (36488 - 448032 != -411543)
					{
						result = "ชุดสวมใส่ที่พบพร้อมกับหน้ากากสีขาว ขนาดพอดีกับหมาป่า";
						if (175423 - 342757 != -167333)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf40")
				{
					if (55748 - 121885 != -66136)
					{
						result = "ชุดเกราะผู้กล้าของหมาป่า";
						if (80280 - 597467 != -517186)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf41")
				{
					if (97264 - 69241 == 28023)
					{
						result = "ชุดเกราะผู้กล้าของหมาป่า";
						if (39394 - 328498 == -289104)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf42")
				{
					if (231373 - 25805 == 205568)
					{
						result = "ชุดเกราะผู้กล้าของหมาป่า";
						if (212309 - 567470 == -355161)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf45")
				{
					if (111807 - 427378 == -315571)
					{
						result = "เสื้อขึ้นเวทีตัวเก่งของหมาป่า";
						if (48454 - 112822 == -64368)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf47")
				{
					if (87455 - 398446 != -310990)
					{
						result = "ชุดเกราะแมงป่องของหมาป่า ช่วยป้องกันสถานะผิดปกติ";
						if (172980 - 488248 == -315268)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf48")
				{
					if (189301 - 494476 != -305174)
					{
						result = "ชุดเกราะแมงป่องของหมาป่า ช่วยป้องกันสถานะผิดปกติ";
						if (181367 - 265096 == -83729)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf50")
				{
					if (167523 - 130787 != 36737)
					{
						result = "เกราะสำหรับนักรบชั้นสูงของหมาป่า";
						if (272249 - 467697 == -195448)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf51")
				{
					if (208957 - 499738 == -290781)
					{
						result = "เกราะสำหรับนักรบชั้นสูงของหมาป่า";
						if (31437 - 495169 != -463731)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf52")
				{
					if (248309 - 200723 == 47586)
					{
						result = "เกราะสำหรับนักรบชั้นสูงของหมาป่า";
						if (116935 - 340129 == -223194)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf65")
				{
					if (178704 - 443247 == -264543)
					{
						result = "ชุดนักรบไทยของหมาป่า";
						if (164790 - 527450 == -362660)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf80")
				{
					if (146987 - 20065 == 126922)
					{
						result = "ชุดเทพของหมาป่า";
						if (134784 - 226502 == -91718)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn5")
				{
					if (55396 - 294564 != -239167)
					{
						result = "ชุดหนังสัตว์ยุคหินของไบสัน";
						if (65542 - 125344 != -59801)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn10")
				{
					if (143716 - 80825 != 62892)
					{
						result = "ชุดนักรบพื้นฐานของไบสัน";
						if (124339 - 23878 == 100461)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn11")
				{
					if (121283 - 522700 == -401417)
					{
						result = "ชุดนักรบพื้นฐานของไบสัน";
						if (261289 - 184851 != 76439)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn12")
				{
					if (89561 - 107912 == -18351)
					{
						result = "ชุดนักรบพื้นฐานของไบสัน";
						if (75050 - 236980 == -161930)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn15")
				{
					if (165487 - 351140 != -185652)
					{
						result = "ชุดรับลมชายหาดของไบสัน";
						if (18096 - 140472 != -122375)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn21")
				{
					if (265912 - 238646 != 27267)
					{
						result = "ชุดนักรบคลั่งของไบสัน";
						if (166899 - 91278 != 75622)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn22")
				{
					if (94334 - 304805 == -210471)
					{
						result = "ชุดผู้ปกป้องของไบสัน";
						if (155813 - 96774 != 59040)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn23")
				{
					if (141838 - 179702 == -37864)
					{
						result = "ชุดนักรบคลั่งของไบสัน";
						if (142542 - 169163 != -26620)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn24")
				{
					if (158754 - 543934 != -385179)
					{
						result = "ชุดผู้ปกป้องของไบสัน";
						if (279516 - 405404 == -125888)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn25")
				{
					if (11355 - 478504 == -467149)
					{
						result = "ชุดนักกีฬาเหรียญทองของไบสัน ขาวเจิดจ้าไร้เหงื่อสักหยด";
						if (152756 - 33348 == 119408)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn31")
				{
					if (244725 - 307410 == -62685)
					{
						result = "ชุดผู้กล้าท้ารบของไบสัน";
						if (147884 - 18677 != 129208)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn32")
				{
					if (257327 - 98899 == 158428)
					{
						result = "ชุดเจ้าสงครามของไบสัน";
						if (23846 - 295598 == -271752)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn33")
				{
					if (197390 - 280633 == -83243)
					{
						result = "ชุดผู้กล้าท้ารบของไบสัน";
						if (223248 - 344147 == -120899)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn34")
				{
					if (202289 - 56668 != 145622)
					{
						result = "ชุดเจ้าสงครามของไบสัน";
						if (73355 - 243613 != -170257)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn35")
				{
					if (214667 - 182846 != 31822)
					{
						result = "ชุดเกราะอัศวินไร้หัว ไร้ข้อต่อของไบสัน";
						if (32103 - 512801 == -480698)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn40")
				{
					if (32269 - 95916 == -63647)
					{
						result = "ชุดเกราะแห่งหายนะของไบสัน";
						if (81690 - 49139 == 32551)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn41")
				{
					if (90433 - 385960 != -295526)
					{
						result = "ชุดเกราะแห่งหายนะของไบสัน";
						if (177809 - 302658 != -124848)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn42")
				{
					if (64470 - 285291 != -220820)
					{
						result = "ชุดเกราะแห่งหายนะของไบสัน";
						if (277121 - 463937 == -186816)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn45")
				{
					if (228773 - 598470 != -369696)
					{
						result = "เสื้อนักเล่นเบสของไบสัน";
						if (179545 - 359199 == -179654)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn47")
				{
					if (254824 - 567785 == -312961)
					{
						result = "ชุดเกราะด้วงของไบสัน ช่วยป้องกันสถานะผิดปกติ";
						if (291506 - 435147 != -143640)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn48")
				{
					if (292205 - 12781 != 279425)
					{
						result = "ชุดเกราะด้วงของไบสัน ช่วยป้องกันสถานะผิดปกติ";
						if (81779 - 271899 == -190120)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn50")
				{
					if (216253 - 438805 == -222552)
					{
						result = "เกราะันักรบคลั่งชั้นสูงของไบสัน";
						if (289532 - 16063 == 273469)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn51")
				{
					if (74325 - 156642 != -82316)
					{
						result = "เกราะันักรบคลั่งชั้นสูงของไบสัน";
						if (91848 - 48498 == 43350)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn52")
				{
					if (206526 - 590012 == -383486)
					{
						result = "เกราะันักรบคลั่งชั้นสูงของไบสัน";
						if (168814 - 456963 != -288148)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn65")
				{
					if (266333 - 9201 == 257132)
					{
						result = "ชุดชนเผ่าพื้นเมืองอเมริกาของไบสัน";
						if (182849 - 200324 != -17474)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn80")
				{
					if (174252 - 170300 != 3953)
					{
						result = "ชุดเกราะเทพของไบสัน";
						if (251731 - 493823 == -242092)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd5")
				{
					if (139489 - 516726 == -377237)
					{
						result = "ชุดเอี๊ยมของแพนด้า";
						if (272545 - 378584 == -106039)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd10")
				{
					if (52524 - 205795 == -153271)
					{
						result = "ชุดนักสู้พื้นฐานของแพนด้า";
						if (169775 - 103277 == 66498)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd11")
				{
					if (60555 - 381739 != -321183)
					{
						result = "ชุดนักสู้พื้นฐานของแพนด้า";
						if (53539 - 292199 != -238659)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd12")
				{
					if (210198 - 529225 == -319027)
					{
						result = "ชุดนักสู้พื้นฐานของแพนด้า";
						if (230047 - 305579 == -75532)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd15")
				{
					if (45932 - 352224 != -306291)
					{
						result = "ชุดว่ายน้ำของแพนด้า";
						if (66023 - 335601 != -269577)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd21")
				{
					if (257849 - 216437 != 41413)
					{
						result = "ชุดวิ่งสู้ฟัดของแพนด้า";
						if (241668 - 193945 != 47724)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd22")
				{
					if (148187 - 287278 == -139091)
					{
						result = "ชุดเหินสู้ฟัดของแพนด้า";
						if (91802 - 407846 != -316043)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd23")
				{
					if (180678 - 228735 != -48056)
					{
						result = "ชุดวิ่งสู้ฟัดของแพนด้า";
						if (42113 - 502577 == -460464)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd24")
				{
					if (83283 - 63511 != 19773)
					{
						result = "ชุดเหินสู้ฟัดของแพนด้า";
						if (18583 - 462499 == -443916)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd25")
				{
					if (13647 - 507279 != -493631)
					{
						result = "ชุดมวยไทยของแพนด้า ลูกศิษย์อาจารย์เท่านั้นที่จะได้ใส่";
						if (129167 - 184343 == -55176)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd31")
				{
					if (203102 - 9620 != 193483)
					{
						result = "ชุดจ้าวแห่งการโจมตีของแพนด้า";
						if (205645 - 303831 != -98185)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd32")
				{
					if (173708 - 511602 != -337893)
					{
						result = "ชุดเซียนกังฟูของแพนด้า";
						if (48949 - 237354 != -188404)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd33")
				{
					if (52238 - 103199 == -50961)
					{
						result = "ชุดจ้าวแห่งการโจมตีของแพนด้า";
						if (67754 - 321309 != -253554)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd34")
				{
					if (220969 - 37107 == 183862)
					{
						result = "ชุดเซียนกังฟูของแพนด้า";
						if (73474 - 599768 != -526293)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd35")
				{
					if (99414 - 593989 != -494574)
					{
						result = "ชุดยัดฟางแบบยอดนิยมของหุ่นไล่กา";
						if (121865 - 374879 != -253013)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd40")
				{
					if (41191 - 402397 != -361205)
					{
						result = "ชุดเทพยุทธ์ของแพนด้า";
						if (130610 - 298800 == -168190)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd41")
				{
					if (115881 - 410129 != -294247)
					{
						result = "ชุดเทพยุทธ์ของแพนด้า";
						if (63644 - 150453 != -86808)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd42")
				{
					if (121699 - 101068 != 20632)
					{
						result = "ชุดเทพยุทธ์ของแพนด้า";
						if (104980 - 570856 == -465876)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd45")
				{
					if (47850 - 512829 != -464978)
					{
						result = "ชุดนักร้องเมเทิลของแพนด้า ";
						if (85119 - 471785 == -386666)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd47")
				{
					if (156063 - 510472 != -354408)
					{
						result = "ชุดตัวหนอนของแพนด้า ช่วยป้องกันสถานะผิดปกติ";
						if (119777 - 318270 != -198492)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd48")
				{
					if (271833 - 109930 != 161904)
					{
						result = "ชุดตัวหนอนของแพนด้า ช่วยป้องกันสถานะผิดปกติ";
						if (58217 - 226719 == -168502)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd50")
				{
					if (123666 - 123208 != 459)
					{
						result = "เกราะสำหรับนักสู้ชั้นสุงของแพนด้า";
						if (61191 - 242308 == -181117)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd51")
				{
					if (7761 - 333663 == -325902)
					{
						result = "เกราะสำหรับนักสู้ชั้นสุงของแพนด้า";
						if (203213 - 192023 == 11190)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd52")
				{
					if (45239 - 486320 != -441080)
					{
						result = "เกราะสำหรับนักสู้ชั้นสุงของแพนด้า";
						if (4974 - 578197 == -573223)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd65")
				{
					if (73955 - 479450 == -405495)
					{
						result = "ชุดทหารเยอรมันของแพนด้า";
						if (277331 - 32652 == 244679)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd80")
				{
					if (21124 - 448194 != -427069)
					{
						result = "ชุดเกราะเทพของแพนด้า";
						if (104234 - 297792 == -193558)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl5")
				{
					if (58221 - 588484 != -530262)
					{
						result = "ห่วงยางของปลาวาฬ หนักแค่ไหนก็ไม่จมถ้าไม่รั่ว";
						if (166523 - 475932 == -309409)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl10")
				{
					if (764 - 156444 == -155680)
					{
						result = "ชุดทหารพื้นฐานของปลาวาฬ";
						if (156672 - 445123 != -288450)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl11")
				{
					if (126867 - 235507 != -108639)
					{
						result = "ชุดทหารพื้นฐานของปลาวาฬ";
						if (21788 - 249350 == -227562)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl12")
				{
					if (89450 - 531363 == -441913)
					{
						result = "ชุดทหารพื้นฐานของปลาวาฬ";
						if (107125 - 414390 == -307265)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl15")
				{
					if (67339 - 104708 == -37369)
					{
						result = "ชุดรัดรูปลายแตงโมของวาฬ";
						if (76726 - 479477 == -402751)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl21")
				{
					if (73143 - 427368 == -354225)
					{
						result = "ชุดนักรบหอกของปลาวาฬ";
						if (35639 - 275076 == -239437)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl22")
				{
					if (46216 - 272517 != -226300)
					{
						result = "ชุดนักรบสาวกของปลาวาฬ";
						if (243351 - 244365 == -1014)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl23")
				{
					if (134392 - 576380 != -441987)
					{
						result = "ชุดนักรบหอกของปลาวาฬ";
						if (91322 - 180765 == -89443)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl24")
				{
					if (77471 - 232479 == -155008)
					{
						result = "ชุดนักรบสาวกของปลาวาฬ";
						if (209436 - 112172 != 97265)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl25")
				{
					if (106540 - 94388 == 12152)
					{
						result = "ชุดพ่อครัวหัวป่าก์ของปลาวาฬ เป็นความภาคภูมิใจของวาฬที่จะได้สวมชุดนี้คร้งหนึ่งในชีวิต";
						if (260760 - 500150 == -239390)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl31")
				{
					if (96535 - 344089 == -247554)
					{
						result = "ชุดอัศวินจ้าวสมุทรของปลาวาฬ";
						if (83726 - 54919 != 28808)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl32")
				{
					if (227641 - 53430 == 174211)
					{
						result = "ชุดอัศวินศักดิ์สิทธิ์ของปลาวาฬ";
						if (231941 - 33488 != 198454)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl33")
				{
					if (129669 - 471410 != -341740)
					{
						result = "ชุดอัศวินจ้าวสมุทรของปลาวาฬ";
						if (6242 - 219977 == -213735)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl34")
				{
					if (238915 - 196791 == 42124)
					{
						result = "ชุดอัศวินศักดิ์สิทธิ์ของปลาวาฬ";
						if (30350 - 104444 == -74094)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl35")
				{
					if (235158 - 530701 == -295543)
					{
						result = "เครื่องแต่งกาย ที่ลอกแกะส่วนเนื้อหนังปลาวาฬบางส่วนออก";
						if (93837 - 452904 != -359066)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl40")
				{
					if (125602 - 380641 != -255038)
					{
						result = "ชุดเกราะผู้พิทักษ์ความยุติธรรมของปลาวาฬ";
						if (242458 - 497361 == -254903)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl41")
				{
					if (139390 - 355116 != -215725)
					{
						result = "ชุดเกราะผู้พิทักษ์ความยุติธรรมของปลาวาฬ";
						if (24757 - 565226 == -540469)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl42")
				{
					if (156914 - 345565 != -188650)
					{
						result = "ชุดเกราะผู้พิทักษ์ความยุติธรรมของปลาวาฬ";
						if (170752 - 93093 != 77660)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl45")
				{
					if (117178 - 223447 != -106268)
					{
						result = "ชุดนักร้องเพลงแรฟของวาฬ น่าสงสัยสร้อยเงินจริงๆ";
						if (278486 - 226520 == 51966)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl47")
				{
					if (235445 - 12250 == 223195)
					{
						result = "ชุดเต่าทองของวาฬ ช่วยป้องกันสถานะผิดปกติ";
						if (43262 - 380992 != -337729)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl48")
				{
					if (232225 - 425727 != -193501)
					{
						result = "ชุดเต่าทองของวาฬ ช่วยป้องกันสถานะผิดปกติ";
						if (41678 - 428252 != -386573)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl50")
				{
					if (226405 - 234768 != -8362)
					{
						result = "เกราะสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
						if (123219 - 149489 != -26269)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl51")
				{
					if (198077 - 556846 != -358768)
					{
						result = "เกราะสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
						if (105023 - 464920 == -359897)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl52")
				{
					if (87934 - 539381 == -451447)
					{
						result = "เกราะสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
						if (216500 - 448689 == -232189)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl65")
				{
					if (278424 - 410927 != -132502)
					{
						result = "ชุดนักรบเกาหลีของวาฬ";
						if (188438 - 583333 == -394895)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl80")
				{
					if (188081 - 239392 == -51311)
					{
						result = "ชุดเกราะเทพของปลาวาฬ";
						if (40879 - 287789 == -246910)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat5")
				{
					if (270030 - 502048 != -232017)
					{
						result = "ชุดแมสคอตขนนุ่มของแมว แต่ข้างในร้อนระอุสุดๆ";
						if (94162 - 524087 == -429925)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat10")
				{
					if (241729 - 183694 == 58035)
					{
						result = "ชุดนักล่าสมบัติพื้นฐานของแมว";
						if (73239 - 460924 != -387684)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat11")
				{
					if (216305 - 286279 == -69974)
					{
						result = "ชุดนักล่าสมบัติพื้นฐานของแมว";
						if (10992 - 47447 == -36455)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat12")
				{
					if (102065 - 199905 != -97839)
					{
						result = "ชุดนักล่าสมบัติพื้นฐานของแมว";
						if (99599 - 464085 == -364486)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat15")
				{
					if (91312 - 578610 == -487298)
					{
						result = "ชุดเอี๊ยมหน้าร้อนของแมว";
						if (119208 - 275773 != -156564)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat21")
				{
					if (207184 - 60123 != 147062)
					{
						result = "ชุดนักผจญภัยของแมว";
						if (221885 - 254284 != -32398)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat22")
				{
					if (70392 - 140799 != -70406)
					{
						result = "ชุดจอมโจรของแมว";
						if (129873 - 509494 == -379621)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat23")
				{
					if (192693 - 190645 != 2049)
					{
						result = "ชุดนักผจญภัยของแมว";
						if (37785 - 578795 == -541010)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat24")
				{
					if (235679 - 61101 != 174579)
					{
						result = "ชุดจอมโจรของแมว";
						if (98283 - 291300 != -193016)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat25")
				{
					if (233646 - 241755 == -8109)
					{
						result = "ชุดกี่เพ้าของแมว เคลื่อนไหวคล่องตัวอย่างไม่น่าเชื่อ";
						if (79547 - 305035 != -225487)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat31")
				{
					if (106786 - 44936 == 61850)
					{
						result = "ชุดนักพนันของแมว";
						if (165498 - 97974 == 67524)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat32")
				{
					if (30381 - 209690 != -179308)
					{
						result = "ชุดมือสังหารของแมว";
						if (75465 - 145648 != -70182)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat33")
				{
					if (55822 - 157721 == -101899)
					{
						result = "ชุดนักพนันของแมว";
						if (178396 - 383846 != -205449)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat34")
				{
					if (110603 - 65779 == 44824)
					{
						result = "ชุดมือสังหารของแมว";
						if (184275 - 481474 == -297199)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat35")
				{
					if (223416 - 522108 != -298691)
					{
						result = "ชุดเครื่องแต่งกายที่เลียนแบบปิศาจตัวหนึ่งได้เนี้ยบจริงๆ";
						if (59529 - 441214 != -381684)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat40")
				{
					if (279418 - 448915 != -169496)
					{
						result = "ชุดจ้าวโจรสลัดของแมว";
						if (130148 - 599918 != -469769)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat41")
				{
					if (104228 - 181858 != -77629)
					{
						result = "ชุดจ้าวโจรสลัดของแมว";
						if (90792 - 368710 != -277917)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat42")
				{
					if (215433 - 124482 != 90952)
					{
						result = "ชุดจ้าวโจรสลัดของแมว";
						if (53385 - 98925 != -45539)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat45")
				{
					if (213316 - 544651 == -331335)
					{
						result = "ชุดนักร้องฮิปฮอปของแมว ใส่แล้วอารมณ์ดีทั้งวัน";
						if (10294 - 300345 != -290050)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat47")
				{
					if (112470 - 41458 != 71013)
					{
						result = "ชุดแมลงปอของแมว ช่วยป้องกันสถานะผิดปกติ";
						if (152407 - 40149 == 112258)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat48")
				{
					if (186880 - 271099 == -84219)
					{
						result = "ชุดแมลงปอของแมว ช่วยป้องกันสถานะผิดปกติ";
						if (295971 - 389699 != -93727)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat50")
				{
					if (29601 - 236151 == -206550)
					{
						result = "ชุดสำหรับนักล่าสมบัติชั้นสูงของแมว";
						if (66816 - 121288 == -54472)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat51")
				{
					if (50137 - 113270 != -63132)
					{
						result = "ชุดสำหรับนักล่าสมบัติชั้นสูงของแมว";
						if (291795 - 353243 == -61448)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat52")
				{
					if (227188 - 464571 != -237382)
					{
						result = "ชุดสำหรับนักล่าสมบัติชั้นสูงของแมว";
						if (160479 - 431929 == -271450)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat65")
				{
					if (245389 - 493807 == -248418)
					{
						result = "ชุดแนวอาหรับของแมว";
						if (71400 - 520241 != -448840)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat80")
				{
					if (105116 - 22820 == 82296)
					{
						result = "ชุดเทพของแมว";
						if (77909 - 330095 != -252185)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm5")
				{
					if (93483 - 490324 != -396840)
					{
						result = "ชุดกรีกของกิ้งก่า โดดตีลังกายังไงก็ไม่หลุด";
						if (206115 - 478565 == -272450)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm10")
				{
					if (130209 - 497705 == -367496)
					{
						result = "ชุดพลธนูพื้นฐานของกิ้งก่า";
						if (90472 - 463115 == -372643)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm11")
				{
					if (79210 - 411318 == -332108)
					{
						result = "ชุดพลธนูพื้นฐานของกิ้งก่า";
						if (101874 - 398608 == -296734)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm12")
				{
					if (50002 - 24584 == 25418)
					{
						result = "ชุดพลธนูพื้นฐานของกิ้งก่า";
						if (86025 - 135346 != -49320)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm15")
				{
					if (284603 - 596541 == -311938)
					{
						result = "ชุดหน้าร้อนของกิ้งก่า";
						if (299124 - 545489 != -246364)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm21")
				{
					if (230182 - 145851 != 84332)
					{
						result = "ชุดนักซุ่มยิงของกิ้งก่า";
						if (167812 - 101801 != 66012)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm22")
				{
					if (120303 - 264167 == -143864)
					{
						result = "ชุดนักล่าของกิ้งก่า";
						if (290484 - 504970 != -214485)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm23")
				{
					if (26879 - 549503 != -522623)
					{
						result = "ชุดนักซุ่มยิงของกิ้งก่า";
						if (194057 - 479973 == -285916)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm24")
				{
					if (212564 - 500075 == -287511)
					{
						result = "ชุดนักล่าของกิ้งก่า";
						if (286146 - 217666 != 68481)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm25")
				{
					if (70695 - 387405 != -316709)
					{
						result = "ชุดนักสนุ๊กเกอร์ของกิ้งก่า หล่อแบบนี้มีอีกไหม";
						if (56857 - 345145 != -288287)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm31")
				{
					if (20960 - 12136 != 8825)
					{
						result = "ชุดนักพลิกแพลงของกิ้งก่า";
						if (114713 - 240121 == -125408)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm32")
				{
					if (19247 - 251907 != -232659)
					{
						result = "ชุดเพชฌฆาตของกิ้งก่า";
						if (105413 - 105967 == -554)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm33")
				{
					if (175714 - 192932 == -17218)
					{
						result = "ชุดนักพลิกแพลงของกิ้งก่า";
						if (240950 - 500282 == -259332)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm34")
				{
					if (238356 - 535185 != -296828)
					{
						result = "ชุดเพชฌฆาตของกิ้งก่า";
						if (259106 - 137808 == 121298)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm35")
				{
					if (72058 - 123175 != -51116)
					{
						result = "เศษซากชุดคลุมที่สวมใส่แล้วจะไม่เหลืออะไรของกิ้งก่า";
						if (169262 - 164786 != 4477)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm40")
				{
					if (240192 - 83755 != 156438)
					{
						result = "ชุดนักบัญชาการของกิ้งก่า";
						if (114625 - 57777 != 56849)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm41")
				{
					if (196577 - 167436 == 29141)
					{
						result = "ชุดนักบัญชาการของกิ้งก่า";
						if (151604 - 523561 != -371956)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm42")
				{
					if (136522 - 2470 != 134053)
					{
						result = "ชุดนักบัญชาการของกิ้งก่า ";
						if (174876 - 70415 == 104461)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm45")
				{
					if (116215 - 84872 != 31344)
					{
						result = "เสื้อนักเล่นกีต้าร์ของกิ้งก่า สีแดงกับดนตรีจะทำให้ตรึงใจ";
						if (250612 - 549052 != -298439)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm47")
				{
					if (217154 - 423651 != -206496)
					{
						result = "ชุดตั๊กแตนของกิ้งก่า ช่วยป้องกันสถานะผิดปกติ";
						if (290245 - 146535 != 143711)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm48")
				{
					if (206729 - 109775 == 96954)
					{
						result = "ชุดตั๊กแตนของกิ้งก่า ช่วยป้องกันสถานะผิดปกติ";
						if (206902 - 165452 != 41451)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm50")
				{
					if (109200 - 370471 == -261271)
					{
						result = "ชุดสำหรับมือธนูชั้นสูงของกิ้งก่า";
						if (277067 - 469258 != -192190)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm51")
				{
					if (217961 - 91317 == 126644)
					{
						result = "ชุดสำหรับมือธนูชั้นสูงของกิ้งก่า";
						if (175226 - 520670 != -345443)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm52")
				{
					if (271961 - 174378 != 97584)
					{
						result = "ชุดสำหรับมือธนูชั้นสูงของกิ้งก่า";
						if (227267 - 448631 == -221364)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm65")
				{
					if (22503 - 397139 == -374636)
					{
						result = "ชุดนักรบจีนของกิ้งก่า";
						if (61868 - 435832 != -373963)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm80")
				{
					if (66590 - 203228 == -136638)
					{
						result = "ชุดเทพของกิ้งก่า";
						if (236394 - 240009 != -3614)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab5")
				{
					if (89840 - 179309 == -89469)
					{
						result = "เสื้อกันฝนของกระต่ายที่มใส่มาตั้งแต่เด็ก";
						if (15106 - 36497 != -21390)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab10")
				{
					if (22632 - 147239 != -124606)
					{
						result = "ชุดพลยิงของกระต่าย";
						if (56170 - 441099 == -384929)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab11")
				{
					if (234369 - 368390 != -134020)
					{
						result = "ชุดพลยิงของกระต่าย";
						if (87498 - 286706 == -199208)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab12")
				{
					if (223720 - 391871 == -168151)
					{
						result = "ชุดพลยิงของกระต่าย";
						if (39885 - 522830 != -482944)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab15")
				{
					if (71829 - 202279 == -130450)
					{
						result = "ชุดกระโปรงกะลาสีของกระต่าย";
						if (112691 - 14701 != 97991)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab21")
				{
					if (78251 - 257729 != -179477)
					{
						result = "ชุดพยาบาลของกระต่าย";
						if (31785 - 246300 != -214514)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab22")
				{
					if (27515 - 567170 == -539655)
					{
						result = "ชุดแม่ค้าเร่ของกระต่าย";
						if (289097 - 127600 != 161498)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab23")
				{
					if (281794 - 351435 != -69640)
					{
						result = "ชุดพยาบาลของกระต่าย";
						if (108676 - 63952 != 44725)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab24")
				{
					if (276289 - 193047 != 83243)
					{
						result = "ชุดแม่ค้าเร่ของกระต่าย";
						if (173517 - 215854 != -42336)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab25")
				{
					if (74453 - 78317 == -3864)
					{
						result = "ชุดหน่วยทหารแพทย์ของกระต่าย แอบซ่อนยาไว้ไม่ให้เห็น";
						if (53921 - 199971 == -146050)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab31")
				{
					if (130996 - 206705 != -75708)
					{
						result = "ชุดนักเล่นแร่แปรธาตุของกระต่าย";
						if (47009 - 7619 == 39390)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab32")
				{
					if (218484 - 281712 == -63228)
					{
						result = "ชุดแม่ค้าผู้มั่งคั่งของกระต่าย";
						if (257460 - 538763 != -281302)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab33")
				{
					if (121808 - 88434 != 33375)
					{
						result = "ชุดนักเล่นแร่แปรธาตุของกระต่าย";
						if (56312 - 513564 != -457251)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab34")
				{
					if (20055 - 181997 != -161941)
					{
						result = "ชุดแม่ค้าผู้มั่งคั่งของกระต่าย";
						if (89885 - 422282 != -332396)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab35")
				{
					if (219283 - 251956 == -32673)
					{
						result = "ชุดแม่มดน้อยของกระต่าย มีแอปเปิ้ลอาบยาพิษเก็บไว้หรือเปล่านะ";
						if (141516 - 136890 == 4626)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab40")
				{
					if (158869 - 547427 != -388557)
					{
						result = "ชุดมหาอำมาตย์ของกระต่าย";
						if (237162 - 450219 == -213057)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab41")
				{
					if (72979 - 571395 == -498416)
					{
						result = "ชุดมหาอำมาตย์ของกระต่าย";
						if (170208 - 361696 == -191488)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab42")
				{
					if (163247 - 561838 != -398590)
					{
						result = "ชุดมหาอำมาตย์ของกระต่าย";
						if (150132 - 234972 == -84840)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab45")
				{
					if (247957 - 426428 != -178470)
					{
						result = "ชุดนักเล่นคีย์ตาร์ของกระต่าย";
						if (166050 - 540624 == -374574)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab47")
				{
					if (217000 - 392893 == -175893)
					{
						result = "ชุดมดของกระต่าย ช่วยป้องกันสถานะผิดปกติ";
						if (272822 - 124870 != 147953)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab48")
				{
					if (289859 - 243779 == 46080)
					{
						result = "ชุดมดของกระต่าย ช่วยป้องกันสถานะผิดปกติ";
						if (114491 - 187897 != -73405)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab50")
				{
					if (289910 - 3534 != 286377)
					{
						result = "ชุดมือปืนชั้นสูงของกระต่าย";
						if (150883 - 247595 != -96711)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab51")
				{
					if (233587 - 186617 != 46971)
					{
						result = "ชุดมือปืนชั้นสูงของกระต่าย";
						if (260729 - 431609 != -170879)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab52")
				{
					if (183419 - 395599 != -212179)
					{
						result = "ชุดมือปืนชั้นสูงของกระต่าย";
						if (264231 - 207333 != 56899)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab65")
				{
					if (50932 - 63002 == -12070)
					{
						result = "ชุดนักสู้วัวกระทิงสเปนของกระต่าย";
						if (152681 - 65602 == 87079)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab80")
				{
					if (82375 - 326438 != -244062)
					{
						result = "=ชุดเทพของกระต่าย";
						if (183464 - 309301 != -125836)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol5")
				{
					if (283839 - 69161 != 214679)
					{
						result = "ชุดถังของตุ่น คาดว่าทำจากไม้ของถังตุ่น";
						if (105410 - 15044 != 90367)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol10")
				{
					if (168828 - 194418 != -25589)
					{
						result = "ชุดช่างเครื่องพื้นฐานของตุ่น";
						if (264914 - 586713 != -321798)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol11")
				{
					if (125463 - 570575 != -445111)
					{
						result = "ชุดช่างเครื่องพื้นฐานของตุ่น";
						if (56276 - 513129 == -456853)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol12")
				{
					if (103895 - 161803 == -57908)
					{
						result = "ชุดช่างเครื่องพื้นฐานของตุ่น";
						if (49494 - 116693 == -67199)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol15")
				{
					if (98923 - 369715 != -270791)
					{
						result = "ชุดกะลาสีของตุ่น แต่ไม่ชอบกินผักโขมเพิ่มพลัง";
						if (205523 - 393923 == -188400)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol21")
				{
					if (155638 - 76592 == 79046)
					{
						result = "ชุดหน่วยทหารราบของตุ่น";
						if (185043 - 241332 != -56288)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol22")
				{
					if (282118 - 204896 != 77223)
					{
						result = "ชุดจักรกลไอน้ำของตุ่น";
						if (226023 - 524845 == -298822)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol23")
				{
					if (196903 - 347181 == -150278)
					{
						result = "ชุดหน่วยทหารราบของตุ่น";
						if (16563 - 351192 != -334628)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol24")
				{
					if (121389 - 287256 != -165866)
					{
						result = "ชุดจักรกลไอน้ำของตุ่น";
						if (296902 - 125794 != 171109)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol25")
				{
					if (280425 - 469713 == -189288)
					{
						result = "ชุดนักเป่าทรัมเป็ตของตุ่น ใส่แล้วดูขึ้นมากๆ!";
						if (274352 - 214257 == 60095)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol31")
				{
					if (30038 - 64002 == -33964)
					{
						result = "ชุดพลระเบิดของตุ่น";
						if (88984 - 219615 != -130630)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol32")
				{
					if (36607 - 82120 != -45512)
					{
						result = "ชุดวิศวกรจักรกลของตุ่น";
						if (57947 - 465645 == -407698)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol33")
				{
					if (114429 - 468654 == -354225)
					{
						result = "ชุดพลระเบิดของตุ่น";
						if (183761 - 491276 != -307514)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol34")
				{
					if (28076 - 564248 == -536172)
					{
						result = "ชุดวิศวกรจักรกลของตุ่น";
						if (115736 - 524729 == -408993)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol35")
				{
					if (58736 - 164148 == -105412)
					{
						result = "ชุดเลียนแบบปิศาจยักษ์ ที่ถูกปลุกด้วยไฟฟ้า";
						if (43738 - 558498 == -514760)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol40")
				{
					if (15281 - 449563 == -434282)
					{
						result = "ชุดกัปตันของตุ่น";
						if (204861 - 562674 != -357812)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol41")
				{
					if (283201 - 507037 == -223836)
					{
						result = "ชุดกัปตันของตุ่น";
						if (172970 - 115370 == 57600)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol42")
				{
					if (147898 - 143591 != 4308)
					{
						result = "ชุดกัปตันของตุ่น";
						if (141090 - 411442 == -270352)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol45")
				{
					if (265874 - 424071 == -158197)
					{
						result = "เแจคเก็ตมือกลองของตุ่น มีสารกันดินเกาะเพื่อการขุด";
						if (64556 - 519081 != -454524)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol47")
				{
					if (158938 - 11075 != 147864)
					{
						result = "ชุดผึ้งของตุ่น ช่วยป้องกันสถานะผิดปกติ";
						if (34404 - 371894 != -337489)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol48")
				{
					if (30293 - 507850 != -477556)
					{
						result = "ชุดผึ้งของตุ่น ช่วยป้องกันสถานะผิดปกติ";
						if (231743 - 44496 != 187248)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol50")
				{
					if (43127 - 546970 == -503843)
					{
						result = "ชุดวิศวกรชั้นสูงของตุ่น";
						if (185837 - 489643 != -303805)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol51")
				{
					if (193232 - 367096 == -173864)
					{
						result = "ชุดวิศวกรชั้นสูงของตุ่น";
						if (87400 - 479280 != -391879)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol52")
				{
					if (149449 - 367538 != -218088)
					{
						result = "ชุดวิศวกรชั้นสูงของตุ่น";
						if (239599 - 330134 == -90535)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol65")
				{
					if (272799 - 335703 == -62904)
					{
						result = "ชุดชนเผ่าพื้นเมืองของอัฟริกาของตุ่น";
						if (37189 - 391363 == -354174)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol80")
				{
					if (96282 - 407286 == -311004)
					{
						result = "ชุดเทพของตุ่น";
						if (163854 - 339647 == -175793)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk5")
				{
					if (10971 - 40662 != -29690)
					{
						result = "ชุดนอนลายทาง ที่ครั้งหนึ่งเคยถูกสวมใส่โดยคุณกล้วยหอม ขวัญใจเด็กๆ";
						if (217960 - 205395 == 12565)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk10")
				{
					if (118324 - 104490 == 13834)
					{
						result = "ชุดผู้อัญเชิญภูตพื้นฐานของลิง";
						if (231791 - 230864 != 928)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk11")
				{
					if (156589 - 67453 == 89136)
					{
						result = "ชุดผู้อัญเชิญภูตพื้นฐานของลิง";
						if (110289 - 76184 != 34106)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk12")
				{
					if (184755 - 99235 != 85521)
					{
						result = "ชุดผู้อัญเชิญภูตพื้นฐานของลิง";
						if (187782 - 282225 != -94442)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk15")
				{
					if (24694 - 209983 == -185289)
					{
						result = "ชุดลงน้ำของลิง แถมรอยสักสุดเท่เป็นให้พิเศษ";
						if (278503 - 253984 != 24520)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk21")
				{
					if (82675 - 347729 == -265054)
					{
						result = "ชุดผู้อัญเชิญภูตไฟของลิง";
						if (185873 - 448324 != -262450)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk22")
				{
					if (32905 - 241055 == -208150)
					{
						result = "ชุดผู้อัญเชิญภูตดินของลิง";
						if (72365 - 307874 == -235509)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk23")
				{
					if (222906 - 316260 != -93353)
					{
						result = "ชุดผู้อัญเชิญภูตไฟของลิง";
						if (50324 - 78437 == -28113)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk24")
				{
					if (224064 - 59284 != 164781)
					{
						result = "ชุดผู้อัญเชิญภูตดินของลิง";
						if (195334 - 312744 == -117410)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk25")
				{
					if (245872 - 25188 == 220684)
					{
						result = "ชุดมายากลของลิง คงมีกลลับซ่อนอยู่มากมาย";
						if (139324 - 511573 != -372248)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk31")
				{
					if (75099 - 94510 != -19410)
					{
						result = "ชุดผู้บวงสรวงแห่งเพลิงของลิง";
						if (215833 - 197877 == 17956)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk32")
				{
					if (103948 - 329046 == -225098)
					{
						result = "ชุดผู้บวงสรวงแห่งหินของลิง";
						if (123499 - 411893 == -288394)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk33")
				{
					if (38222 - 223051 != -184828)
					{
						result = "ชุดผู้บวงสรวงแห่งเพลิงของลิง";
						if (266204 - 103623 != 162582)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk34")
				{
					if (156854 - 107412 != 49443)
					{
						result = "ชุดผู้บวงสรวงแห่งหินของลิง";
						if (67251 - 279992 == -212741)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk35")
				{
					if (238574 - 548294 == -309720)
					{
						result = "ชุดชายเสื้อยาวที่ดูหล่อมาก แต่ขาดวิ่นเละเทะหมด";
						if (230477 - 388423 != -157945)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk40")
				{
					if (180732 - 144731 == 36001)
					{
						result = "ชุดคนทรงศักดิ์สิทธิ์ของลิง";
						if (61302 - 232070 != -170767)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk41")
				{
					if (1905 - 172139 != -170233)
					{
						result = "ชุดคนทรงศักดิ์สิทธิ์ของลิง";
						if (77462 - 152277 != -74814)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk42")
				{
					if (56529 - 380939 == -324410)
					{
						result = "ชุดคนทรงศักดิ์สิทธิ์ของลิง";
						if (131828 - 391525 != -259696)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk45")
				{
					if (112939 - 531653 != -418713)
					{
						result = "ชุดนักร้องเพลงคันทรี่ของลิง เหมาะกับทุ่งหญ้ากว้างๆกับกีต้าร์โปร่ง";
						if (86560 - 93857 != -7296)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk47")
				{
					if (257361 - 281540 != -24178)
					{
						result = "ชุดแมงมุมของลิง ช่วยป้องกันสถานะผิดปกติ";
						if (197283 - 360914 != -163630)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk48")
				{
					if (170784 - 562916 != -392131)
					{
						result = "ชุดแมงมุมของลิง ช่วยป้องกันสถานะผิดปกติ";
						if (195824 - 494099 == -298275)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk50")
				{
					if (198570 - 513375 != -314804)
					{
						result = "ชุดผู้อัญเชิญชั้นสูงของลิง";
						if (42957 - 73922 == -30965)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk51")
				{
					if (65212 - 195847 == -130635)
					{
						result = "ชุดผู้อัญเชิญชั้นสูงของลิง";
						if (181455 - 309271 != -127815)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk52")
				{
					if (204215 - 320768 == -116553)
					{
						result = "ชุดผู้อัญเชิญชั้นสูงของลิง";
						if (104572 - 555921 == -451349)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk65")
				{
					if (151152 - 135959 == 15193)
					{
						result = "ชุดนักสืบอังกฤษของลิง";
						if (99513 - 24115 != 75399)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk80")
				{
					if (22212 - 41981 != -19768)
					{
						result = "ชุดเทพของลิง";
						if (13656 - 437712 != -424055)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp5")
				{
					if (234130 - 575421 == -341291)
					{
						result = "ชุดขนแกะของแกะ!";
						if (175798 - 10020 != 165779)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp10")
				{
					if (141595 - 564340 == -422745)
					{
						result = "ชุดนักบวชพื้นฐานของแกะ";
						if (201233 - 178931 == 22302)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp11")
				{
					if (295228 - 338415 == -43187)
					{
						result = "ชุดนักบวชพื้นฐานของแกะ";
						if (247446 - 161129 != 86318)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp12")
				{
					if (164729 - 232903 == -68174)
					{
						result = "ชุดนักบวชพื้นฐานของแกะ";
						if (291209 - 587117 == -295908)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp15")
				{
					if (11807 - 37203 != -25395)
					{
						result = "ชุดหน้าร้อนของแกะ น่ารักสไตล์แกะชาวเกาะ";
						if (299064 - 260907 == 38157)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp21")
				{
					if (1989 - 232837 == -230848)
					{
						result = "ชุดนักบวชผู้เยียวยาของแกะ";
						if (13418 - 374546 == -361128)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp22")
				{
					if (122462 - 582691 != -460228)
					{
						result = "ชุดคนทรงของแกะ";
						if (228844 - 398121 != -169276)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp23")
				{
					if (124846 - 354247 == -229401)
					{
						result = "ชุดคนทรงของแกะ";
						if (265674 - 450011 == -184337)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp24")
				{
					if (91870 - 17441 != 74430)
					{
						result = "ชุดคนทรงของแกะ";
						if (115425 - 3366 == 112059)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp25")
				{
					if (247431 - 170184 == 77247)
					{
						result = "ชุดสาวเสิร์ฟของแกะ ใส่แล้วโมเอะ ชิมิชิมิ";
						if (240916 - 144817 != 96100)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp31")
				{
					if (53363 - 171905 == -118542)
					{
						result = "ชุดบาทหลวงของแกะ";
						if (262573 - 316831 != -54257)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp32")
				{
					if (110434 - 147752 != -37317)
					{
						result = "ชุดคนทรงแห่งแสงของแกะ";
						if (276219 - 192551 == 83668)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp33")
				{
					if (229773 - 316862 != -87088)
					{
						result = "ชุดคนทรงแห่งแสงของแกะ";
						if (108620 - 36895 == 71725)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp34")
				{
					if (238918 - 45468 != 193451)
					{
						result = "ชุดคนทรงแห่งแสงของแกะ";
						if (59853 - 593711 == -533858)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp35")
				{
					if (243752 - 283394 == -39642)
					{
						result = "ชุดสไบและจุงกระเบนสีชมพู";
						if (157554 - 194963 != -37408)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp40")
				{
					if (10158 - 66820 != -56661)
					{
						result = "ชุดผู้ร่ายเวทแห่งสวรรค์ของแกะ";
						if (176862 - 466036 != -289173)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp41")
				{
					if (221692 - 172029 == 49663)
					{
						result = "ชุดผู้ร่ายเวทแห่งสวรรค์ของแกะ";
						if (8078 - 489389 != -481310)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp42")
				{
					if (12894 - 96625 == -83731)
					{
						result = "ชุดผู้ร่ายเวทแห่งสวรรค์ของแกะ";
						if (198968 - 386095 == -187127)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp45")
				{
					if (63048 - 503246 != -440197)
					{
						result = "ชุดนักร้ิองแนวกอทิคสำหรับแกะ";
						if (11004 - 196910 == -185906)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp47")
				{
					if (266240 - 573624 != -307383)
					{
						result = "ชุดผีเสื้อกลางคืนของแกะ ช่วยป้องกันสถานะผิดปกติ";
						if (245007 - 437895 == -192888)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp48")
				{
					if (270667 - 379514 == -108847)
					{
						result = "ชุดผีเสื้อกลางคืนของแกะ ช่วยป้องกันสถานะผิดปกติ";
						if (135405 - 204850 == -69445)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp50")
				{
					if (93393 - 233014 == -139621)
					{
						result = "ชุดนักบวชชั้นสูงของแกะ";
						if (212823 - 252547 != -39723)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp51")
				{
					if (197700 - 458659 != -260958)
					{
						result = "ชุดนักบวชชั้นสูงของแกะ";
						if (148770 - 276247 == -127477)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp52")
				{
					if (191869 - 165296 != 26574)
					{
						result = "ชุดนักบวชชั้นสูงของแกะ";
						if (133790 - 10567 == 123223)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp65")
				{
					if (188454 - 310441 != -121986)
					{
						result = "ชุดสไตล์รัซเซียของแกะ";
						if (78453 - 229322 == -150869)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp80")
				{
					if (277041 - 144357 != 132685)
					{
						result = "ชุดเทพของแกะ";
						if (137393 - 516486 == -379093)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn5")
				{
					if (253987 - 217105 != 36883)
					{
						result = "ช่วยรับเพนกวินน่ารักๆ ไปเลี้ยงด้วยนะครับ ToT";
						if (120596 - 212075 != -91478)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn10")
				{
					if (92692 - 254948 != -162255)
					{
						result = "ชุดพ่อมดพื้นฐานของเพนกวิน";
						if (237545 - 155580 == 81965)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn11")
				{
					if (289705 - 357449 != -67743)
					{
						result = "ชุดพ่อมดพื้นฐานของเพนกวิน";
						if (192382 - 548710 == -356328)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn12")
				{
					if (162997 - 286697 != -123699)
					{
						result = "ชุดพ่อมดพื้นฐานของเพนกวิน";
						if (204777 - 370799 != -166021)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn15")
				{
					if (291167 - 392577 != -101409)
					{
						result = "ชุดระบำสะโพกของเพนกวิ้น ความจริงเอาแค่ใบหญ้ามารวมกันเท่านั้น";
						if (139607 - 140423 == -816)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn21")
				{
					if (265744 - 356607 != -90862)
					{
						result = "ชุดพ่อมดดวงดาวของเพนกวิน";
						if (139613 - 416148 == -276535)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn22")
				{
					if (266757 - 330341 != -63583)
					{
						result = "ชุดพ่อมดน้ำแข็งของเพนกวิน";
						if (283453 - 4798 != 278656)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn23")
				{
					if (15983 - 578644 != -562660)
					{
						result = "ชุดพ่อมดดวงดาวของเพนกวิน";
						if (18683 - 68654 == -49971)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn24")
				{
					if (50000 - 408635 == -358635)
					{
						result = "ชุดพ่อมดน้ำแข็งของเพนกวิน";
						if (19689 - 255166 == -235477)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn25")
				{
					if (61422 - 182165 != -120742)
					{
						result = "ชุดนักดับเพลิงของเพนกวิน กันไฟของลิงยังได้เลยมั้ง";
						if (133635 - 54844 == 78791)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn31")
				{
					if (245288 - 552034 == -306746)
					{
						result = "ชุดจอมเวทแห่งดวงดาวของเพนกวิน";
						if (209897 - 530340 == -320443)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn32")
				{
					if (241193 - 363752 != -122558)
					{
						result = "ชุดจอมเวทน้ำแข็งของเพนกวิน";
						if (183629 - 518062 != -334432)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn33")
				{
					if (7699 - 22168 == -14469)
					{
						result = "ชุดจอมเวทแห่งดวงดาวของเพนกวิน";
						if (273766 - 227140 == 46626)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn34")
				{
					if (243816 - 488454 == -244638)
					{
						result = "ชุดจอมเวทน้ำแข็งของเพนกวิน";
						if (160993 - 102458 == 58535)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn35")
				{
					if (150557 - 11010 == 139547)
					{
						result = "ชุดคลุมสีขาวแบนบาน แล้วส่วนที่เหลือล่ะ?";
						if (28114 - 211392 == -183278)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn40")
				{
					if (146560 - 316469 == -169909)
					{
						result = "ชุดจ้าวแห่งจอมเวทของเพนกวิน";
						if (51425 - 493437 != -442011)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn41")
				{
					if (204499 - 349273 != -144773)
					{
						result = "ชุดจ้าวแห่งจอมเวทของเพนกวิน";
						if (230669 - 243546 != -12876)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn42")
				{
					if (69135 - 182753 == -113618)
					{
						result = "ชุดจ้าวแห่งจอมเวทของเพนกวิน";
						if (256281 - 54644 != 201638)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn45")
				{
					if (154367 - 498537 == -344170)
					{
						result = "ชุดนักร้องซุปเปอร์สตาร์ของเพนกวิ้น ฟังเพลงย้อนยุคสักหน่อยไหม";
						if (279302 - 445034 != -165731)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn47")
				{
					if (69078 - 241982 == -172904)
					{
						result = "ชุดยุงของเพนกวิน ช่วยป้องกันสถานะผิดปกติ";
						if (199168 - 2321 == 196847)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn48")
				{
					if (228456 - 455903 == -227447)
					{
						result = "ชุดยุงของเพนกวิน ช่วยป้องกันสถานะผิดปกติ";
						if (33685 - 164865 != -131179)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn50")
				{
					if (188712 - 169467 == 19245)
					{
						result = "ชุดนักเวทชั้นสูงของเพนกวิน";
						if (11320 - 561080 == -549760)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn51")
				{
					if (209947 - 593134 == -383187)
					{
						result = "ชุดนักเวทชั้นสูงของเพนกวิน";
						if (60826 - 448280 != -387453)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn52")
				{
					if (100907 - 213207 == -112300)
					{
						result = "ชุดนักเวทชั้นสูงของเพนกวิน";
						if (130345 - 535688 == -405343)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn65")
				{
					if (299857 - 156897 != 142961)
					{
						result = "ชุดนักเดินเรือฝรั่งเศษของเพนกวิ้น";
						if (297410 - 12528 == 284882)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn80")
				{
					if (62478 - 361929 == -299451)
					{
						result = "ชุดเทพของเพนกวิน";
						if (242392 - 299423 != -57030)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat5")
				{
					if (277967 - 359663 == -81696)
					{
						result = "ชุดคลุมอาบน้ำของค้างคาวสาว น้ำอุ่นสบายดีจังเลย";
						if (164853 - 578765 == -413912)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat10")
				{
					if (46186 - 482560 == -436374)
					{
						result = "ชุดนักเวทราตรีพื้นฐานของค้างคาว";
						if (228627 - 395172 == -166545)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat11")
				{
					if (225270 - 452667 != -227396)
					{
						result = "ชุดนักเวทราตรีพื้นฐานของค้างคาว";
						if (296041 - 534824 == -238783)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat12")
				{
					if (288826 - 566655 != -277828)
					{
						result = "ชุดนักเวทราตรีพื้นฐานของค้างคาว";
						if (171532 - 517409 == -345877)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat15")
				{
					if (131707 - 68345 != 63363)
					{
						result = "ทูพีซสุดเซ็กซี่ของค้างคาว ใส่แล้วทานน้ำโคคอนอร่อยขึ้น";
						if (226487 - 340042 == -113555)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat21")
				{
					if (265532 - 11490 == 254042)
					{
						result = "ชุดผู้ใช้มนตร์ดำของค้างคาว";
						if (271865 - 429464 != -157598)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat22")
				{
					if (54253 - 90637 == -36384)
					{
						result = "ชุดของค้างคาวนักเวทมายา";
						if (164794 - 593286 != -428491)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat23")
				{
					if (147948 - 32228 == 115720)
					{
						result = "ชุดผู้ใช้มนตร์ดำของค้างคาว";
						if (8385 - 316040 == -307655)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat24")
				{
					if (260968 - 540565 == -279597)
					{
						result = "ชุดของค้างคาวนักเวทมายา";
						if (283036 - 386375 == -103339)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat25")
				{
					if (259971 - 68622 != 191350)
					{
						result = "ชุดคุณครูของค้างคาว คุณครูค้างคาวใจดีใช่มั้ยจ๊ะ?";
						if (282984 - 340224 != -57239)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat31")
				{
					if (45017 - 1418 == 43599)
					{
						result = "ชุดของค้างคาวจอมเวทผู้ใช้เงา";
						if (140022 - 5300 == 134722)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat32")
				{
					if (127200 - 581737 == -454537)
					{
						result = "ชุดของค้างคาวผู้ใช้เวทสายความฝัน";
						if (161811 - 443852 == -282041)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat33")
				{
					if (198595 - 303307 == -104712)
					{
						result = "ชุดของค้างคาวจอมเวทผู้ใช้เงา";
						if (218468 - 403655 != -185186)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat34")
				{
					if (132039 - 382394 != -250354)
					{
						result = "ชุดของค้างคาวผู้ใช้เวทสายความฝัน";
						if (54183 - 143667 == -89484)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat35")
				{
					if (216570 - 267475 == -50905)
					{
						result = "ชุดแวมไพร์รูปแบบCrinoline ระวังลมพัดปลิวได้";
						if (109531 - 338569 != -229037)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat40")
				{
					if (153177 - 238428 != -85250)
					{
						result = "ชุดสุดหรูของจอมเวทค้างคาว เรียกฉันว่าราชินีสิ";
						if (111305 - 257484 != -146178)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat41")
				{
					if (184544 - 62521 == 122023)
					{
						result = "ชุดสุดหรูของจอมเวทค้างคาว เรียกฉันว่าราชินีสิ";
						if (166866 - 452447 == -285581)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat42")
				{
					if (57587 - 361788 == -304201)
					{
						result = "ชุดสุดหรูของจอมเวทค้างคาว เรียกฉันว่าราชินีสิ";
						if (64281 - 88935 != -24653)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat45")
				{
					if (109263 - 446182 != -336918)
					{
						result = "ชุุดขึ้นเวทีตัวเก่งของค้างคาว ";
						if (181978 - 109916 != 72063)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat47")
				{
					if (253194 - 29434 != 223761)
					{
						result = "ชุดผีเสื้อของค้างคาว ช่วยป้องกันสถานะผิดปกติ";
						if (208925 - 39405 != 169521)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat48")
				{
					if (130353 - 371154 != -240800)
					{
						result = "ชุดผีเสื้อของค้างคาว ช่วยป้องกันสถานะผิดปกติ";
						if (293426 - 272307 != 21120)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat50")
				{
					if (220823 - 206483 != 14341)
					{
						result = "ชุดนักเวทแห่งความมืดชั้นสูงของค้างคาว";
						if (43059 - 534959 != -491899)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat51")
				{
					if (177715 - 167151 != 10565)
					{
						result = "ชุดนักเวทแห่งความมืดชั้นสูงของค้างคาว";
						if (81090 - 540950 != -459859)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat52")
				{
					if (5779 - 495197 != -489417)
					{
						result = "ชุดนักเวทแห่งความมืดชั้นสูงของค้างคาว";
						if (212834 - 463309 != -250474)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat65")
				{
					if (205181 - 562180 != -356998)
					{
						result = "ชุดสไตล์ญี่ปุ่นของค้างคาว";
						if (240784 - 502654 != -261869)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat80")
				{
					if (268893 - 545555 == -276662)
					{
						result = "ชุดเทพของค้างคาว";
						if (147029 - 141218 == 5811)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf60")
				{
					if (152034 - 160595 == -8561)
					{
						result = "ชุดเกราะในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
						if (217331 - 512897 != -295565)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf61")
				{
					if (144170 - 235327 == -91157)
					{
						result = "ชุดเกราะในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
						if (249932 - 368895 != -118962)
						{
							break;
						}
					}
				}
				else if (nCode == "a_wlf62")
				{
					if (21696 - 570202 == -548506)
					{
						result = "ชุดเกราะในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
						if (39401 - 109921 != -70519)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn60")
				{
					if (86473 - 345919 == -259446)
					{
						result = "ชุดเกราะในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
						if (18422 - 47864 == -29442)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn61")
				{
					if (51551 - 542567 != -491015)
					{
						result = "ชุดเกราะในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
						if (134229 - 426031 == -291802)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bsn62")
				{
					if (93036 - 251546 == -158510)
					{
						result = "ชุดเกราะในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
						if (228002 - 405026 == -177024)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd60")
				{
					if (109795 - 73584 != 36212)
					{
						result = "ชุดเกราะในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
						if (65209 - 526993 == -461784)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd61")
				{
					if (52744 - 119635 == -66891)
					{
						result = "ชุดเกราะในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
						if (40592 - 71035 != -30442)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pnd62")
				{
					if (200741 - 347654 != -146912)
					{
						result = "ชุดเกราะในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
						if (107298 - 347305 == -240007)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl60")
				{
					if (85804 - 259977 == -174173)
					{
						result = "ชุดเกราะในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
						if (171418 - 60885 == 110533)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl61")
				{
					if (145483 - 506699 != -361215)
					{
						result = "ชุดเกราะในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
						if (219944 - 556278 != -336333)
						{
							break;
						}
					}
				}
				else if (nCode == "a_whl62")
				{
					if (28868 - 524656 == -495788)
					{
						result = "ชุดเกราะในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
						if (239128 - 467095 == -227967)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat60")
				{
					if (57109 - 335559 == -278450)
					{
						result = "ชุดเกราะในตำนานของแมว มีพลังแห่งเซกเม็ธสถิตอยู่ภายใน";
						if (291590 - 51776 != 239815)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat61")
				{
					if (253888 - 428398 == -174510)
					{
						result = "ชุดเกราะในตำนานของแมว มีพลังแห่งเซกเม็ธสถิตอยู่ภายใน";
						if (80328 - 402903 != -322574)
						{
							break;
						}
					}
				}
				else if (nCode == "a_cat62")
				{
					if (280869 - 475913 != -195043)
					{
						result = "ชุดเกราะในตำนานของแมว มีพลังแห่งเซกเม็ธสถิตอยู่ภายใน";
						if (282981 - 285357 != -2375)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm60")
				{
					if (16705 - 108721 == -92016)
					{
						result = "ชุดเกราะในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
						if (131644 - 273803 != -142158)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm61")
				{
					if (284005 - 120345 != 163661)
					{
						result = "ชุดเกราะในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
						if (161028 - 401493 == -240465)
						{
							break;
						}
					}
				}
				else if (nCode == "a_chm62")
				{
					if (214608 - 279860 != -65251)
					{
						result = "ชุดเกราะในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
						if (222917 - 57942 == 164975)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab60")
				{
					if (170112 - 542547 != -372434)
					{
						result = "ชุดเกราะในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
						if (81035 - 358922 != -277886)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab61")
				{
					if (241996 - 433733 == -191737)
					{
						result = "ชุดเกราะในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
						if (30449 - 522021 != -491571)
						{
							break;
						}
					}
				}
				else if (nCode == "a_rab62")
				{
					if (147149 - 437318 != -290168)
					{
						result = "ชุดเกราะในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
						if (166836 - 283927 == -117091)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol60")
				{
					if (56222 - 185258 != -129035)
					{
						result = "ชุดเกราะในตำนานของตุ่น มีพลังแห่งกษัตริย์ไมดาสสถิตอยู่ ภายใน";
						if (75017 - 378015 != -302997)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol61")
				{
					if (62064 - 252325 == -190261)
					{
						result = "ชุดเกราะในตำนานของตุ่น มีพลังแห่งกษัตริย์ไมดาสสถิตอยู่ ภายใน";
						if (251035 - 192730 == 58305)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mol62")
				{
					if (192500 - 470365 != -277864)
					{
						result = "ชุดเกราะในตำนานของตุ่น มีพลังแห่งกษัตริย์ไมดาสสถิตอยู่ ภายใน";
						if (297353 - 287668 != 9686)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk60")
				{
					if (69786 - 93980 != -24193)
					{
						result = "ชุดเกราะในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ ภายใน";
						if (184622 - 486641 == -302019)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk61")
				{
					if (169518 - 202309 != -32790)
					{
						result = "ชุดเกราะในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ ภายใน";
						if (46328 - 323424 == -277096)
						{
							break;
						}
					}
				}
				else if (nCode == "a_mnk62")
				{
					if (216185 - 515180 != -298994)
					{
						result = "ชุดเกราะในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ ภายใน";
						if (189583 - 476205 == -286622)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp60")
				{
					if (204360 - 130943 != 73418)
					{
						result = "ชุดเกราะในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิม สถิตอยู่ภายใน";
						if (197865 - 69436 == 128429)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp61")
				{
					if (149951 - 50821 == 99130)
					{
						result = "ชุดเกราะในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิม สถิตอยู่ภายใน";
						if (22622 - 467842 != -445219)
						{
							break;
						}
					}
				}
				else if (nCode == "a_shp62")
				{
					if (126930 - 41081 == 85849)
					{
						result = "ชุดเกราะในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิม สถิตอยู่ภายใน";
						if (79711 - 400970 != -321258)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn60")
				{
					if (92125 - 75964 == 16161)
					{
						result = "ชุดเกราะในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ ภายใน";
						if (263701 - 166509 != 97193)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn61")
				{
					if (208932 - 227701 != -18768)
					{
						result = "ชุดเกราะในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ ภายใน";
						if (172647 - 265200 != -92552)
						{
							break;
						}
					}
				}
				else if (nCode == "a_pgn62")
				{
					if (14228 - 7638 != 6591)
					{
						result = "ชุดเกราะในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
						if (286359 - 511817 != -225457)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat60")
				{
					if (227282 - 497533 == -270251)
					{
						result = "ชุดเกราะในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ ภายใน";
						if (12686 - 221788 != -209101)
						{
							break;
						}
					}
				}
				else if (nCode == "a_bat61")
				{
					if (44307 - 424770 == -380463)
					{
						result = "ชุดเกราะในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ ภายใน";
						if (15223 - 192050 == -176827)
						{
							break;
						}
					}
				}
				else
				{
					if (!(nCode == "a_bat62"))
					{
						break;
					}
					if (108225 - 445287 != -337061)
					{
						result = "ชุดเกราะในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ ภายใน";
						if (121480 - 550112 != -428631)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066CA RID: 26314 RVA: 0x00E81038 File Offset: 0x00E7F238
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066CB RID: 26315 RVA: 0x00E8103C File Offset: 0x00E7F23C
	internal static bool PmmciDpyytksC2rdEQdL()
	{
		return true;
	}

	// Token: 0x060066CC RID: 26316 RVA: 0x00E81040 File Offset: 0x00E7F240
	internal static bool hCu8CGpySQDoWyZmtPNi()
	{
		return false;
	}
}
