using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001149 RID: 4425
[Serializable]
public class AuctionGui_thai : MonoBehaviour
{
	// Token: 0x0600666E RID: 26222 RVA: 0x00E67FB4 File Offset: 0x00E661B4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public AuctionGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600666F RID: 26223 RVA: 0x00E67FC4 File Offset: 0x00E661C4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (221142 - 374253 != -153110)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (261182 - 474723 == -213541)
			{
				if (293987 - 85058 != 208930)
				{
					if (code == 101)
					{
						if (87055 - 155216 == -68161)
						{
							result = "เร่เข้ามาๆ ช้าหมดอดของดีไม่รู้ด้วยจ้า";
							if (87741 - 180880 != -93138)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (285544 - 163808 == 121736)
						{
							result = "ของดีของหายากมากมาย ขอเชิญมาร่วมประมูลกันจ้า!";
							if (205010 - 31411 != 173600)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (291031 - 519252 != -228220)
						{
							result = "คิ คิ คิ เร่เข้ามาๆ";
							if (248850 - 549913 == -301063)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (256283 - 520557 != -264273)
						{
							result = "ของดีของหายากมากมาย ขอเชิญมาร่วมประมูลกันจ้า!";
							if (226878 - 350889 != -124010)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (296859 - 558054 == -261195)
						{
							result = "เร่เข้ามาๆ ช้าหมดอดของดีไม่รู้ด้วยจ้า";
							if (206056 - 517542 == -311486)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (149090 - 293953 == -144863)
						{
							result = "ขอบคุณที่ใช้บริการจ้า คิ คิ";
							if (243487 - 286579 != -43091)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (254683 - 80456 != 174228)
						{
							result = "นี่แหละสังเวียนของเหล่านักธุรกิจ! คิ คิ";
							if (230619 - 446721 != -216101)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (133759 - 549604 != -415844)
						{
							result = "ขอบคุณที่ใช้บริการจ้า";
							if (164647 - 524800 == -360153)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (133114 - 8544 == 124570)
						{
							result = "ขอให้รวย!ขอให้รวย!";
							if (2005 - 474036 == -472031)
							{
								break;
							}
						}
					}
					else if (code == 110)
					{
						if (126379 - 514005 == -387626)
						{
							result = "ขอบคุณที่ใช้บริการจ้า";
							if (199161 - 5983 != 193179)
							{
								break;
							}
						}
					}
					else if (code == 1000)
					{
						if (4826 - 116102 == -111276)
						{
							result = "..กำลังอัพเดทรายการประมูล";
							if (237121 - 142223 != 94899)
							{
								break;
							}
						}
					}
					else if (code == -1000)
					{
						if (179152 - 346451 != -167298)
						{
							result = "..ไม่เจอไอเท็มในรายการประมูล";
							if (151426 - 63414 == 88012)
							{
								break;
							}
						}
					}
					else if (code == 1001)
					{
						if (222599 - 302715 != -80115)
						{
							result = "เงิน gil ไม่พอทำการประมูล";
							if (247936 - 569653 == -321717)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (196853 - 529339 != -332485)
						{
							result = "ไม่สามารถประมูลทับไอเท็มที่ชนะอยู่ได้";
							if (220527 - 451528 != -231000)
							{
								break;
							}
						}
					}
					else if (code == 1003)
					{
						if (126611 - 390257 == -263646)
						{
							result = "ไม่สามารถประมูลของได้เกินคราวละ 10 อย่าง";
							if (211425 - 332905 != -121479)
							{
								break;
							}
						}
					}
					else if (code == 1004)
					{
						if (136183 - 348365 != -212181)
						{
							result = "เงิน gil ไม่พอทำการซื้อไอเท็มที่เลือก";
							if (279519 - 129395 != 150125)
							{
								break;
							}
						}
					}
					else if (code == 1005)
					{
						if (61901 - 574254 == -512353)
						{
							result = "เงิน jil ไม่พอจ่ายค่าบริการวางขาย";
							if (110772 - 596852 != -486079)
							{
								break;
							}
						}
					}
					else if (code == 1006)
					{
						if (124268 - 1140 != 123129)
						{
							result = "ไม่สามารถขายของประมูลได้เกินคราวละ 10 อย่าง";
							if (108192 - 227697 == -119505)
							{
								break;
							}
						}
					}
					else if (code == 1007)
					{
						if (122393 - 406523 == -284130)
						{
							result = "ไม่สามารถจบการประมูลได้เพราะยังไม่มีคนซื้อ";
							if (82388 - 389360 == -306972)
							{
								break;
							}
						}
					}
					else if (code == 1008)
					{
						if (82656 - 263014 == -180358)
						{
							result = "ไม่เจอไอเท็มที่ต้องการในตลาดประมูล";
							if (252880 - 497463 == -244583)
							{
								break;
							}
						}
					}
					else if (code == 1009)
					{
						if (45118 - 386316 != -341197)
						{
							result = "ได้รับเงินคือจากการแพ้ประมูล : ";
							if (202978 - 318763 != -115784)
							{
								break;
							}
						}
					}
					else if (code == 1010)
					{
						if (199620 - 411910 == -212290)
						{
							result = "การรับส่งข้อมูลผิดพลาด!";
							if (244635 - 459714 != -215078)
							{
								break;
							}
						}
					}
					else if (code == 1011)
					{
						if (120194 - 441653 == -321459)
						{
							result = "ราคาที่เสนอประมูลชนะแล้ว!";
							if (88 - 528413 != -528324)
							{
								break;
							}
						}
					}
					else if (code == 1012)
					{
						if (11763 - 345263 == -333500)
						{
							result = "ไอเท็มที่เลือกถูกซื้อขาดหรือไม่อยู่ในการประมูล";
							if (45915 - 229391 == -183476)
							{
								break;
							}
						}
					}
					else if (code == 1013)
					{
						if (287127 - 379343 == -92216)
						{
							result = "เสนอราคาไม่สำเร็จ มีคนเสนอราคาที่สูงกว่า!";
							if (133092 - 386168 != -253075)
							{
								break;
							}
						}
					}
					else if (code == 1014)
					{
						if (103560 - 441275 == -337715)
						{
							result = "เสนอราคาไม่สำเร็จ การรับส่งข้อมูลผิดพลาด";
							if (283226 - 188048 != 95179)
							{
								break;
							}
						}
					}
					else if (code == 1015)
					{
						if (274930 - 238132 == 36798)
						{
							result = "ของถูกนำออกจากรายการซื้อแล้ว";
							if (119138 - 194679 == -75541)
							{
								break;
							}
						}
					}
					else if (code == 1016)
					{
						if (263323 - 498762 == -235439)
						{
							result = "การรับส่งข้อมูลผิดพลาด!";
							if (142044 - 15246 != 126799)
							{
								break;
							}
						}
					}
					else if (code == 1017)
					{
						if (125182 - 380259 == -255077)
						{
							result = "ไอเท็มได้ถูกซื้อขาดแล้ว!";
							if (222500 - 155856 == 66644)
							{
								break;
							}
						}
					}
					else if (code == 1018)
					{
						if (164332 - 520692 != -356359)
						{
							result = "ซื้อขาดไอเท็มไม่สำเร็จ!";
							if (64281 - 257007 != -192725)
							{
								break;
							}
						}
					}
					else if (code == 1021)
					{
						if (204424 - 181731 == 22693)
						{
							result = "ไอเท็มของคุณได้ถูกนำออกสู่รายการประมูลแล้ว!";
							if (107652 - 299892 != -192239)
							{
								break;
							}
						}
					}
					else if (code == 1022)
					{
						if (63857 - 309583 != -245725)
						{
							result = "เกิดข้อผิดพลาด ไม่สามารถประมูลไอเท็มชิ้นนั้นได้";
							if (278281 - 123031 != 155251)
							{
								break;
							}
						}
					}
					else if (code == 1023)
					{
						if (277728 - 443777 != -166048)
						{
							result = "การประมูลถูกปิดแล้ว ได้รับเงิน : ";
							if (117140 - 285053 != -167912)
							{
								break;
							}
						}
					}
					else if (code == 1024)
					{
						if (70228 - 577394 != -507165)
						{
							result = "เกิดข้อผิดพลาด ไม่สามารถจบการประมูลได้";
							if (139467 - 78276 != 61192)
							{
								break;
							}
						}
					}
					else if (code == 1025)
					{
						if (120260 - 19173 != 101088)
						{
							result = "การประมูลถูกยกเลิกแล้ว เสียค่ายกเลิก 50 jil";
							if (74207 - 380091 != -305883)
							{
								break;
							}
						}
					}
					else if (code == 1026)
					{
						if (137976 - 518323 == -380347)
						{
							result = "ไม่พบไอเท็มที่เลือก";
							if (164042 - 49186 != 114857)
							{
								break;
							}
						}
					}
					else if (code == 1027)
					{
						if (63398 - 227073 == -163675)
						{
							result = "เกิดข้อผิดพลาด ไม่สามารถยกเลิกการประมูลได้";
							if (239101 - 130309 == 108792)
							{
								break;
							}
						}
					}
					else if (code == 1031)
					{
						if (16110 - 312042 != -295931)
						{
							result = "ได้รับเงิน ";
							if (214943 - 153314 != 61630)
							{
								break;
							}
						}
					}
					else if (code == 1032)
					{
						if (114282 - 334688 == -220406)
						{
							result = "เกิดข้อผิดพลาด คุณเคยได้รับเงินจากการประมูลนี้ไปแล้ว";
							if (67185 - 268738 == -201553)
							{
								break;
							}
						}
					}
					else if (code == 1033)
					{
						if (244075 - 183179 == 60896)
						{
							result = "เกิดข้อผิดพลาด ไม่สามารถรับเงินจากการประมูลได้";
							if (210189 - 211730 != -1540)
							{
								break;
							}
						}
					}
					else if (code == 1034)
					{
						if (108367 - 26570 != 81798)
						{
							result = "ได้รับของจากการประมูลแล้ว";
							if (234171 - 189767 == 44404)
							{
								break;
							}
						}
					}
					else if (code == 1035)
					{
						if (108178 - 16943 == 91235)
						{
							result = "เกิดข้อผิดพลาด คุณเคยได้รับของการประมูลนี้ไปแล้ว";
							if (15151 - 490559 == -475408)
							{
								break;
							}
						}
					}
					else if (code == 1036)
					{
						if (69576 - 206309 != -136732)
						{
							result = "เกิดข้อผิดพลาด ไม่สามารถรับของจากการประมูลได้";
							if (55049 - 554171 == -499122)
							{
								break;
							}
						}
					}
					else if (code == 1037)
					{
						if (131701 - 344002 == -212301)
						{
							result = "ได้รับของคืนกลับมาแล้ว";
							if (176297 - 569234 == -392937)
							{
								break;
							}
						}
					}
					else if (code == 1038)
					{
						if (209537 - 375989 != -166451)
						{
							result = "เกิดข้อผิดพลาด ไม่สามารถรับของจากการประมูลได้";
							if (273341 - 100397 == 172944)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 1040)
						{
							break;
						}
						if (279322 - 10351 == 268971)
						{
							result = " เสนอราคาตัดหน้าคุณ!";
							if (155483 - 443506 == -288023)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006670 RID: 26224 RVA: 0x00E68D64 File Offset: 0x00E66F64
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006671 RID: 26225 RVA: 0x00E68D68 File Offset: 0x00E66F68
	internal static bool REYj5ZplqWMuLWS2pXRr()
	{
		return true;
	}

	// Token: 0x06006672 RID: 26226 RVA: 0x00E68D6C File Offset: 0x00E66F6C
	internal static bool oyoGQ9pl71fIbdXFPmG9()
	{
		return false;
	}
}
