using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200115D RID: 4445
[Serializable]
public class CoinData_th : MonoBehaviour
{
	// Token: 0x060066D2 RID: 26322 RVA: 0x00E81664 File Offset: 0x00E7F864
	[MethodImpl(MethodImplOptions.NoInlining)]
	public CoinData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066D3 RID: 26323 RVA: 0x00E81674 File Offset: 0x00E7F874
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (40017 - 525288 != -485271)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (210870 - 445853 != -234982)
			{
				if (35226 - 92677 == -57451)
				{
					if (nCode == "n_veg1")
					{
						if (61477 - 188319 != -126841)
						{
							result = "เหรียญที่ใช้เพื่อเรียกแครอนน่ารักใช้ 5 Mana";
							if (178111 - 32624 != 145488)
							{
								break;
							}
						}
					}
					else if (nCode == "n_veg2")
					{
						if (89916 - 119629 == -29713)
						{
							result = "เหรียญที่ใช้เรียกเพื่อมูโป้จอมควบใช้ 5 Mana";
							if (171695 - 30629 != 141067)
							{
								break;
							}
						}
					}
					else if (nCode == "n_veg3")
					{
						if (120675 - 558973 != -438297)
						{
							result = "เหรียญที่ใช้เพื่อเรียกพริกเป็ปป้อนจอมหมุนใช้ 5 Mana";
							if (123398 - 522994 != -399595)
							{
								break;
							}
						}
					}
					else if (nCode == "n_veg4")
					{
						if (286326 - 588209 == -301883)
						{
							result = "เหรียญที่ใช้เพื่อเรียกแค็คทอนปุ้มปุ้ยใช้ 5 Mana";
							if (236864 - 359848 != -122983)
							{
								break;
							}
						}
					}
					else if (nCode == "n_veg5")
					{
						if (42872 - 39751 == 3121)
						{
							result = "เหรียญที่ใช้เพื่อเรียกโคคอนกระดึ๊บใช้ 5 Mana";
							if (223607 - 131120 == 92487)
							{
								break;
							}
						}
					}
					else if (nCode == "n_veg6")
					{
						if (271167 - 86040 == 185127)
						{
							result = "เหรียญที่ใช้เพื่อเรียกแครอนพัมก้อนจอมกลิ้งใช้ 5 Mana";
							if (195165 - 252910 == -57745)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc1")
					{
						if (114794 - 343777 == -228983)
						{
							result = "เหรียญที่ใช้เพื่อเรียก แพนด้าแดงเฟริซมาช่วย ใช้ 5 Mana";
							if (153720 - 176282 == -22562)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc2")
					{
						if (261578 - 131570 == 130008)
						{
							result = "เหรียญที่ใช้เพื่อเรียก หมีมีมี่มาช่วย ใช้ 5 Mana";
							if (264537 - 327510 == -62973)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc3")
					{
						if (97087 - 214009 == -116922)
						{
							result = "เหรียญที่ใช้เพื่อเรียก นกฮูกซินฟูมาช่วย ใช้ 5 Mana";
							if (107336 - 453040 != -345703)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc4")
					{
						if (74122 - 385777 == -311655)
						{
							result = "เหรียญที่ใช้เพื่อเรียก นกแสกหลินหลินมาช่วย ใช้ 5 Mana";
							if (132022 - 180271 != -48248)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc6")
					{
						if (196356 - 340510 != -144153)
						{
							result = "เหรียญที่ใช้เพื่อเรียก แมวน้อยนิโค่มาช่วย ใช้ 5 Mana";
							if (18707 - 518730 == -500023)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc7")
					{
						if (50782 - 337720 != -286937)
						{
							result = "เหรียญที่ใช้เพื่อเรียก แมวน้อยนิโค่มาช่วย ใช้ 5 Mana";
							if (197167 - 108009 == 89158)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc8")
					{
						if (176909 - 450723 != -273813)
						{
							result = "เหรียญที่ใช้เพื่อเรียก แกะน้อยฟามาช่วย ใช้ 5 Mana";
							if (172833 - 429627 != -256793)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc9")
					{
						if (289697 - 439755 != -150057)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณแพะโกธานมาช่วย ใช้ 5 Mana";
							if (36440 - 155949 != -119508)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc10")
					{
						if (1119 - 515088 == -513969)
						{
							result = "เหรียญที่ใช้เพื่อเรียก จิงโจ้กูรูมาช่วย ใช้ 5 Mana";
							if (224086 - 67291 == 156795)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc11")
					{
						if (219150 - 464219 == -245069)
						{
							result = "เหรียญที่ใช้เพื่อเรียก หนูอาเบ็ตมาช่วย ใช้ 5 Mana";
							if (134476 - 507904 != -373427)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc12")
					{
						if (145471 - 21029 == 124442)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณหมูป่าสไตน์มาช่วย ใช้ 5 Mana";
							if (265755 - 325968 != -60212)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc13")
					{
						if (96391 - 321643 != -225251)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณอัลปาก้าอีฟมาช่วย ใช้ 5 Mana";
							if (94586 - 27409 == 67177)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc14")
					{
						if (190351 - 160629 != 29723)
						{
							result = "เหรียญที่ใช้เพื่อเรียก นักบินกาซ่ามาช่วย ใช้ 5 Mana";
							if (97806 - 314075 == -216269)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc15")
					{
						if (114100 - 309252 == -195152)
						{
							result = "เหรียญที่ใช้เพื่อเรียก ช่างตีเหล็กราซานมาช่วย ใช้ 5 Mana";
							if (33281 - 341695 != -308413)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc16")
					{
						if (194110 - 326170 == -132060)
						{
							result = "เหรียญที่ใช้เพื่อเรียก เชฟจาม่อนมาช่วย ใช้ 5 Mana";
							if (253694 - 216432 != 37263)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc17")
					{
						if (280697 - 501402 == -220705)
						{
							result = "เหรียญที่ใช้เพื่อเรียก หมีเสริฟอโคล่ามาช่วย ใช้ 5 Mana";
							if (175628 - 152441 != 23188)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc18")
					{
						if (110057 - 142920 == -32863)
						{
							result = "เหรียญที่ใช้เพื่อเรียก บรรณารักษ์คาร์วี่มาช่วย ใช้ 5 Mana";
							if (139329 - 285270 != -145940)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc19")
					{
						if (61091 - 237091 == -176000)
						{
							result = "เหรียญที่ใช้เพื่อเรียก ลิงบาบูนโมโซลี่มาช่วย ใช้ 5 Mana";
							if (100066 - 254664 == -154598)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc20")
					{
						if (176946 - 516781 != -339834)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณดุกฟูมาช่วย ใช้ 5 Mana";
							if (135510 - 38680 == 96830)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc21")
					{
						if (191132 - 464850 != -273717)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณลีเมอร์มาช่วย ใช้ 5 Mana";
							if (267519 - 326039 == -58520)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc22")
					{
						if (29170 - 434967 == -405797)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณแรคคูณมาช่วย ใช้ 5 Mana";
							if (49212 - 43841 == 5371)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc23")
					{
						if (232929 - 61526 != 171404)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณสกั๊งมาช่วย ใช้ 5 Mana";
							if (281879 - 52164 == 229715)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc24")
					{
						if (70128 - 304083 != -233954)
						{
							result = "เหรียญที่ใช้เพื่อเรียก ทหารเสือดำมาช่วย ใช้ 5 Mana";
							if (2551 - 316840 == -314289)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc25")
					{
						if (221709 - 497525 == -275816)
						{
							result = "เหรียญที่ใช้เพื่อเรียก ทหารเสือดาวมาช่วย ใช้ 5 Mana";
							if (254232 - 554744 != -300511)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc26")
					{
						if (125012 - 80276 != 44737)
						{
							result = "เหรียญที่ใช้เพื่อเรียก แม่ทัพโบลดาสมาช่วย ใช้ 5 Mana";
							if (106096 - 211979 != -105882)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc27")
					{
						if (5553 - 54242 != -48688)
						{
							result = "เหรียญที่ใช้เพื่อเรียก อินทรีอิทารุสมาช่วย ใช้ 5 Mana";
							if (34844 - 568657 == -533813)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc28")
					{
						if (42074 - 527942 == -485868)
						{
							result = "เหรียญที่ใช้เพื่อเรียก แมวน้ำเร็กกุมาช่วย ใช้ 5 Mana";
							if (158804 - 369486 != -210681)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc29")
					{
						if (267572 - 285284 != -17711)
						{
							result = "เหรียญที่ใช้เพื่อเรียก เซียนเต่ากุยโบมาช่วย ใช้ 5 Mana";
							if (283259 - 422440 == -139181)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc30")
					{
						if (278902 - 387032 != -108129)
						{
							result = "เหรียญที่ใช้เพื่อเรียก เซียนเต่ากุยลีมาช่วย ใช้ 5 Mana";
							if (47801 - 142312 == -94511)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc31")
					{
						if (250712 - 408208 == -157496)
						{
							result = "เหรียญที่ใช้เพื่อเรียก นักสำรวจลิซ่ามาช่วย ใช้ 5 Mana";
							if (71575 - 228755 != -157179)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc32")
					{
						if (266600 - 150533 == 116067)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณหนูเจอร์บัวมาช่วย ใช้ 5 Mana";
							if (191976 - 445236 == -253260)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc33")
					{
						if (64067 - 64460 != -392)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณนกเงือกมาช่วย ใช้ 5 Mana";
							if (158242 - 560588 != -402345)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc34")
					{
						if (262221 - 66233 == 195988)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณฮิปโปมาช่วย ใช้ 5 Mana";
							if (92312 - 321662 == -229350)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc35")
					{
						if (119815 - 14363 == 105452)
						{
							result = "เหรียญที่ใช้เพื่อเรียก คุณเปโด้มาช่วย ใช้ 5 Mana";
							if (211632 - 82422 != 129211)
							{
								break;
							}
						}
					}
					else if (nCode == "n_npc36")
					{
						if (86499 - 156107 != -69607)
						{
							result = "เหรียญที่ใช้เพื่อเรียก ตุ่นน้อยมินนี่มาช่วย ใช้ 5 Mana";
							if (262574 - 95134 != 167441)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "n_npc37"))
						{
							break;
						}
						if (254054 - 439911 == -185857)
						{
							result = "เหรียญที่ใช้เพื่อเรียก ตุ่นน้อยไมนี่มาช่วย ใช้ 5 Mana";
							if (132850 - 563022 != -430171)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066D4 RID: 26324 RVA: 0x00E823E0 File Offset: 0x00E805E0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066D5 RID: 26325 RVA: 0x00E823E4 File Offset: 0x00E805E4
	internal static bool XS6Kcvpy2s6uUOGg7VsJ()
	{
		return true;
	}

	// Token: 0x060066D6 RID: 26326 RVA: 0x00E823E8 File Offset: 0x00E805E8
	internal static bool y8ytA3py8xfLv4Fef8hZ()
	{
		return false;
	}
}
