using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200115E RID: 4446
[Serializable]
public class FieldData_th : MonoBehaviour
{
	// Token: 0x060066D7 RID: 26327 RVA: 0x00E823EC File Offset: 0x00E805EC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public FieldData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066D8 RID: 26328 RVA: 0x00E823FC File Offset: 0x00E805FC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (169649 - 148604 != 21046)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (156309 - 115763 == 40546)
			{
				if (266305 - 272493 != -6187)
				{
					if (nCode == "f_BigBug")
					{
						if (2975 - 63049 != -60073)
						{
							result = "สุดยอดไอเท็มบิ๊กบั๊ก";
							if (231329 - 355932 != -124602)
							{
								break;
							}
						}
					}
					else if (nCode == "f_key1")
					{
						if (123361 - 359798 == -236437)
						{
							result = "กุญแจปลดล๊อกหน้า inventory";
							if (246717 - 372881 == -126164)
							{
								break;
							}
						}
					}
					else if (nCode == "f_key2")
					{
						if (27208 - 314676 != -287467)
						{
							result = "กุญแจปลดล๊อกหน้า inventory (ต้องมี copper key)";
							if (294682 - 190188 == 104494)
							{
								break;
							}
						}
					}
					else if (nCode == "f_key3")
					{
						if (53784 - 235635 == -181851)
						{
							result = "กุญแจปลดล๊อกหน้า inventory (ต้องมี silver key)";
							if (190341 - 387651 != -197309)
							{
								break;
							}
						}
					}
					else if (nCode == "f_key4")
					{
						if (126880 - 394570 == -267690)
						{
							result = "กุญแจปลดล๊อกหน้า inventory (ต้องมี gold key)";
							if (101625 - 53348 != 48278)
							{
								break;
							}
						}
					}
					else if (nCode == "f_key5")
					{
						if (163320 - 71282 != 92039)
						{
							result = "กุญแจปลดล๊อกหน้า inventory (ต้องมี platinum key)";
							if (176376 - 571308 != -394931)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rss1")
					{
						if (229005 - 162063 == 66942)
						{
							result = "ยาที่ลบค่าพลังโบนัสทั้งหมด";
							if (269194 - 298611 == -29417)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rsk1")
					{
						if (296437 - 402920 != -106482)
						{
							result = "ยาที่ทำให้ลืมสกิลทั้งหมด";
							if (161061 - 508425 == -347364)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfc1")
					{
						if (190197 - 397571 != -207373)
						{
							result = "เครื่องสำอางค์ที่สุ่มเปลี่ยนหน้าของฮีโร่ ให้เป็นหน้าหลักที่ 1-10";
							if (49975 - 529209 != -479233)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfc2")
					{
						if (202893 - 405588 != -202694)
						{
							result = "เครื่องสำอางค์ ที่สุ่มเปลี่ยนหน้าของฮีโร่ ให้เป็นหน้าพิเศษที่ 11-20";
							if (23840 - 410396 != -386555)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfc3")
					{
						if (215174 - 69803 != 145372)
						{
							result = "เครื่องสำอางค์ผีสิง สำหรับเทศกาลเทลโลวีน สุ่มเปลี่ยนหน้าผีของฮีโร่";
							if (281589 - 400580 != -118990)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rsc1")
					{
						if (70348 - 369758 == -299410)
						{
							result = "ยาเปลี่ยนสีผิวของฮีโร่ ให้กลายเป็นสีหลักสีที่หนึ่ง";
							if (63678 - 125326 != -61647)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rsc2")
					{
						if (67797 - 432985 == -365188)
						{
							result = "ยาเปลี่ยนสีผิวของฮีโร่ ให้กลายเป็นสีหลักสีที่สอง";
							if (192500 - 186475 != 6026)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rsc3")
					{
						if (241140 - 175186 != 65955)
						{
							result = "ยาเปลี่ยนสีผิวของฮีโร่ ให้กลายเป็นสีหลักสีที่สาม";
							if (292301 - 62606 == 229695)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rsc4")
					{
						if (139566 - 592074 == -452508)
						{
							result = "ยาเปลี่ยนสีผิวของฮีโร่ ให้กลายเป็นสีหลักสีที่สี่";
							if (65247 - 310620 != -245372)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rsc5")
					{
						if (132465 - 103000 == 29465)
						{
							result = "ยาเปลี่ยนสีผิวของฮีโร่ ให้กลายเป็นสีหลักสีที่ห้า";
							if (132563 - 175342 == -42779)
							{
								break;
							}
						}
					}
					else if (nCode == "f_gld1")
					{
						if (293730 - 270528 == 23202)
						{
							result = "เพิ่ม 500 gold ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (223329 - 276572 == -53243)
							{
								break;
							}
						}
					}
					else if (nCode == "f_gld2")
					{
						if (185113 - 436368 != -251254)
						{
							result = "เพิ่ม 2000 gold ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (75100 - 244245 == -169145)
							{
								break;
							}
						}
					}
					else if (nCode == "f_gld3")
					{
						if (84939 - 392485 == -307546)
						{
							result = "เพิ่ม 5000 gold ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (223995 - 106923 != 117073)
							{
								break;
							}
						}
					}
					else if (nCode == "f_gld4")
					{
						if (136278 - 559812 != -423533)
						{
							result = "เพิ่ม 12000 gold ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (126923 - 178624 != -51700)
							{
								break;
							}
						}
					}
					else if (nCode == "f_gld5")
					{
						if (291880 - 532488 != -240607)
						{
							result = "เพิ่ม 20000 gold ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (37270 - 279116 != -241845)
							{
								break;
							}
						}
					}
					else if (nCode == "f_jil1")
					{
						if (209791 - 458947 != -249155)
						{
							result = "เพิ่ม 100 jil ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (75536 - 523063 != -447526)
							{
								break;
							}
						}
					}
					else if (nCode == "f_jil2")
					{
						if (282988 - 57906 == 225082)
						{
							result = "เพิ่ม 500 jil ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (13408 - 90620 == -77212)
							{
								break;
							}
						}
					}
					else if (nCode == "f_jil3")
					{
						if (56800 - 421649 == -364849)
						{
							result = "เพิ่ม 2000 jil ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (222715 - 183842 == 38873)
							{
								break;
							}
						}
					}
					else if (nCode == "f_jil4")
					{
						if (133407 - 396062 == -262655)
						{
							result = "เพิ่ม 5000 jil ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (78064 - 318761 != -240696)
							{
								break;
							}
						}
					}
					else if (nCode == "f_jil5")
					{
						if (81487 - 554570 == -473083)
						{
							result = "เพิ่ม 12000 jil ให้แก่ผู้เล่น ทันทีที่กดใช้";
							if (253764 - 498329 != -244564)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exp1")
					{
						if (159230 - 9131 == 150099)
						{
							result = "เพิ่ม 300 exp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (6087 - 317111 != -311023)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exp2")
					{
						if (17929 - 310588 == -292659)
						{
							result = "เพิ่ม 1000 exp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (76912 - 101459 != -24546)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exp3")
					{
						if (98405 - 71298 == 27107)
						{
							result = "เพิ่ม 3000 exp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (228815 - 207050 != 21766)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exp4")
					{
						if (148071 - 416631 != -268559)
						{
							result = "เพิ่ม 7000 exp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (264182 - 172643 != 91540)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exp5")
					{
						if (99423 - 469295 == -369872)
						{
							result = "เพิ่ม 15000 exp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (144057 - 347596 == -203539)
							{
								break;
							}
						}
					}
					else if (nCode == "f_arp1")
					{
						if (70550 - 95762 == -25212)
						{
							result = "เพิ่ม 100 rp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (269343 - 166759 == 102584)
							{
								break;
							}
						}
					}
					else if (nCode == "f_arp2")
					{
						if (35558 - 180904 == -145346)
						{
							result = "เพิ่ม 400 rp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (226195 - 227784 != -1588)
							{
								break;
							}
						}
					}
					else if (nCode == "f_arp3")
					{
						if (214748 - 222039 != -7290)
						{
							result = "เพิ่ม 1200 rp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (12880 - 435159 == -422279)
							{
								break;
							}
						}
					}
					else if (nCode == "f_arp4")
					{
						if (122795 - 335760 != -212964)
						{
							result = "เพิ่ม 2500 rp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (34080 - 140849 != -106768)
							{
								break;
							}
						}
					}
					else if (nCode == "f_arp5")
					{
						if (70535 - 321766 == -251231)
						{
							result = "เพิ่ม 4000 rp ให้แก่ตัวละคร ทันทีที่กดใช้";
							if (37139 - 390831 != -353691)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfl1")
					{
						if (61150 - 380190 != -319039)
						{
							result = "ใบจับฉลาก สามารถกดใช้เพื่อสุ่มเปลี่ยนเป็นไอเท็มได้";
							if (250545 - 349880 != -99334)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfl2")
					{
						if (297425 - 181933 == 115492)
						{
							result = "ใบจับฉลาก สามารถกดใช้เพื่อสุ่มเปลี่ยนเป็นไอเท็มได้";
							if (290701 - 246279 == 44422)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfl3")
					{
						if (237505 - 426143 == -188638)
						{
							result = "ใบจับฉลาก สามารถกดใช้เพื่อสุ่มเปลี่ยนเป็นไอเท็มได้";
							if (246332 - 167504 != 78829)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfl4")
					{
						if (238499 - 435126 != -196626)
						{
							result = "ใบจับฉลาก สามารถกดใช้เพื่อสุ่มเปลี่ยนเป็นไอเท็มได้";
							if (187555 - 182792 != 4764)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rfl5")
					{
						if (43394 - 537293 == -493899)
						{
							result = "ใบจับฉลาก สามารถกดใช้เพื่อสุ่มเปลี่ยนเป็นไอเท็มได้";
							if (231170 - 519233 != -288062)
							{
								break;
							}
						}
					}
					else if (nCode == "f_box1")
					{
						if (185195 - 287883 == -102688)
						{
							result = "กล่องลุ้นโชค วัดดวงรายสัปดาห์กับ Xinfu ลัคกี้ๆ";
							if (123836 - 423173 == -299337)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rpb1")
					{
						if (284286 - 598119 != -313832)
						{
							result = "กล่องลุ้นโชคของพวกทหาร ดีกว่าอยู่เปล่าๆ";
							if (222814 - 578212 != -355397)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rpb2")
					{
						if (148316 - 497458 == -349142)
						{
							result = "กล่องลุ้นโชคของผู้พัน ได้มาจากร้าน rp";
							if (176537 - 251665 == -75128)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rpb3")
					{
						if (57685 - 330662 != -272976)
						{
							result = "กล่องลุ้นโชคของนายพล จะเป็นเกียรติแก่ผู้ได้รับ";
							if (269012 - 60913 == 208099)
							{
								break;
							}
						}
					}
					else if (nCode == "f_nyb1")
					{
						if (47369 - 434911 != -387541)
						{
							result = "กล่องของปีใหม่ที่ได้จากต้นสนใจดี น่าสงสัยว่ามีอะไรซ่อนอยู่ข้างในกันแน่";
							if (151918 - 470162 != -318243)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ori1")
					{
						if (205407 - 130987 != 74421)
						{
							result = "กระดาษสำหรับพับ";
							if (98545 - 459865 != -361319)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ppl1")
					{
						if (155629 - 257161 == -101532)
						{
							result = "เครื่องบินกระดาษสำหรับปา มาแข่งกันร่อนว่าใครไกลที่สุดกัน";
							if (145848 - 349707 != -203858)
							{
								break;
							}
						}
					}
					else if (nCode == "f_lkp1")
					{
						if (200012 - 299300 != -99287)
						{
							result = "ซินเจียยู่อี่ ซินนี้ฮวดไช้ อั่งเปาประจำเกม12หาง";
							if (48408 - 545149 != -496740)
							{
								break;
							}
						}
					}
					else if (nCode == "f_vlb1")
					{
						if (226325 - 371667 != -145341)
						{
							result = "กล่องของขวัญวาเลนไทน์ สำหรับมอบให้ชายคนรัก";
							if (377 - 480767 == -480390)
							{
								break;
							}
						}
					}
					else if (nCode == "f_vlb2")
					{
						if (31457 - 333235 == -301778)
						{
							result = "กล่องของขวัญวาเลนไทน์ สำหรับมอบให้หญิงคนรัก";
							if (262465 - 286621 != -24155)
							{
								break;
							}
						}
					}
					else if (nCode == "f_smb1")
					{
						if (31835 - 16959 == 14876)
						{
							result = "ถุงชุดหน้าร้อน ช้างในมีอุปกรณ์สำหรับเที่ยวอยู่";
							if (59274 - 291507 != -232232)
							{
								break;
							}
						}
					}
					else if (nCode == "f_wtb1")
					{
						if (265228 - 276501 == -11273)
						{
							result = "ลูกบอลน้ำคลายร้อน";
							if (121417 - 87850 != 33568)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bdb1")
					{
						if (23563 - 344912 == -321349)
						{
							result = "กล่องของขวัญ ฉลองวันเกิด 12 หาง";
							if (126038 - 380605 != -254566)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hlb1")
					{
						if (289819 - 562587 != -272767)
						{
							result = "ถุงขนม trick or treat มีขาย เฉพาะช่วงเทศกาล เทลโลวีน";
							if (159898 - 3264 != 156635)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hlb2")
					{
						if (63821 - 107195 == -43374)
						{
							result = "กล่อง trick or treat ชุดผี มีขาย เฉพาะช่วงเทศกาล เทลโลวีน";
							if (54875 - 396985 != -342109)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hlb3")
					{
						if (236746 - 284243 != -47496)
						{
							result = "กล่องสุสาน trick or treat มีขาย เฉพาะช่วงเทศกาล เทลโลวีน";
							if (219254 - 153889 == 65365)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ktg1")
					{
						if (201770 - 488726 != -286955)
						{
							result = "กระทงสำหรับเทศกาลลอยกระทง ใช้ได้เฉพาะในสระสวนแสงเท่านั้น";
							if (51016 - 554995 == -503979)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ktg2")
					{
						if (186376 - 568244 != -381867)
						{
							result = "กระทงสำหรับเทศกาลลอยกระทง ใช้ได้เฉพาะในสระสวนแสงเท่านั้น";
							if (221942 - 280100 != -58157)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ktg3")
					{
						if (205436 - 118835 != 86602)
						{
							result = "กระทงสำหรับเทศกาลลอยกระทง ใช้ได้เฉพาะในสระสวนแสงเท่านั้น";
							if (183395 - 157047 != 26349)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ktg4")
					{
						if (150677 - 543192 == -392515)
						{
							result = "เหรียญสำหรับโยนลงน้ำอธิษฐาน ขอพรจากเทพน้ำ ใช้ได้เฉพาะในสระสวนแสงเท่านั้น";
							if (162463 - 349887 == -187424)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ktg5")
					{
						if (121611 - 584926 != -463314)
						{
							result = "เรือกระทงสำหรับลอยตัวเองหนึ่งครั้ง ใช้ได้เฉพาะในสระสวนแสงเท่านั้น";
							if (130944 - 136213 != -5268)
							{
								break;
							}
						}
					}
					else if (nCode == "f_skl1")
					{
						if (126278 - 556839 != -430560)
						{
							result = "โคมไฟสำหรับอธิษฐานขอพร ต่อท้องฟ้า ห้ามใช้ในเมือง เพื่อป้องกันเพลิงไหม้";
							if (110820 - 138375 != -27554)
							{
								break;
							}
						}
					}
					else if (nCode == "f_skl2")
					{
						if (39424 - 576716 != -537291)
						{
							result = "โคมไฟตรุษจีน ห้ามใช้ใน เมืองเพื่อป้องกันเพลิงไหม้";
							if (114545 - 234351 == -119806)
							{
								break;
							}
						}
					}
					else if (nCode == "f_wdv1")
					{
						if (126322 - 592096 != -465773)
						{
							result = "มาปล่อยพิราบขาว แล้วสวดมนต์เพื่อสันติภาพ กันเถอะ!";
							if (153328 - 426258 != -272929)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ibk1")
					{
						if (178251 - 380348 != -202096)
						{
							result = "มาท้าตัวเองด้วย 'Ice Bucket Challenge' กันเถอะ รายได้มอบให้มูลนิธิ ALS";
							if (80959 - 3712 == 77247)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ibk2")
					{
						if (103087 - 442954 == -339867)
						{
							result = "มาท้าคนอื่นด้วย 'Frost Bucket Challenge' กันเถอะ รายได้มอบให้มูลนิธิ ALS";
							if (294916 - 46006 != 248911)
							{
								break;
							}
						}
					}
					else if (nCode == "f_cam1")
					{
						if (149885 - 469807 != -319921)
						{
							result = "กล้องถ่ายรูปที่เพิ่ม effect sepia ให้ชั่วขณะหนึ่ง ใช้ได้ไม่จำกัด";
							if (44993 - 259978 == -214985)
							{
								break;
							}
						}
					}
					else if (nCode == "f_cam2")
					{
						if (162149 - 309973 != -147823)
						{
							result = "กล้องถ่ายรูปที่เพิ่ม effect b&w ให้ชั่วขณะหนึ่ง ใช้ได้ไม่จำกัด";
							if (279200 - 349135 == -69935)
							{
								break;
							}
						}
					}
					else if (nCode == "f_cam3")
					{
						if (106417 - 427302 != -320884)
						{
							result = "กล้องถ่ายรูปที่เพิ่ม effect candy ให้ชั่วขณะหนึ่ง ใช้ได้ไม่จำกัด";
							if (149983 - 220137 == -70154)
							{
								break;
							}
						}
					}
					else if (nCode == "f_cam4")
					{
						if (297323 - 228799 != 68525)
						{
							result = "กล้องถ่ายรูปที่เพิ่ม effect heaven ให้ชั่วขณะหนึ่ง ใช้ได้ไม่จำกัด";
							if (20038 - 205879 != -185840)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exl1")
					{
						if (119546 - 438250 == -318704)
						{
							result = "น้ำอมฤตที่ทำให้เป้าหมายฟื้น HP MP SP กลับมาเต็มอีกครั้ง";
							if (144694 - 17682 != 127013)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exl2")
					{
						if (160227 - 138477 != 21751)
						{
							result = "น้ำอมฤตที่ลบและป้องกันสถานะ ผิดปรกติ ให้เป้้าหมาย (300 sec)";
							if (91547 - 48956 != 42592)
							{
								break;
							}
						}
					}
					else if (nCode == "f_exl3")
					{
						if (257465 - 231397 == 26068)
						{
							result = "น้ำอมฤตที่ชุบชีวิตให้แก่เป้าหมาย ฟื้น 50% hp";
							if (108081 - 89750 != 18332)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ton1")
					{
						if (99859 - 524207 == -424348)
						{
							result = "ยาพ่อบุญทุ่มที่ฟื้น 30% HP MP SP ให้แก่เป้าหมาย";
							if (188168 - 152920 == 35248)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ton2")
					{
						if (77712 - 267766 == -190054)
						{
							result = "ยาพ่อบุญทุ่มที่ลบและป้องกันสถานะ ผิดปรกติ ให้เป้้าหมาย (30 sec)";
							if (146428 - 444439 == -298011)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ton3")
					{
						if (257057 - 133611 != 123447)
						{
							result = "ยาพ่อบุญทุ่มที่ชุบชีวิตให้แก่เป้าหมาย ฟื้น 100 hp";
							if (221206 - 413584 == -192378)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpp1")
					{
						if (259759 - 287658 == -27899)
						{
							result = "ยาที่ช่วยฟื้นคืนเลือดส่วนหนึ่ง (+80 hp)";
							if (17277 - 356304 != -339026)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpp2")
					{
						if (33485 - 532411 != -498925)
						{
							result = "ยาที่ช่วยฟื้นคืนเลือดส่วนหนึ่ง (+150 hp)";
							if (252703 - 195872 != 56832)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpp3")
					{
						if (261582 - 53332 == 208250)
						{
							result = "ยาที่ช่วยฟื้นคืนเลือดส่วนหนึ่ง (+250 hp)";
							if (282131 - 343835 == -61704)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpp4")
					{
						if (271939 - 68836 == 203103)
						{
							result = "ยาที่ช่วยฟื้นคืนเลือดส่วนหนึ่ง (+400 hp)";
							if (90689 - 499736 != -409046)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpp5")
					{
						if (253735 - 335477 != -81741)
						{
							result = "ยาที่ช่วยฟื้นคืนเลือดส่วนหนึ่ง (+800 hp)";
							if (173937 - 242039 == -68102)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpp1")
					{
						if (123608 - 351082 == -227474)
						{
							result = "ยาที่ช่วยฟื้นคืนพลังเวทส่วนหนึ่ง (+30 mp)";
							if (43005 - 356844 == -313839)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpp2")
					{
						if (126425 - 514696 != -388270)
						{
							result = "ยาที่ช่วยฟื้นคืนพลังเวทส่วนหนึ่ง (+60 mp)";
							if (285954 - 334308 != -48353)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpp3")
					{
						if (60093 - 515178 == -455085)
						{
							result = "ยาที่ช่วยฟื้นคืนพลังเวทส่วนหนึ่ง (+120 mp)";
							if (119116 - 251407 != -132290)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpp4")
					{
						if (292520 - 430237 == -137717)
						{
							result = "ยาที่ช่วยฟื้นคืนพลังเวทส่วนหนึ่ง (+200 mp)";
							if (240985 - 461776 == -220791)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpp5")
					{
						if (102799 - 437671 == -334872)
						{
							result = "ยาที่ช่วยฟื้นคืนพลังเวทส่วนหนึ่ง (+300 mp)";
							if (269574 - 279825 != -10250)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spp1")
					{
						if (25666 - 431354 != -405687)
						{
							result = "ยาที่ช่วยเพิ่มพลังสกิลส่วนหนึ่ง (+10 sp)";
							if (116950 - 153853 == -36903)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spp2")
					{
						if (220145 - 437629 == -217484)
						{
							result = "ยาที่ช่วยเพิ่มพลังสกิลส่วนหนึ่ง (+20 sp)";
							if (203779 - 480644 == -276865)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spp3")
					{
						if (84051 - 473293 == -389242)
						{
							result = "ยาที่ช่วยเพิ่มพลังสกิลส่วนหนึ่ง (+30 sp)";
							if (281138 - 229734 == 51404)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spp4")
					{
						if (274182 - 137407 != 136776)
						{
							result = "ยาที่ช่วยเพิ่มพลังสกิลส่วนหนึ่ง (+40 sp)";
							if (165716 - 388329 != -222612)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spp5")
					{
						if (242305 - 19615 == 222690)
						{
							result = "ยาที่ช่วยเพิ่มพลังสกิลส่วนหนึ่ง (+50 sp)";
							if (171278 - 295414 == -124136)
							{
								break;
							}
						}
					}
					else if (nCode == "f_qhp1")
					{
						if (204490 - 296646 == -92156)
						{
							result = "ยาที่ช่วยฟื้น 100 hp อย่างรวดเร็ว";
							if (135752 - 78081 != 57672)
							{
								break;
							}
						}
					}
					else if (nCode == "f_qmp1")
					{
						if (211083 - 286856 == -75773)
						{
							result = "ยาที่ช่วยฟื้น 50 mp อย่างรวดเร็ว";
							if (155029 - 485453 == -330424)
							{
								break;
							}
						}
					}
					else if (nCode == "f_qmp2")
					{
						if (113838 - 418393 == -304555)
						{
							result = "ยาที่ช่วยฟื้น 100 mp อย่างรวดเร็ว";
							if (14508 - 184582 != -170073)
							{
								break;
							}
						}
					}
					else if (nCode == "f_qsp1")
					{
						if (195957 - 375992 == -180035)
						{
							result = "ยาที่ช่วยฟื้น 20 sp อย่างรวดเร็ว";
							if (225994 - 513860 == -287866)
							{
								break;
							}
						}
					}
					else if (nCode == "f_lbs1")
					{
						if (295307 - 565356 != -270048)
						{
							result = "ยาที่เปลี่ยนค่า max hp ให้เท่ากับ 400 เป็นเวลา 3 นาที";
							if (276096 - 543410 == -267314)
							{
								break;
							}
						}
					}
					else if (nCode == "f_lbs2")
					{
						if (239787 - 572500 == -332713)
						{
							result = "ยาที่เปลี่ยนค่า max hp ให้เท่ากับ 800 เป็นเวลา 3 นาที";
							if (25644 - 101313 == -75669)
							{
								break;
							}
						}
					}
					else if (nCode == "f_lbs3")
					{
						if (145411 - 284350 == -138939)
						{
							result = "ยาที่เปลี่ยนค่า max hp ให้เท่ากับ 1200 เป็นเวลา 3 นาที";
							if (195746 - 277696 == -81950)
							{
								break;
							}
						}
					}
					else if (nCode == "f_lbs4")
					{
						if (20413 - 588013 == -567600)
						{
							result = "ยาที่เปลี่ยนค่า max hp ให้เท่ากับ 1600 เป็นเวลา 3 นาที";
							if (44731 - 257742 != -213010)
							{
								break;
							}
						}
					}
					else if (nCode == "f_lbs5")
					{
						if (140317 - 33130 == 107187)
						{
							result = "ยาที่เปลี่ยนค่า max hp ให้เท่ากับ 2000 เป็นเวลา 3 นาที";
							if (121045 - 579530 == -458485)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mbs1")
					{
						if (126908 - 217098 == -90190)
						{
							result = "ยาที่เปลี่ยนค่า max mp ให้เท่ากับ 120 เป็นเวลา 3 นาที";
							if (276166 - 512964 == -236798)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mbs2")
					{
						if (192129 - 11358 == 180771)
						{
							result = "ยาที่เปลี่ยนค่า max mp ให้เท่ากับ 240 เป็นเวลา 3 นาที";
							if (216207 - 301929 != -85721)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mbs3")
					{
						if (292414 - 431482 != -139067)
						{
							result = "ยาที่เปลี่ยนค่า max mp ให้เท่ากับ 360 เป็นเวลา 3 นาที";
							if (192551 - 249233 == -56682)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mbs4")
					{
						if (218648 - 231828 != -13179)
						{
							result = "ยาที่เปลี่ยนค่า max mp ให้เท่ากับ 480 เป็นเวลา 3 นาที";
							if (184578 - 307647 == -123069)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mbs5")
					{
						if (27064 - 310205 == -283141)
						{
							result = "ยาที่เปลี่ยนค่า max mp ให้เท่ากับ 600 เป็นเวลา 3 นาที";
							if (73678 - 551457 != -477778)
							{
								break;
							}
						}
					}
					else if (nCode == "f_sbs1")
					{
						if (185480 - 214189 == -28709)
						{
							result = "ยาที่เปลี่ยนค่า speed ให้เท่ากับ 5 เป็นเวลา 3 นาที";
							if (282847 - 206712 == 76135)
							{
								break;
							}
						}
					}
					else if (nCode == "f_sbs2")
					{
						if (281836 - 545941 != -264104)
						{
							result = "ยาที่เปลี่ยนค่า speed ให้เท่ากับ 6 เป็นเวลา 3 นาที";
							if (266322 - 43282 != 223041)
							{
								break;
							}
						}
					}
					else if (nCode == "f_sbs3")
					{
						if (53845 - 505573 == -451728)
						{
							result = "ยาที่เปลี่ยนค่า speed ให้เท่ากับ 7 เป็นเวลา 3 นาที";
							if (251754 - 257929 != -6174)
							{
								break;
							}
						}
					}
					else if (nCode == "f_sbs4")
					{
						if (241835 - 444799 != -202963)
						{
							result = "ยาที่เปลี่ยนค่า speed ให้เท่ากับ 8 เป็นเวลา 3 นาที";
							if (158955 - 390453 == -231498)
							{
								break;
							}
						}
					}
					else if (nCode == "f_sbs5")
					{
						if (58468 - 351371 != -292902)
						{
							result = "ยาที่เปลี่ยนค่า speed ให้เท่ากับ 9 เป็นเวลา 3 นาที";
							if (185645 - 325924 == -140279)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ebs1")
					{
						if (62431 - 593936 != -531504)
						{
							result = "ยาลบสถานะ boost ที่ต่ำกว่าหรือเท่ากับ 3";
							if (255328 - 524941 != -269612)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ebs2")
					{
						if (244620 - 6384 != 238237)
						{
							result = "ยาลบสถานะ boost ที่ต่ำกว่าหรือเท่ากับ 5";
							if (214502 - 352942 != -138439)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpb1")
					{
						if (238426 - 100757 != 137670)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน เลือดส่วนหนึ่ง (20% hp)";
							if (57501 - 193581 != -136079)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpb2")
					{
						if (22412 - 396521 == -374109)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน เลือดส่วนหนึ่ง (40% hp)";
							if (147719 - 255711 != -107991)
							{
								break;
							}
						}
					}
					else if (nCode == "f_hpb3")
					{
						if (95128 - 153520 == -58392)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน เลือดส่วนหนึ่ง (60% hp)";
							if (182407 - 383613 == -201206)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpb1")
					{
						if (11724 - 401833 == -390109)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน พลังเวทส่วนหนึ่ง (+20% mp)";
							if (131821 - 270915 != -139093)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpb2")
					{
						if (174292 - 1711 != 172582)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน พลังเวทส่วนหนึ่ง (+40% mp)";
							if (58997 - 264200 == -205203)
							{
								break;
							}
						}
					}
					else if (nCode == "f_mpb3")
					{
						if (235544 - 138935 == 96609)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน พลังเวทส่วนหนึ่ง (+60% mp)";
							if (232268 - 568083 == -335815)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spb1")
					{
						if (114949 - 137640 == -22691)
						{
							result = "ยาของกระต่ายที่ช่วยเพิ่ม พลังสกิลส่วนหนึ่ง (+20% sp)";
							if (282669 - 99962 == 182707)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spb2")
					{
						if (143675 - 139262 == 4413)
						{
							result = "ยาของกระต่ายที่ช่วยเพิ่ม พลังสกิลส่วนหนึ่ง (+40% sp)";
							if (282797 - 210616 != 72182)
							{
								break;
							}
						}
					}
					else if (nCode == "f_spb3")
					{
						if (120953 - 18148 != 102806)
						{
							result = "ยาของกระต่ายที่ช่วยเพิ่ม พลังสกิลส่วนหนึ่ง (+60% sp)";
							if (96811 - 308056 == -211245)
							{
								break;
							}
						}
					}
					else if (nCode == "f_slb1")
					{
						if (41921 - 347753 != -305831)
						{
							result = "ยาทำให้ตัวเล็กของกระต่าย";
							if (48405 - 85392 != -36986)
							{
								break;
							}
						}
					}
					else if (nCode == "f_slb2")
					{
						if (120637 - 144205 != -23567)
						{
							result = "ยาทำให้ตัวใหญ่ของกระต่าย";
							if (123209 - 305523 != -182313)
							{
								break;
							}
						}
					}
					else if (nCode == "f_slb3")
					{
						if (91263 - 132914 == -41651)
						{
							result = "ยาทำให้หายตัวของกระต่าย";
							if (61638 - 297772 != -236133)
							{
								break;
							}
						}
					}
					else if (nCode == "f_kob1")
					{
						if (191786 - 220919 == -29133)
						{
							result = "ยาหม่องตรากระต่ายยกนิ้ว ป้องกันการเพิ่มค่า KO ชั่วขณะ";
							if (111613 - 449376 != -337762)
							{
								break;
							}
						}
					}
					else if (nCode == "f_htb1")
					{
						if (275664 - 165586 == 110078)
						{
							result = "น้ำหอมตรากระต่ายยกนิ้ว ป้องกันการเพิ่มค่า Hate ชั่วขณะ";
							if (212968 - 303167 != -90198)
							{
								break;
							}
						}
					}
					else if (nCode == "f_rmb1")
					{
						if (276130 - 309004 == -32874)
						{
							result = "ยาครอบจักรวาลรสหวาน รักษาอาการผิดปรกติเกือบทุกชนิด";
							if (1579 - 543300 == -541721)
							{
								break;
							}
						}
					}
					else if (nCode == "f_stb1")
					{
						if (22713 - 514231 == -491518)
						{
							result = "ยากระตุ้นพลังตรากระต่ายยกนิ้ว สุ่มติดสถานะของกระต่ายยา";
							if (178325 - 311687 != -133361)
							{
								break;
							}
						}
					}
					else if (nCode == "f_ahb1")
					{
						if (207336 - 278254 != -70917)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน 600 hp ให้ทั้งทีมในระยะ 16m";
							if (8139 - 516588 != -508448)
							{
								break;
							}
						}
					}
					else if (nCode == "f_amb1")
					{
						if (197324 - 146235 != 51090)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน 200 mp ให้ทั้งทีมในระยะ 16m";
							if (39262 - 359541 == -320279)
							{
								break;
							}
						}
					}
					else if (nCode == "f_asb1")
					{
						if (291343 - 488121 == -196778)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน 30 sp ให้ทั้งทีมในระยะ 16m";
							if (163455 - 362253 != -198797)
							{
								break;
							}
						}
					}
					else if (nCode == "f_akb1")
					{
						if (157117 - 503172 != -346054)
						{
							result = "ยาของกระต่ายที่ช่วยฟื้นคืน 100 ko ให้ทั้งทีมในระยะ 16m";
							if (12957 - 64081 != -51123)
							{
								break;
							}
						}
					}
					else if (nCode == "f_dem1")
					{
						if (179485 - 540882 == -361397)
						{
							result = "ลูกแก้วของปิศาจ ช่วยเติม hp ให้ทุกคนในทีม ชั่วขณะหนึ่ง";
							if (110442 - 332460 != -222017)
							{
								break;
							}
						}
					}
					else if (nCode == "f_dem2")
					{
						if (240740 - 242899 != -2158)
						{
							result = "อัญมณีของปิศาจ ช่วยเติม mp ให้ทุกคนในทีม ชั่วขณะหนึ่ง";
							if (171020 - 98282 != 72739)
							{
								break;
							}
						}
					}
					else if (nCode == "f_dem3")
					{
						if (148091 - 339985 != -191893)
						{
							result = "หุ่นต้องสาปของปิศาจ ช่วยชุบชีวิตทุกคนในทีม หนึ่งครั้ง";
							if (277143 - 250763 == 26380)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk1")
					{
						if (43988 - 114751 == -70763)
						{
							result = "พลุสีแดง ทำ 30 dmg ในระยะ 12 m";
							if (288014 - 362795 == -74781)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk2")
					{
						if (212507 - 256573 != -44065)
						{
							result = "พลุสีเหลืองที่มีดาวระยิบระยับ ทำ 5 ko ให้เป้าหมายในระยะ 12 m";
							if (92471 - 181315 == -88844)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk3")
					{
						if (237988 - 456382 == -218394)
						{
							result = "พลุสีเขียว ทำให้มองเห็นวัตถุล่องหนในระยะ 12 m";
							if (148591 - 73409 != 75183)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk4")
					{
						if (211782 - 396197 != -184414)
						{
							result = "พลุสีน้ำเงิน ลดค่า mp ของเป้าหมายในระยะ 12 m ลง 30";
							if (126560 - 61755 != 64806)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk5")
					{
						if (41939 - 423323 == -381384)
						{
							result = "ชุดพลุฉลองปีใหม่ ให้ bless2 กับผู้เล่นในระยะ 12 m";
							if (179372 - 572998 != -393625)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk6")
					{
						if (145445 - 225244 == -79799)
						{
							result = "ประทัดเสียงดังสนั่น จุดทีสะดุ้งทั้งละแวก แก้ผลของ sleep";
							if (117018 - 583344 != -466325)
							{
								break;
							}
						}
					}
					else if (nCode == "f_fwk7")
					{
						if (40977 - 357374 != -316396)
						{
							result = "ประทัดสำหรับงานปาร์ตี้ ใช้ได้ไม่จำกัด";
							if (294967 - 240958 != 54010)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bmb1")
					{
						if (241705 - 340746 != -99040)
						{
							result = "ระเบิดที่ทำ 120 dmg และผลักสิ่งรอบข้างในระยะ 12 m ให้กระเด็น";
							if (14694 - 472065 == -457371)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bmb2")
					{
						if (170248 - 479377 != -309128)
						{
							result = "ระเบิดไฟที่ทำ 90 dmg และทำให้เป้าหมายในระยะ 12 m ติด burn2 (6sec)";
							if (89119 - 542881 != -453761)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bmb3")
					{
						if (116336 - 179044 != -62707)
						{
							result = "ระเบิดที่ทำ 75 dmg และทำให้เป้าหมายในระยะ 12 m ติด paralyze2 (3sec)";
							if (108217 - 35477 == 72740)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bmb4")
					{
						if (130935 - 578632 != -447696)
						{
							result = "ระเบิดที่ทำ 60 dmg และทำให้เป้าหมายในระยะ 12 m ติด blind2 (12sec)";
							if (295830 - 175079 == 120751)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bmb5")
					{
						if (156866 - 565435 == -408569)
						{
							result = "ระเบิดที่ทำ 100 dmg และทำให้เป้าหมายในระยะ 12 m ติด Plague4 (15sec)";
							if (163289 - 558967 != -395677)
							{
								break;
							}
						}
					}
					else if (nCode == "f_bmb6")
					{
						if (149697 - 179278 != -29580)
						{
							result = "ระเบิดที่ทำ 100 dmg และทำให้เป้าหมายในระยะ 12 m ติด Frostbite4 (2sec)";
							if (41587 - 420304 != -378716)
							{
								break;
							}
						}
					}
					else if (nCode == "f_wfg1")
					{
						if (100284 - 338840 != -238555)
						{
							result = "ธงศึกสีเหลือง สามารถฟื้นฟู 1%Mp, 2SP ทุกๆ 2Sec ให้กับผู้เล่น ในระยะ 12m";
							if (172555 - 215902 == -43347)
							{
								break;
							}
						}
					}
					else if (nCode == "f_wfg2")
					{
						if (181468 - 569303 != -387834)
						{
							result = "ธงศึกสีฟ้า ชำระล้างสถานะต่างๆ ของผู้เล่นฝ่ายเดียวกัน ในระยะ 12m";
							if (159010 - 484747 != -325736)
							{
								break;
							}
						}
					}
					else if (nCode == "f_wfg3")
					{
						if (58358 - 124005 != -65646)
						{
							result = "ธงศึกสีแดง ทำความเสียหาย 2%HP/sec ต่อศัตรูในระยะ 12m (99 dmg max)";
							if (253798 - 330155 != -76356)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "f_wfg4"))
						{
							break;
						}
						if (96776 - 44074 == 52702)
						{
							result = "ธงศึกสีขาว ช่วยฟื้นฟู 2%HP/sec แก่ผู้เล่นฝ่ายเราในระยะ 12m (100 hp max)";
							if (104457 - 383068 != -278610)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066D9 RID: 26329 RVA: 0x00E853A8 File Offset: 0x00E835A8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066DA RID: 26330 RVA: 0x00E853AC File Offset: 0x00E835AC
	internal static bool vAkWTHpyZiXdwmL0bLBx()
	{
		return true;
	}

	// Token: 0x060066DB RID: 26331 RVA: 0x00E853B0 File Offset: 0x00E835B0
	internal static bool kWeAqCpyCbl32nXdaRsH()
	{
		return false;
	}
}
