using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200115F RID: 4447
[Serializable]
public class FoodData_th : MonoBehaviour
{
	// Token: 0x060066DC RID: 26332 RVA: 0x00E853B4 File Offset: 0x00E835B4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public FoodData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066DD RID: 26333 RVA: 0x00E853C4 File Offset: 0x00E835C4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (259184 - 342247 != -83062)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (4374 - 305747 == -301373)
			{
				if (22493 - 480590 != -458096)
				{
					if (nCode == "d_hrb1")
					{
						if (187195 - 8181 == 179014)
						{
							result = "สมุนไพรสีแดง ส่วนผสมสำคัญสำหรับยากระต่าย +20hp";
							if (205951 - 513853 == -307902)
							{
								break;
							}
						}
					}
					else if (nCode == "d_hrb2")
					{
						if (150059 - 511105 != -361045)
						{
							result = "สมุนไพรสีฟ้า ส่วนผสมสำคัญสำหรับยากระต่าย +5mp +5sp";
							if (26704 - 598327 == -571623)
							{
								break;
							}
						}
					}
					else if (nCode == "d_grb1")
					{
						if (161026 - 494540 == -333514)
						{
							result = "อะไรสักอย่างที่ทำให้ท้องเสีย +20hp -20mp -15sp";
							if (289619 - 135463 != 154157)
							{
								break;
							}
						}
					}
					else if (nCode == "d_brd1")
					{
						if (9352 - 495655 == -486303)
						{
							result = "ก้อนขนมปังเนื้อนุ่ม +20hp";
							if (236020 - 54098 == 181922)
							{
								break;
							}
						}
					}
					else if (nCode == "d_brd2")
					{
						if (149761 - 331139 != -181377)
						{
							result = "แถวขนมปังเนื้อนุ่ม +15hp +10mp";
							if (105521 - 289251 != -183729)
							{
								break;
							}
						}
					}
					else if (nCode == "d_bun1")
					{
						if (280040 - 558774 == -278734)
						{
							result = "ซาลาเปาไม่มีไส้ +25hp +5sp";
							if (123503 - 134297 == -10794)
							{
								break;
							}
						}
					}
					else if (nCode == "d_bun2")
					{
						if (121212 - 41689 == 79523)
						{
							result = "ซาลาเปาไส้ครีม +25hp +5mp";
							if (154318 - 372123 != -217804)
							{
								break;
							}
						}
					}
					else if (nCode == "d_bun3")
					{
						if (33890 - 536113 == -502223)
						{
							result = "ซาลาเปาไส้เนื้อสับ ตำรับดั้งเดิม +25hp +5atk";
							if (71553 - 290958 != -219404)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak1")
					{
						if (86166 - 29163 != 57004)
						{
							result = "ชีสเค้ก หอมหวาน +10hp +15mp +5cha";
							if (277013 - 370895 != -93881)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak2")
					{
						if (250672 - 100360 != 150313)
						{
							result = "เค้กผลไม้ หอมหวานนุ่มละลายบนลิ้น +15hp +20mp +5lck";
							if (30491 - 336814 != -306322)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak3")
					{
						if (266295 - 521695 != -255399)
						{
							result = "สตรอเบอรี่ชีสเค้ก สดใหม่ +10hp +20mp +5sp +5int";
							if (195838 - 407751 == -211913)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak4")
					{
						if (91597 - 10239 == 81358)
						{
							result = "เค้กชอคโกแลต 3ชนิด +5hp +30mp +5sp +5int";
							if (19707 - 39597 != -19889)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak5")
					{
						if (192931 - 141139 == 51792)
						{
							result = "ขนมไหวัพระจันทร์ ให้สถานะ bless1";
							if (132753 - 452360 != -319606)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak6")
					{
						if (263196 - 492286 != -229089)
						{
							result = "ขนมไหวัพระจันทร์ไข่แดง สูตรเด็ดลับเฉพาะจาม่อน ให้สถานะ bless4";
							if (167113 - 407871 != -240757)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cak7")
					{
						if (95676 - 24244 != 71433)
						{
							result = "ขนมเค้กวันเกิด +120hp +60mp +12sp";
							if (160954 - 598895 == -437941)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cnd1")
					{
						if (107103 - 48084 != 59020)
						{
							result = "อมยิ้ม +10mp +2int";
							if (257203 - 396206 == -139003)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cnd2")
					{
						if (267438 - 544365 == -276927)
						{
							result = "ลูกกวาดสีสวย +20 mp";
							if (260460 - 328696 != -68235)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cnd3")
					{
						if (175212 - 210871 != -35658)
						{
							result = "ลูกกวาดแท่ง +30 mp";
							if (192358 - 110762 != 81597)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cnd4")
					{
						if (12735 - 309631 == -296896)
						{
							result = "ถุงขนมลูกกวาด +40 mp";
							if (206489 - 175118 == 31371)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cnd5")
					{
						if (188691 - 419691 != -230999)
						{
							result = "ลูกกวาดสีสวย +50 mp";
							if (124693 - 551385 != -426691)
							{
								break;
							}
						}
					}
					else if (nCode == "d_cnd6")
					{
						if (109520 - 25123 == 84397)
						{
							result = "เซ็ทขนมสำหรับเทศกาลเทลโลวีน +150 hp +150 mp";
							if (138549 - 308785 == -170236)
							{
								break;
							}
						}
					}
					else if (nCode == "d_chs1")
					{
						if (91026 - 559164 != -468137)
						{
							result = "ก้อนชีส +10hp +10mp +3sp";
							if (71462 - 59677 == 11785)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk1")
					{
						if (172104 - 277404 != -105299)
						{
							result = "น้ำดื่ม +2sp";
							if (73008 - 176466 == -103458)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk2")
					{
						if (71006 - 235229 == -164223)
						{
							result = "น้ำแครอท +15hp +10sp +2vit";
							if (273062 - 245275 != 27788)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk3")
					{
						if (39719 - 493978 == -454259)
						{
							result = "น้ำผลไม้ผสม +10hp +10sp +10mp +3vit";
							if (260189 - 510006 == -249817)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk4")
					{
						if (76243 - 385596 != -309352)
						{
							result = "น้ำมะพร้าว +10sp +2def";
							if (44445 - 59174 == -14729)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk5")
					{
						if (143395 - 122598 == 20797)
						{
							result = "ชาสำหรับดื่ม +20sp ช่วยรักษาอาการงงงวย";
							if (18380 - 368883 == -350503)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk6")
					{
						if (157603 - 566812 == -409209)
						{
							result = "กาแฟพร้อมดื่ม +15mp +15sp ทำให้ตื่น";
							if (211981 - 497488 != -285506)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk7")
					{
						if (82943 - 554231 == -471288)
						{
							result = "เบียร์วุ้นเย็นเจี๊ยบ +20hp +10sp ทำให้เมา";
							if (94558 - 104247 != -9688)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk8")
					{
						if (40083 - 579084 != -539000)
						{
							result = "เหล้าวอดก้า ออนเดอะร๊อค +20sp ทำให้เมา";
							if (128993 - 558752 != -429758)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk9")
					{
						if (208810 - 176773 == 32037)
						{
							result = "เหล้าองุ่น หมักในถังไม้โอ๊ค +15mp +15sp ทำให้เมา";
							if (118108 - 406716 == -288608)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk10")
					{
						if (158780 - 401263 == -242483)
						{
							result = "น้ำแตงโม สดชื่นดับกระหาย +20sp +30hp";
							if (265672 - 349446 != -83773)
							{
								break;
							}
						}
					}
					else if (nCode == "d_drk11")
					{
						if (98761 - 38113 == 60648)
						{
							result = "น้ำผลไม้หมักสูตรเฉพาะ ร้อนแรงปานจะพ่นไฟได้ +50HP +10Lck";
							if (95026 - 114762 != -19735)
							{
								break;
							}
						}
					}
					else if (nCode == "d_mlk1")
					{
						if (102453 - 416283 != -313829)
						{
							result = "นม +5hp +5def";
							if (269325 - 506681 != -237355)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea1")
					{
						if (16015 - 262835 == -246820)
						{
							result = "ชานมไข่มุกรสสตรอเบอรี่  หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Atk";
							if (92284 - 55780 == 36504)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea2")
					{
						if (295427 - 179324 != 116104)
						{
							result = "ชานมไข่มุกรสช็อคโกแล็ต หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Def";
							if (85075 - 292410 != -207334)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea3")
					{
						if (208968 - 118006 != 90963)
						{
							result = "ชานมไข่มุกรสเผือก หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Agi";
							if (189241 - 367030 != -177788)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea4")
					{
						if (55887 - 254562 != -198674)
						{
							result = "ชานมไข่มุกรสกาแฟ หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Vit";
							if (152418 - 98914 != 53505)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea5")
					{
						if (199545 - 400214 == -200669)
						{
							result = "ชานมไข่มุกรสชาเชียว หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Int";
							if (12683 - 364677 != -351993)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea6")
					{
						if (167361 - 38143 != 129219)
						{
							result = "ชานมไข่มุกรสกล้วย หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Cha";
							if (17342 - 11680 != 5663)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea7")
					{
						if (294791 - 338195 != -43403)
						{
							result = "ชานมไข่มุกรสนมเย็น หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Tal";
							if (48746 - 382847 != -334100)
							{
								break;
							}
						}
					}
					else if (nCode == "d_tea8")
					{
						if (124690 - 313533 != -188842)
						{
							result = "ชานมไข่มุกรสนมสด หาดื่มได้เฉพาะร้าน iFam เท่านั้น +20Lck";
							if (98220 - 4158 == 94062)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst1")
					{
						if (150341 - 203051 == -52710)
						{
							result = "วิปครีม +15mp";
							if (24319 - 453355 != -429035)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst2")
					{
						if (232603 - 505126 == -272523)
						{
							result = "ชอคโกแลต +10hp +5mp";
							if (198605 - 318198 != -119592)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst3")
					{
						if (25117 - 256267 != -231149)
						{
							result = "เยลลี่ผลไม้ เย็นๆชื่นใจ  +15mp";
							if (33666 - 299519 == -265853)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst4")
					{
						if (50578 - 530504 == -479926)
						{
							result = "กล้วยชอคโกแลต +25hp +10mp";
							if (185541 - 571141 == -385600)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst5")
					{
						if (85672 - 278029 == -192357)
						{
							result = "ขนมปังกล้วยชอคโกแลต โรยหน้าถั่วทอด +40hp +15mp";
							if (117526 - 578395 == -460869)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst6")
					{
						if (63238 - 1553 == 61685)
						{
							result = "ไอศกรีมกล้วยซันเดย์ +80hp +30mp";
							if (46120 - 393543 == -347423)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst7")
					{
						if (171228 - 259146 == -87918)
						{
							result = "ไอศกรีมสตรอเบอรี่ซันเดย์ +80hp +30mp +5sp";
							if (26913 - 261266 == -234353)
							{
								break;
							}
						}
					}
					else if (nCode == "d_dst8")
					{
						if (41155 - 336258 == -295103)
						{
							result = "ไอศกรีมซันเดย์รูปเพนกวิ้น เย็นขึ้นสมอง +80hp +30mp +5sp";
							if (11834 - 520140 != -508305)
							{
								break;
							}
						}
					}
					else if (nCode == "d_egg1")
					{
						if (45327 - 539769 == -494442)
						{
							result = "ไข่ฟีนิกซ์ใบเล็ก +10hp";
							if (250214 - 308134 != -57919)
							{
								break;
							}
						}
					}
					else if (nCode == "d_egg2")
					{
						if (80641 - 417111 != -336469)
						{
							result = "ไข่ฟีนิกซ์ปลอม.. +5 Hp";
							if (43687 - 537568 == -493881)
							{
								break;
							}
						}
					}
					else if (nCode == "d_egg3")
					{
						if (271370 - 599470 == -328100)
						{
							result = "ไข่ฟีนิกซ์ขนาดยักษ์ +20hp";
							if (27207 - 299788 == -272581)
							{
								break;
							}
						}
					}
					else if (nCode == "d_egg4")
					{
						if (109951 - 577380 == -467429)
						{
							result = "ไข่ประหลาด +20hp +5mp +5sp";
							if (260245 - 62405 == 197840)
							{
								break;
							}
						}
					}
					else if (nCode == "d_flr1")
					{
						if (39244 - 231317 != -192072)
						{
							result = "แป้งสาลี +5hp";
							if (24097 - 494113 != -470015)
							{
								break;
							}
						}
					}
					else if (nCode == "d_frt1")
					{
						if (225398 - 204141 != 21258)
						{
							result = "กล้วย +5mp";
							if (154019 - 590485 != -436465)
							{
								break;
							}
						}
					}
					else if (nCode == "d_frt2")
					{
						if (41580 - 485169 != -443588)
						{
							result = "สตรอเบอรี่ +5sp +5mp";
							if (152565 - 286184 == -133619)
							{
								break;
							}
						}
					}
					else if (nCode == "d_frt3")
					{
						if (75976 - 151706 == -75730)
						{
							result = "มะพร้าวขูด +5hp +5sp";
							if (157482 - 253796 == -96314)
							{
								break;
							}
						}
					}
					else if (nCode == "d_frt4")
					{
						if (14631 - 374272 == -359641)
						{
							result = "ผลไม้ยักษ์  +20hp +5mp +5sp";
							if (159326 - 246075 == -86749)
							{
								break;
							}
						}
					}
					else if (nCode == "d_frt5")
					{
						if (11800 - 92221 != -80420)
						{
							result = "ผลไม้รวม +5sp +5mp +5hp";
							if (259415 - 209375 == 50040)
							{
								break;
							}
						}
					}
					else if (nCode == "d_frt6")
					{
						if (288521 - 512239 == -223718)
						{
							result = "แตงโมเนื้อแดงหวานฉ่ำ ทานตอนร้อนๆจะสดชื่นมาก +10SP";
							if (156962 - 489759 != -332796)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ice1")
					{
						if (221965 - 413074 != -191108)
						{
							result = "ก้อนน้ำแข็ง +10mp";
							if (7296 - 569324 == -562028)
							{
								break;
							}
						}
					}
					else if (nCode == "d_jar1")
					{
						if (296603 - 100775 == 195828)
						{
							result = "น้ำผึ้งหวานๆ +2hp +5mp";
							if (232042 - 550380 == -318338)
							{
								break;
							}
						}
					}
					else if (nCode == "d_jar2")
					{
						if (84191 - 344184 != -259992)
						{
							result = "แยมมะนาว เปรี้ยวหวานอร่อย +15hp +15mp";
							if (80035 - 441557 == -361522)
							{
								break;
							}
						}
					}
					else if (nCode == "d_jar3")
					{
						if (11688 - 107537 == -95849)
						{
							result = "แยมสตรอเบอรี่ สีเหมือนทับทิม +12hp +12sp";
							if (147768 - 443004 == -295236)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met1")
					{
						if (105251 - 534116 == -428865)
						{
							result = "เนื้อ +25hp +2atk";
							if (42563 - 583981 != -541417)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met2")
					{
						if (79537 - 577331 != -497793)
						{
							result = "เนื้อลายหินอ่อน +25hp +3sp";
							if (118648 - 522974 != -404325)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met3")
					{
						if (269102 - 282112 == -13010)
						{
							result = "เนื้อสัตว์ประหลาด +15hp -10sp -10mp +20atk";
							if (8670 - 563498 == -554828)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met4")
					{
						if (192759 - 342929 != -150169)
						{
							result = "เนื้อปู +20hp +5atk";
							if (165471 - 486808 != -321336)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met5")
					{
						if (263737 - 567510 == -303773)
						{
							result = "เนื้อซาลามี  +40hp +2sp +5atk";
							if (81932 - 506193 == -424261)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met6")
					{
						if (201408 - 442207 != -240798)
						{
							result = "เบคอน  45hp +5atk";
							if (186442 - 466385 == -279943)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met7")
					{
						if (291140 - 377876 != -86735)
						{
							result = "เนื้อเสต็กย่าง แบบสุกกำลังดี +80hp +10atk +2def";
							if (234390 - 422520 == -188130)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met8")
					{
						if (188382 - 271466 == -83084)
						{
							result = "เนื้อบาร์บีคิว ย่างไฟแรงซอสซึมเข้าเนื้อ +150hp +10atk +10def";
							if (37909 - 315315 == -277406)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met9")
					{
						if (25481 - 596856 != -571374)
						{
							result = "เนื้อเสต็กย่าง เสิร์ฟมาบนกระทะเหล็กร้อนๆ +360hp";
							if (71741 - 512789 != -441047)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met10")
					{
						if (57696 - 487233 != -429536)
						{
							result = "ไส้กรอกแสนอร่อย จริงๆนะ +20hp +5atk";
							if (143326 - 401992 != -258665)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met11")
					{
						if (81773 - 184534 != -102760)
						{
							result = "เนื้อปูชิ้นใหญ่มาก กินคนเดียวไม่หมดแน่นอน +200HP";
							if (75837 - 133041 == -57204)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met12")
					{
						if (33692 - 538247 == -504555)
						{
							result = "เสต็กเนื้อปูราดซอสไซเดอร์ อร่อยปานจะลอยได้ +300HP +40agi";
							if (129281 - 266616 == -137335)
							{
								break;
							}
						}
					}
					else if (nCode == "d_met13")
					{
						if (99386 - 400578 == -301192)
						{
							result = "เนื้อตุ๋นสตูว์ผสมไซเดอร์ โชคดีที่ได้กินจริงๆ +300HP +40lck";
							if (173816 - 438162 == -264346)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod1")
					{
						if (49733 - 102740 != -53006)
						{
							result = "เส้นก๋วยเตี๋ยว +10hp +5sp";
							if (85135 - 526665 != -441529)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod2")
					{
						if (186936 - 542714 != -355777)
						{
							result = "ก๋วยเตี๋ยวแกงกะหรี่ โรยหน้าด้วยหอมเจียว +30hp +15sp";
							if (96207 - 552193 == -455986)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod3")
					{
						if (105694 - 483415 != -377720)
						{
							result = "ขนมจีนแกงเขียวหวาน รสกลมกล่อม +30hp รักษา10Ko +5tal";
							if (176585 - 166837 == 9748)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod4")
					{
						if (93353 - 385065 == -291712)
						{
							result = "บะหมี่ใส่ไข่ต้มซีอิ๊ว +40hp +15def";
							if (76501 - 162640 == -86139)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod5")
					{
						if (13558 - 27980 == -14422)
						{
							result = "บะหมี่เนื้อย่าง หอมกลิ่นเนื้อน้ำซุปเข้มข้น +50hp +5atk +15def";
							if (111337 - 511928 != -400590)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod6")
					{
						if (286528 - 387866 != -101337)
						{
							result = "บะหมี่ต้มยำนรก เผ็ดจนต้องร้องโวยวาย +80hp +5atk +15def";
							if (8217 - 586619 != -578401)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod7")
					{
						if (276283 - 572914 == -296631)
						{
							result = "ปลาเส้นอบร้อน หอมฟุ้งน่าทาน +30HP +30MP +5SP +40cha";
							if (136567 - 317637 != -181069)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nod8")
					{
						if (198004 - 338663 == -140659)
						{
							result = "ปลาเส้นทอด อุดมด้วยไขมันให้ความอบอุ่น  +30HP +30MP +5SP +40def";
							if (72436 - 83689 != -11252)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nut1")
					{
						if (186925 - 518726 != -331800)
						{
							result = "ถั่วลิสง +2hp +2mp";
							if (86470 - 457084 != -370613)
							{
								break;
							}
						}
					}
					else if (nCode == "d_nut2")
					{
						if (12574 - 35211 == -22637)
						{
							result = "ถั่วลันเตา  +1hp +3mp";
							if (16755 - 492273 == -475518)
							{
								break;
							}
						}
					}
					else if (nCode == "d_oil1")
					{
						if (99500 - 132842 == -33342)
						{
							result = "น้ำมันพืช +10hp รักษา 2ko";
							if (18776 - 18033 == 743)
							{
								break;
							}
						}
					}
					else if (nCode == "d_oil2")
					{
						if (147994 - 153474 != -5479)
						{
							result = "น้ำมันงา +10mp รักษา 5ko";
							if (144623 - 177182 == -32559)
							{
								break;
							}
						}
					}
					else if (nCode == "d_oil3")
					{
						if (56517 - 1968 == 54549)
						{
							result = "น้ำมันพริกเผาเผ็ดเอาเรื่อง +5sp รักษา 5ko";
							if (3576 - 541114 == -537538)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric1")
					{
						if (197326 - 454084 != -256757)
						{
							result = "ข้าวสวยหอมกรุ่่น +15hp";
							if (264511 - 217696 != 46816)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric2")
					{
						if (185682 - 460722 != -275039)
						{
							result = "ข้าวไข่เจียวราดซอส กินได้ทุกวันไม่มีเบื่อ +45hp";
							if (36862 - 54121 == -17259)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric3")
					{
						if (140361 - 486211 != -345849)
						{
							result = "ข้าวผัดเจ เพื่อสุขภาพสีสันสวยงาม +30Hp +2Def +5int +5tal รักษา10Ko";
							if (129016 - 100470 != 28547)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric4")
					{
						if (19792 - 447243 != -427450)
						{
							result = "ข้าวผัดกระเทียมกับต้นหอม+30hp +10def";
							if (167728 - 308224 != -140495)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric5")
					{
						if (215871 - 115380 == 100491)
						{
							result = "หมูกระเทียมพริกไทยไข่ดาว รสเข้มข้นเผ็ดร้อน +65hp +10atk";
							if (189430 - 428631 == -239201)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric6")
					{
						if (102946 - 514505 != -411558)
						{
							result = "กะเพราไข่ดาว ราดมาบนข้าวสวยร้อนๆ +65hp +10atk";
							if (193538 - 136450 != 57089)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric7")
					{
						if (88137 - 503825 == -415688)
						{
							result = "ข้าวผัดซาลามี่อย่างดี โรยเกลือนิดๆ  +155hp +10atk +5def";
							if (142944 - 305251 != -162306)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric8")
					{
						if (140660 - 498738 == -358078)
						{
							result = "ข้าวผัดปู ผัดไฟแรงเมล็ดข้าวเป็นสีทอง +185hp +15def";
							if (220029 - 598543 == -378514)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric9")
					{
						if (91395 - 540041 != -448645)
						{
							result = "ข้าวผัดอเมริกัน อาหารมายาตั้งชื่อตามเมืองโบราณ +250hp +20atk";
							if (144255 - 511810 != -367554)
							{
								break;
							}
						}
					}
					else if (nCode == "d_ric10")
					{
						if (5979 - 427437 != -421457)
						{
							result = "ข้าวผัดใส่ชีสสีทองในตำนาน วิธีทำยังเป็นปริศนา +300hp รักษา 40ko";
							if (238344 - 73596 == 164748)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sld1")
					{
						if (19945 - 458945 != -438999)
						{
							result = "สลัดผักสดกรอบจากผักชั้นดี +15hp +5vit รักษา5ko";
							if (220641 - 311877 == -91236)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sld2")
					{
						if (206697 - 119667 == 87030)
						{
							result = "สลัดผลไม้กินแล้วสดชื่น +30hp +10def รักษา5ko";
							if (181057 - 93372 != 87686)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sld3")
					{
						if (167597 - 40512 != 127086)
						{
							result = "สลัดซีฟู้ดหอมกลิ่นอายทะเล +40hp +10def +3vit";
							if (198937 - 11731 == 187206)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sld4")
					{
						if (108733 - 526442 != -417708)
						{
							result = "ส้มตำ เปรี้ยวหวานเผ็ดแซ่บ +20HP +20def +20agi -15atk รักษา 15ko";
							if (121434 - 267787 == -146353)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sld5")
					{
						if (279865 - 278819 != 1047)
						{
							result = "อาหารจานผักขนาด “อุลตร้าสเปเชี่ยลบิ๊กเบิ้ม” ทานยังไงก็ไม่หมด +250Hp +120Mp +30Sp";
							if (16956 - 248739 != -231782)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snk1")
					{
						if (44972 - 543929 == -498957)
						{
							result = "ขนมถุง เอาไว้กินกับเพื่อน +20Hp";
							if (11255 - 104535 == -93280)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snk2")
					{
						if (115709 - 445577 != -329867)
						{
							result = "ปลาเส้นวาฬสะเทิ้นน้ำ เพนกวิ้นทุกตัวควรมีติดตัวไว้ +30MP +5SP +10tal";
							if (249065 - 222455 != 26611)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snw1")
					{
						if (199432 - 128536 != 70897)
						{
							result = "แซนวิชเนยถั่วกับแยมสตอเบอรี่ +30Hp +30vit";
							if (201968 - 269603 != -67634)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snw2")
					{
						if (1373 - 246284 == -244911)
						{
							result = "เบคอนแซนวิชกรอบๆใส่ชีส +50Hp +15Def +40Vit";
							if (104156 - 132350 != -28193)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snw3")
					{
						if (91949 - 66000 == 25949)
						{
							result = "ซาลามี่เบอเกอร์สูตรพิเศษของเชฟ +80Hp +20Atk +20Vit";
							if (162871 - 265841 == -102970)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snw4")
					{
						if (190167 - 572227 != -382059)
						{
							result = "แฮมเบอเกอร์เสต็กหนาพิเศษราดซอสสูตรลับ +250Hp +35Atk -20Def";
							if (271437 - 269586 == 1851)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snw5")
					{
						if (107998 - 445952 == -337954)
						{
							result = "ไส้กรอกประกบขนมปัง ราดด้วยมายองเนส +150HP +40Atk";
							if (83866 - 222758 == -138892)
							{
								break;
							}
						}
					}
					else if (nCode == "d_snw6")
					{
						if (135547 - 420966 == -285419)
						{
							result = "ไส้กรอกประกบขนมปัง ราดด้วยซอสพริกจัดจ้าน +150HP +40Tal";
							if (298891 - 514462 == -215571)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop1")
					{
						if (63907 - 386601 == -322694)
						{
							result = "ซุปผัก กินแล้วฉลาด +20Hp +5Int/Cha/Tal/Lck รักษา5ko";
							if (223352 - 483294 != -259941)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop2")
					{
						if (76829 - 149763 == -72934)
						{
							result = "ซุปหัวหอม กินแล้วเพิ่มพลัง +20Hp +5Atk/Def/Agi/Vit รักษา5ko";
							if (1405 - 146824 != -145418)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop3")
					{
						if (180407 - 806 != 179602)
						{
							result = "ซุปเห็ดที่ท่าทางไม่น่าไว้ใจ ";
							if (289988 - 587806 != -297817)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop4")
					{
						if (51979 - 267390 != -215410)
						{
							result = "แกงเขียวหวาน +50Hp +10Int/Cha/Tal/Lck";
							if (114482 - 348557 == -234075)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop5")
					{
						if (126369 - 306286 != -179916)
						{
							result = "ต้มยำซีฟู้ดใส่เครื่องเพียบ +50Hp +10Atk/Def/Agi/Vit";
							if (144407 - 442526 == -298119)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop6")
					{
						if (200592 - 5932 != 194661)
						{
							result = "ซุปขั้วโลกเหนือ ทานแล้ว หนาวไปถึงขั้วหัวใจ +150hp";
							if (202330 - 239602 == -37272)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop7")
					{
						if (145283 - 548168 != -402884)
						{
							result = "ซุปเครื่องในตุ๋นเพื่อสุขภาพ +5 all stat";
							if (154214 - 130796 != 23419)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop8")
					{
						if (232703 - 303824 == -71121)
						{
							result = "ซุปโสมสูตรเก่าแก่ อุดมไปด้วยสมุนไพร +15 all stat";
							if (167074 - 522193 == -355119)
							{
								break;
							}
						}
					}
					else if (nCode == "d_sop9")
					{
						if (201133 - 424765 != -223631)
						{
							result = "ซุบพระกระโดดกำแพง ในตำนานผสมถั่งเช้า +30 all stat";
							if (191772 - 61924 != 129849)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spc1")
					{
						if (159059 - 34007 != 125053)
						{
							result = "เกลือแสนเค็ม +2mp";
							if (135810 - 103276 != 32535)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spc2")
					{
						if (289819 - 391223 != -101403)
						{
							result = "พริกไทยอย่างดี +3sp";
							if (48138 - 223018 != -174879)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spc3")
					{
						if (293337 - 180914 == 112423)
						{
							result = "น้ำตาล +2mp";
							if (243385 - 414732 != -171346)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spc4")
					{
						if (150014 - 479925 != -329910)
						{
							result = "เครื่องแกง +5hp";
							if (265438 - 288935 == -23497)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spg1")
					{
						if (21156 - 525851 == -504695)
						{
							result = "สปาเก็ตตี้ซอสมะเขีิอเทศ +100hp +15mp +10Int";
							if (239268 - 417976 == -178708)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spg2")
					{
						if (56201 - 313409 == -257208)
						{
							result = "สปาเก็ตตี้ชีสครีมนุ่มลิ้น +100hp +15mp +5Tal +10Lck";
							if (146580 - 582299 == -435719)
							{
								break;
							}
						}
					}
					else if (nCode == "d_spg3")
					{
						if (99875 - 334559 == -234684)
						{
							result = "ผัดสปาเก็ตตี้นโปเลียนเครื่องไม่อั้นปรุงรสกำลังดี +150hp +20mp +10Tal +5Int";
							if (21063 - 348124 == -327061)
							{
								break;
							}
						}
					}
					else if (nCode == "d_src1")
					{
						if (191155 - 284443 == -93288)
						{
							result = "ซอสมะเขือเทศ +2hp";
							if (30705 - 177119 == -146414)
							{
								break;
							}
						}
					}
					else if (nCode == "d_src2")
					{
						if (262969 - 243485 == 19484)
						{
							result = "ซอสมายองเนส +2hp";
							if (227386 - 55196 == 172190)
							{
								break;
							}
						}
					}
					else if (nCode == "d_src3")
					{
						if (296678 - 275643 != 21036)
						{
							result = "ซอสพริก +2sp";
							if (133685 - 515690 != -382004)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg1")
					{
						if (96661 - 446403 != -349741)
						{
							result = "ใบจากหัวแครอท +1hp";
							if (36879 - 404865 != -367985)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg2")
					{
						if (68176 - 528563 == -460387)
						{
							result = "หัวแครอท +3hp";
							if (191478 - 567525 == -376047)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg3")
					{
						if (42295 - 411181 != -368885)
						{
							result = "หัวแครอทหายากสีม่วง +30hp";
							if (194261 - 140909 != 53353)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg4")
					{
						if (94600 - 519556 == -424956)
						{
							result = "ใบพริกหยวก +3mp";
							if (128899 - 567951 != -439051)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg5")
					{
						if (29525 - 302080 != -272554)
						{
							result = "หัวพริกหยวก +5mp";
							if (174674 - 5776 == 168898)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg6")
					{
						if (252453 - 115166 == 137287)
						{
							result = "ดอกต้นกระบองเพชร +10sp";
							if (8833 - 436203 == -427370)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg7")
					{
						if (263617 - 402769 == -139152)
						{
							result = "ต้นกระบองเพชร +3sp";
							if (4716 - 159381 == -154665)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg8")
					{
						if (129077 - 209196 != -80118)
						{
							result = "ใบผักกาด +5hp +2def";
							if (247023 - 353396 != -106372)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg9")
					{
						if (37638 - 399342 == -361704)
						{
							result = "ผลมะเขือเทศ +3hp +3mp";
							if (68006 - 544511 != -476504)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg10")
					{
						if (56359 - 169883 != -113523)
						{
							result = "พริก +5hp";
							if (157744 - 20128 != 137617)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg11")
					{
						if (186939 - 460757 == -273818)
						{
							result = "หัวหอม +5mp -5sp";
							if (290419 - 161376 != 129044)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg12")
					{
						if (1075 - 258751 != -257675)
						{
							result = "กระเทียม  +5sp -5mp";
							if (201771 - 586897 == -385126)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg13")
					{
						if (74208 - 598622 == -524414)
						{
							result = "หัวแครอทขนาดบิ๊กเบิ้ม +250hp";
							if (190577 - 10429 != 180149)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg14")
					{
						if (254952 - 290559 == -35607)
						{
							result = "พริกหยวกขนาดบิ๊กเบิ้ม +120mp";
							if (213346 - 47208 == 166138)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg15")
					{
						if (42499 - 526635 == -484136)
						{
							result = "ลูกมะพร้าวขนาดบิ๊กเบิ้ม +30sp";
							if (64697 - 120534 == -55837)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg16")
					{
						if (168839 - 28201 != 140639)
						{
							result = "เห็ดสีเขียวจากฟังก้อน มีพิษร้ายแรง +250HP";
							if (277321 - 529390 != -252068)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg17")
					{
						if (196594 - 235530 == -38936)
						{
							result = "เห็ดสีแดงสดจากฟังโกะ ฤทธิ์เมายิ่งกว่าสุราแพนด้าเสียอีก +120MP";
							if (209060 - 3477 != 205584)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg18")
					{
						if (23055 - 334444 == -311389)
						{
							result = "เห็ดสีน้ำตาลดำจากฟังก้า ให้ซินฟูกินยังหลับทันทีแค่กัดคำแรก +30SP";
							if (119970 - 39196 != 80775)
							{
								break;
							}
						}
					}
					else if (nCode == "d_veg19")
					{
						if (27175 - 265830 != -238654)
						{
							result = "เนื้อฟักทอง";
							if (135583 - 540880 == -405297)
							{
								break;
							}
						}
					}
					else if (nCode == "d_swd1")
					{
						if (109408 - 438063 == -328655)
						{
							result = "สาหร่ายทะเลสีเขียว สำหรับปรุงยา +30Hp";
							if (714 - 434968 != -434253)
							{
								break;
							}
						}
					}
					else if (nCode == "d_swd2")
					{
						if (280050 - 32991 != 247060)
						{
							result = "สาหร่ายทะเลสีเหลือง สำหรับปรุงยา +15mp";
							if (13597 - 122908 != -109310)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "d_swd3"))
						{
							break;
						}
						if (291427 - 75631 == 215796)
						{
							result = "สาหร่ายทะเลสีฟ้า สำหรับปรุงยา +15Sp";
							if (135874 - 566277 == -430403)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066DE RID: 26334 RVA: 0x00E88410 File Offset: 0x00E86610
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066DF RID: 26335 RVA: 0x00E88414 File Offset: 0x00E86614
	internal static bool hJd8EEpyLMfQLv5CNASk()
	{
		return true;
	}

	// Token: 0x060066E0 RID: 26336 RVA: 0x00E88418 File Offset: 0x00E86618
	internal static bool kIpYSJpyOeEOxgQZ00IH()
	{
		return false;
	}
}
