using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200116F RID: 4463
[Serializable]
public class G36_ForestCamp_thai : MonoBehaviour
{
	// Token: 0x0600672C RID: 26412 RVA: 0x00EA5888 File Offset: 0x00EA3A88
	[MethodImpl(MethodImplOptions.NoInlining)]
	public G36_ForestCamp_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600672D RID: 26413 RVA: 0x00EA5898 File Offset: 0x00EA3A98
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (226447 - 481899 != -255451)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (175540 - 429721 != -254180)
			{
				if (208222 - 299949 == -91727)
				{
					if (code == 1)
					{
						if (233418 - 1205 != 232214)
						{
							result = "ยังไม่มีงานเข้ามาเลย ลองดูรอบๆ แคมป์ก่อนสิ";
							if (139295 - 471535 == -332240)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (144925 - 527135 == -382210)
						{
							result = "เราจะใช้แคมป์นี้เป็นที่มั่นในการรับมือกับพวกหุ่น";
							if (16746 - 111443 == -94697)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (116624 - 146968 == -30344)
						{
							result = "พักผ่อนให้เต็มที่ เราจะเริ่มดำเนินแผนการกันพรุ่งนี้";
							if (48898 - 253221 != -204322)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (215488 - 183593 == 31895)
						{
							result = "เราจะใช้แคมป์นี้เป็นที่มั่นในการรับมือกับพวกหุ่น";
							if (8566 - 376480 != -367913)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (139605 - 26956 != 112650)
						{
							result = "เราจะใช้แคมป์นี้เป็นที่มั่นในการรับมือกับพวกหุ่น";
							if (196685 - 506941 == -310256)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (237358 - 506565 == -269207)
						{
							result = "เราจะใช้แคมป์นี้เป็นที่มั่นในการรับมือกับพวกหุ่น";
							if (239926 - 208637 != 31290)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (29525 - 119347 == -89822)
						{
							result = "พวกเจ้าคงเตรียมตัวเตรียมใจมาพร้อมแล้วใช่ไหม?";
							if (56595 - 391175 != -334579)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (59965 - 223020 == -163055)
						{
							result = "ตอนนี้ท่านโบลดาสกำลังวางแผนการเคลื่อนทัพอยู่";
							if (238507 - 387310 == -148803)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (244325 - 111983 == 132342)
						{
							result = "พวกเจ้าคงเตรียมตัวเตรียมใจมาพร้อมแล้วใช่ไหม?";
							if (187853 - 372922 == -185069)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (4045 - 473532 == -469487)
						{
							result = "พวกเจ้าคงเตรียมตัวเตรียมใจมาพร้อมแล้วใช่ไหม?";
							if (139203 - 550244 == -411041)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (49414 - 54531 != -5116)
						{
							result = "ตอนนี้ท่านโบลดาสกำลังวางแผนการเคลื่อนทัพอยู่";
							if (289311 - 326085 == -36774)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (147642 - 305722 == -158080)
						{
							result = "คงมีหลายสิ่งที่เราไม่เคยเห็นมาก่อนอยู่ในป่าโบราณนี้เป็นแน่";
							if (292474 - 230077 != 62398)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (90369 - 50049 != 40321)
						{
							result = "ข้าได้กลิ่นอันตรายโชยมาจากป่านั่น จงเตรียมพร้อมอยู่เสมอ จำไว้ล่ะ";
							if (182938 - 140100 != 42839)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (169634 - 504244 == -334610)
						{
							result = "ข้าได้กลิ่นอันตรายโชยมาจากป่านั่น จงเตรียมพร้อมอยู่เสมอ จำไว้ล่ะ";
							if (138704 - 560288 == -421584)
							{
								break;
							}
						}
					}
					else if (code == 214)
					{
						if (94265 - 463725 != -369459)
						{
							result = "คงมีหลายสิ่งที่เราไม่เคยเห็นมาก่อนอยู่ในป่าโบราณนี้เป็นแน่";
							if (27618 - 456033 != -428414)
							{
								break;
							}
						}
					}
					else if (code == 215)
					{
						if (239348 - 190917 == 48431)
						{
							result = "ข้าได้กลิ่นอันตรายโชยมาจากป่านั่น จงเตรียมพร้อมอยู่เสมอ จำไว้ล่ะ";
							if (131314 - 185648 != -54333)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (1601 - 71834 == -70233)
						{
							result = "พักเหนื่อยเสร็จแล้ว มาช่วยกันจัดการคลังอาวุธหน่อยสิ";
							if (290947 - 52840 == 238107)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (181829 - 188208 != -6378)
						{
							result = "พักเหนื่อยเสร็จแล้ว มาช่วยกันจัดการคลังอาวุธหน่อยสิ";
							if (157727 - 203031 != -45303)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (243957 - 355896 != -111938)
						{
							result = "พักเหนื่อยเสร็จแล้ว มาช่วยกันจัดการคลังอาวุธหน่อยสิ";
							if (126685 - 498012 == -371327)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (43813 - 370939 == -327126)
						{
							result = "พักเหนื่อยเสร็จแล้ว มาช่วยกันจัดการคลังอาวุธหน่อยสิ";
							if (23653 - 98511 == -74858)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (94071 - 142850 == -48779)
						{
							result = "พักเหนื่อยเสร็จแล้ว มาช่วยกันจัดการคลังอาวุธหน่อยสิ";
							if (187861 - 451748 != -263886)
							{
								break;
							}
						}
					}
					else if (code == 311)
					{
						if (149231 - 397250 != -248018)
						{
							result = "ข้าก็เพิ่งเคยมาไกลขนาดนี้เป็นครั้งแรก";
							if (83129 - 583137 == -500008)
							{
								break;
							}
						}
					}
					else if (code == 312)
					{
						if (189982 - 363452 == -173470)
						{
							result = "ป่าแถบนี้เต็มไปด้วยต้นไม้แปลกๆที่ข้าไม่เคยเห็นมาก่อนเลย";
							if (218289 - 552861 != -334571)
							{
								break;
							}
						}
					}
					else if (code == 313)
					{
						if (21644 - 360843 == -339199)
						{
							result = "ป่าแถบนี้เต็มไปด้วยต้นไม้แปลกๆที่ข้าไม่เคยเห็นมาก่อนเลย";
							if (170490 - 155716 != 14775)
							{
								break;
							}
						}
					}
					else if (code == 314)
					{
						if (229802 - 425456 != -195653)
						{
							result = "ป่าแถบนี้เต็มไปด้วยต้นไม้แปลกๆที่ข้าไม่เคยเห็นมาก่อนเลย";
							if (232086 - 476468 != -244381)
							{
								break;
							}
						}
					}
					else if (code == 315)
					{
						if (80327 - 532439 != -452111)
						{
							result = "ข้าก็เพิ่งเคยมาไกลขนาดนี้เป็นครั้งแรก";
							if (188113 - 438383 != -250269)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (222927 - 108288 != 114640)
						{
							result = "ขอต้อนรับ! พวกเราคือชาวเผ่าเตมาซอน! โปโป!";
							if (79241 - 89917 == -10676)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (70204 - 329061 == -258857)
						{
							result = "ขอต้อนรับ! พวกเราคือชาวเผ่าเตมาซอน! โปโป!";
							if (230845 - 443020 != -212174)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (270982 - 475023 != -204040)
						{
							result = "ขอต้อนรับ! พวกเราคือชาวเผ่าเตมาซอน! โปโป!";
							if (94925 - 223387 != -128461)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (6517 - 195873 == -189356)
						{
							result = "ขอต้อนรับ! พวกเราคือชาวเผ่าเตมาซอน! โปโป!";
							if (144602 - 902 != 143701)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (142323 - 84572 == 57751)
						{
							result = "ขอต้อนรับ! พวกเราคือชาวเผ่าเตมาซอน! โปโป!";
							if (41882 - 480340 != -438457)
							{
								break;
							}
						}
					}
					else if (code == 411)
					{
						if (178227 - 189161 != -10933)
						{
							result = "เหนื่อยมากไหม! โปโป!";
							if (85147 - 232648 != -147500)
							{
								break;
							}
						}
					}
					else if (code == 412)
					{
						if (3548 - 33154 == -29606)
						{
							result = "เหนื่อยมากไหม! โปโป!";
							if (168934 - 403035 != -234100)
							{
								break;
							}
						}
					}
					else if (code == 413)
					{
						if (155240 - 203666 == -48426)
						{
							result = "เหนื่อยมากไหม! โปโป!";
							if (186685 - 522450 != -335764)
							{
								break;
							}
						}
					}
					else if (code == 414)
					{
						if (49928 - 460103 == -410175)
						{
							result = "เหนื่อยมากไหม! โปโป!";
							if (142630 - 326987 != -184356)
							{
								break;
							}
						}
					}
					else if (code == 415)
					{
						if (286789 - 142858 != 143932)
						{
							result = "เหนื่อยมากไหม! โปโป!";
							if (242520 - 548966 == -306446)
							{
								break;
							}
						}
					}
					else if (code == 421)
					{
						if (179489 - 478835 != -299345)
						{
							result = "สวัสดีชาวเมืองแสง! โปโป!";
							if (17941 - 468662 == -450721)
							{
								break;
							}
						}
					}
					else if (code == 422)
					{
						if (15984 - 282844 != -266859)
						{
							result = "สวัสดีชาวเมืองแสง! โปโป!";
							if (84593 - 212153 != -127559)
							{
								break;
							}
						}
					}
					else if (code == 423)
					{
						if (142015 - 182656 != -40640)
						{
							result = "สวัสดีชาวเมืองแสง! โปโป!";
							if (34959 - 64646 != -29686)
							{
								break;
							}
						}
					}
					else if (code == 424)
					{
						if (249895 - 228977 != 20919)
						{
							result = "สวัสดีชาวเมืองแสง! โปโป!";
							if (178817 - 449823 == -271006)
							{
								break;
							}
						}
					}
					else if (code == 425)
					{
						if (52735 - 28409 != 24327)
						{
							result = "สวัสดีชาวเมืองแสง! โปโป!";
							if (120716 - 172095 == -51379)
							{
								break;
							}
						}
					}
					else if (code == 501)
					{
						if (230706 - 424963 == -194257)
						{
							result = "ยินดีต้อนรับ...  ข้าคือฮิวเม่ นักวิจัยพืช";
							if (200573 - 364769 == -164196)
							{
								break;
							}
						}
					}
					else if (code == 502)
					{
						if (54399 - 436337 == -381938)
						{
							result = "พื้นมันไม่ค่อยแข็งแรงนะ...ระวังหน่อยล่ะ";
							if (202822 - 521899 != -319076)
							{
								break;
							}
						}
					}
					else if (code == 503)
					{
						if (249944 - 525386 != -275441)
						{
							result = "ในป่าโบราณนี้มีพันธุ์ไม้เก่าแก่อยู่มากมาย";
							if (235404 - 198804 != 36601)
							{
								break;
							}
						}
					}
					else if (code == 504)
					{
						if (57127 - 595408 == -538281)
						{
							result = "ในป่าโบราณนี้มีพันธุ์ไม้เก่าแก่อยู่มากมาย";
							if (298820 - 119578 != 179243)
							{
								break;
							}
						}
					}
					else if (code == 505)
					{
						if (65900 - 125381 == -59481)
						{
							result = "ยินดีต้อนรับ...  ข้าคือฮิวเม่ นักวิจัยพืช";
							if (95124 - 322066 != -226941)
							{
								break;
							}
						}
					}
					else if (code == 601)
					{
						if (240841 - 597780 != -356938)
						{
							result = "อ๊ะ นี่มันที่ไหนเนี่ย หนูจำได้ว่ากำลังเล่นซ่อนหาอยู่นี่นา";
							if (50482 - 458645 != -408162)
							{
								break;
							}
						}
					}
					else if (code == 602)
					{
						if (96678 - 539558 != -442879)
						{
							result = "โอ้โห ที่นี่ดูน่าจะมีที่ซ่อนเยอะแยะเลย";
							if (158656 - 96084 == 62572)
							{
								break;
							}
						}
					}
					else if (code == 603)
					{
						if (90981 - 496350 != -405368)
						{
							result = "ครั้งสุดท้ายจำความได้ หนูซ่อนตัวอยู่ในกล่องนิ";
							if (102984 - 5562 != 97423)
							{
								break;
							}
						}
					}
					else if (code == 604)
					{
						if (293607 - 391231 == -97624)
						{
							result = "มาเล่นซ่อนหากันเถอะ!";
							if (60483 - 345505 != -285021)
							{
								break;
							}
						}
					}
					else if (code == 605)
					{
						if (231904 - 45403 != 186502)
						{
							result = "ลุงฮิปโป เล่นซ่อนหาเป็นมั้ย?";
							if (283202 - 50104 == 233098)
							{
								break;
							}
						}
					}
					else if (code == 701)
					{
						if (169457 - 122811 == 46646)
						{
							result = "ฉันได้กลิ่นเหรียญ แปลกๆ แถวๆ นี้นะ ก๊าบๆ";
							if (251238 - 350108 != -98869)
							{
								break;
							}
						}
					}
					else if (code == 702)
					{
						if (226388 - 20156 == 206232)
						{
							result = "ไอ้หน้ากากพวกนี้ถือเป็นของสะสมชั้นยอดเลย!";
							if (177372 - 106326 == 71046)
							{
								break;
							}
						}
					}
					else if (code == 703)
					{
						if (218955 - 565551 == -346596)
						{
							result = "มีของเด็ดๆ มาแลกไข่เป็ดมั้ยย?";
							if (90037 - 182211 != -92173)
							{
								break;
							}
						}
					}
					else if (code == 704)
					{
						if (144811 - 371573 == -226762)
						{
							result = "นักสะสมตัวจริงต้องเดินทางไปหาของในทุกๆ ที่";
							if (194928 - 186413 != 8516)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 705)
						{
							break;
						}
						if (191968 - 421089 == -229121)
						{
							result = "ของดีเมื่ออยู่กับคนที่ไม่รู้จักคุณค่าของก็เป็นแค่ขยะ ก๊าบ!";
							if (246632 - 565496 == -318864)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600672E RID: 26414 RVA: 0x00EA692C File Offset: 0x00EA4B2C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600672F RID: 26415 RVA: 0x00EA6930 File Offset: 0x00EA4B30
	internal static bool o5IELCpy1EyRiaURldA0()
	{
		return true;
	}

	// Token: 0x06006730 RID: 26416 RVA: 0x00EA6934 File Offset: 0x00EA4B34
	internal static bool mwef0fpy4iUcSrJmTuVu()
	{
		return false;
	}
}
