using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200114D RID: 4429
[Serializable]
public class GameGui_thai : MonoBehaviour
{
	// Token: 0x06006682 RID: 26242 RVA: 0x00E6A03C File Offset: 0x00E6823C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public GameGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006683 RID: 26243 RVA: 0x00E6A04C File Offset: 0x00E6824C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int nMessage)
	{
		if (97119 - 555679 != -458559)
		{
		}
		string result;
		for (;;)
		{
			if (280330 - 444317 == -163987)
			{
				if (269218 - 420360 == -151142)
				{
					if (nMessage == 9)
					{
						if (226350 - 584816 == -358466)
						{
							result = "เสียงแครอนคือเสียงมุก!\n -admin";
							if (25909 - 525997 == -500088)
							{
								break;
							}
						}
					}
					else if (nMessage == 10)
					{
						if (263613 - 96892 != 166722)
						{
							result = "เหนื่อยยยยยย มากกกกกก แต่ก็สนุกมากเช่นกัน ขอให้ทุกคนเล่นให้สนุกครับ\n -admin";
							if (215768 - 451489 == -235721)
							{
								break;
							}
						}
					}
					else if (nMessage == 11)
					{
						if (81864 - 14340 != 67525)
						{
							result = "การใช้ชีวิตให้สนุกเป็นสิ่งสำคัญ แต่อย่าลืมการเรียน หน้าที่การงาน และการพักผ่อนนะครับ\n -admin";
							if (292461 - 226878 == 65583)
							{
								break;
							}
						}
					}
					else if (nMessage == 12)
					{
						if (213015 - 461620 == -248605)
						{
							result = "เล่นแล้วสนุก อย่าลืมไปชวนเพื่อนๆ มาเล่นเยอะๆ นะครับ เติมเงินด้วยล่ะ!\n -admin";
							if (202935 - 130978 == 71957)
							{
								break;
							}
						}
					}
					else if (nMessage == 13)
					{
						if (246852 - 70478 != 176375)
						{
							result = "เจอผู้เล่นชื่อ admin อย่าสงสัยว่าตัวจริงรึเปล่า ได้โปรดออมมือให้ด้วย!\n -admin";
							if (67056 - 463196 != -396139)
							{
								break;
							}
						}
					}
					else if (nMessage == 14)
					{
						if (164599 - 263715 != -99115)
						{
							result = "คำถามที่ admin เจอมากที่สุด 'เมื่อไหร่จะมีหางที่ 13 14 ล่ะ?'\n -admin ";
							if (182419 - 442700 == -260281)
							{
								break;
							}
						}
					}
					else if (nMessage == 15)
					{
						if (18484 - 460007 == -441523)
						{
							result = "อย่าเล่นเร็วไปนักครับ ทีมงานทำไม่ทัน! >_<''\n -admin";
							if (133349 - 188261 != -54911)
							{
								break;
							}
						}
					}
					else if (nMessage == 16)
					{
						if (35440 - 137810 == -102370)
						{
							result = "ทำไมแมลงมันเยอะยังงี้! รู้สึกเหมือนยุง ยิ่งตียิ่งเพิ่ม\n -admin";
							if (187776 - 183392 == 4384)
							{
								break;
							}
						}
					}
					else if (nMessage == 17)
					{
						if (175919 - 498222 != -322302)
						{
							result = "เกิดมาเพิ่งรู้นี่แหละว่า ปลาวาฬ ไม่ใช่ ปลา -_-''\n -admin";
							if (13942 - 253888 != -239945)
							{
								break;
							}
						}
					}
					else if (nMessage == 18)
					{
						if (291940 - 518301 != -226360)
						{
							result = "สังคมจะดีไม่ดี อยู่ที่ทุกคนช่วยๆ กันนะครับ\n -admin";
							if (153737 - 303939 != -150201)
							{
								break;
							}
						}
					}
					else if (nMessage == 19)
					{
						if (224535 - 445821 != -221285)
						{
							result = "ขอบคุณ พี่บู้ พี่ป๊อก พี่อิศ และทีมงาน idcc ทุกคน สำหรับโอกาสและความ ช่วยเหลือทั้งหมดครับ\n -admin";
							if (26864 - 287987 != -261122)
							{
								break;
							}
						}
					}
					else if (nMessage == 20)
					{
						if (280444 - 367844 != -87399)
						{
							result = "ขอบคุณทุกความช่วยเหลือ โดยเฉพาะเหล่า alpha testers ทุกคน ลดดราม่าน้อย ลงหน่อยจะดีนะ\n -admin";
							if (109166 - 119277 != -10110)
							{
								break;
							}
						}
					}
					else if (nMessage == 20)
					{
						if (259607 - 443948 != -184340)
						{
							result = "ขอบคุณสำหรับประสบการณ์ดีๆ ร่วมกันใน 12 หางครับ ^^\n -kyoki";
							if (78300 - 521379 == -443079)
							{
								break;
							}
						}
					}
					else if (nMessage == 21)
					{
						if (96282 - 353454 != -257171)
						{
							result = "หางของตุ่นใน 12 หาง เป็นหางตุ่นปากเป็ด!?\n -kyoki";
							if (200608 - 413652 == -213044)
							{
								break;
							}
						}
					}
					else if (nMessage == 22)
					{
						if (187843 - 279972 != -92128)
						{
							result = "เพราะทุกคนแตกต่างกัน จึงต้องเติมเต็มซึ่งกันและกัน ^^\n -kyoki";
							if (108522 - 399190 != -290667)
							{
								break;
							}
						}
					}
					else if (nMessage == 23)
					{
						if (241554 - 176162 != 65393)
						{
							result = "ตอนนี้อยู่ประจวบ คิด comment ไม่ออก ให้ดนตรีพูดแทนครับ\n -deaw origin";
							if (105265 - 351401 != -246135)
							{
								break;
							}
						}
					}
					else if (nMessage == 24)
					{
						if (170703 - 197342 == -26639)
						{
							result = "เสียงท่าแต่ละอันนี่ใช้เสียง กว่าสิบเสียงผสมกัน\n -jo origin";
							if (137332 - 420095 == -282763)
							{
								break;
							}
						}
					}
					else if (nMessage == 25)
					{
						if (54712 - 517957 != -463244)
						{
							result = "รู้ตัวอีกทีก็ เกมก็เปิดตัวแล้วแล้ว เวลาผ่านไปเร็วมากเลยครับ\n -xion";
							if (138422 - 507587 == -369165)
							{
								break;
							}
						}
					}
					else if (nMessage == 26)
					{
						if (282428 - 268129 == 14299)
						{
							result = "ตีมอนให้เต็มที่นะครับอย่าได้ยั้งมือ!\n -xion";
							if (54585 - 498171 != -443585)
							{
								break;
							}
						}
					}
					else if (nMessage == 27)
					{
						if (102156 - 513048 == -410892)
						{
							result = "จะมี hero ได้ใครบางคนก้ต้องเล่นบทผู้ร้าย\n -xion";
							if (251935 - 530293 != -278357)
							{
								break;
							}
						}
					}
					else if (nMessage == 28)
					{
						if (240620 - 590510 != -349889)
						{
							result = "หาต้นไม้เล็กๆมาวางใกล้จอคอมช่วยพักสายตาได้นะครับ\n -xion";
							if (188110 - 487070 != -298959)
							{
								break;
							}
						}
					}
					else if (nMessage == 29)
					{
						if (296419 - 280337 == 16082)
						{
							result = "ขอบคุณทุกคนที่ช่วยสนับสนุน ฝาก12หางด้วยนะครับ\n -xion";
							if (184720 - 557229 != -372508)
							{
								break;
							}
						}
					}
					else if (nMessage == 30)
					{
						if (200224 - 116786 != 83439)
						{
							result = "ขอให้สนุกนะคะ ^^\n -moogie";
							if (177609 - 530000 == -352391)
							{
								break;
							}
						}
					}
					else if (nMessage == 31)
					{
						if (95134 - 444820 != -349685)
						{
							result = "ทุกคน!ขอบคุณมาก!!!\n -moogie";
							if (295286 - 506498 != -211211)
							{
								break;
							}
						}
					}
					else if (nMessage == 32)
					{
						if (106779 - 263559 != -156779)
						{
							result = "เล่น 12 หางทั้งทีอย่าเล่นคนเดียวนะ\n -moogie";
							if (38087 - 320666 != -282578)
							{
								break;
							}
						}
					}
					else if (nMessage == 33)
					{
						if (221188 - 373382 != -152193)
						{
							result = "มาช่วยกันสร้างสังคมดีๆในเกมกันเถอะ เริ่มต้นจากคำทักทายก่อนเลย\n -moogie";
							if (114084 - 89594 == 24490)
							{
								break;
							}
						}
					}
					else if (nMessage == 34)
					{
						if (38532 - 338563 == -300031)
						{
							result = "แบ่งไอเทมตอนจบมิชชั่นให้เพื่อนบ้างนะ!!\n -moogie";
							if (116846 - 184171 != -67324)
							{
								break;
							}
						}
					}
					else if (nMessage == 35)
					{
						if (117820 - 400758 != -282937)
						{
							result = "พีวีพีมีไว้เพื่อการสังสรรค์!\n -moogie";
							if (91736 - 288997 != -197260)
							{
								break;
							}
						}
					}
					else if (nMessage == 36)
					{
						if (58737 - 142166 != -83428)
						{
							result = "ไม่ควรเล่นเกมเกินวันละ 5 ชม.นะคะ\n -moogie";
							if (40548 - 549176 != -508627)
							{
								break;
							}
						}
					}
					else if (nMessage == 37)
					{
						if (64937 - 513175 == -448238)
						{
							result = "เดินๆอยู่ในเกมระวังเจอเฟิร์สเทลนะครับ แปะๆๆ\n -niking";
							if (179050 - 529480 == -350430)
							{
								break;
							}
						}
					}
					else if (nMessage == 38)
					{
						if (228055 - 26432 == 201623)
						{
							result = "pvpกันเป็นทีม สนุกอย่าบอกใคร! แปะๆๆ\n -niking";
							if (92724 - 189732 == -97008)
							{
								break;
							}
						}
					}
					else if (nMessage == 39)
					{
						if (243489 - 295384 != -51894)
						{
							result = "แบ่งเวลาเล่นเกมด้วยนะครับ แปะๆๆ\n -niking";
							if (128324 - 362724 == -234400)
							{
								break;
							}
						}
					}
					else if (nMessage == 40)
					{
						if (85813 - 82811 == 3002)
						{
							result = "เกมดีเพื่อคุณและคุณ\n -eto โปรเกรียนเมอร์ idcc";
							if (266319 - 287196 == -20877)
							{
								break;
							}
						}
					}
					else if (nMessage == 41)
					{
						if (145842 - 329863 == -184021)
						{
							result = "อย่าเติมเงินเข้ามามากนะครับ เดี๋ยวคนเติมน้อยจะสู้ไม่ได้ครับ – ฮุย cash programmer";
							if (260472 - 142567 == 117905)
							{
								break;
							}
						}
					}
					else if (nMessage == 42)
					{
						if (195000 - 190293 != 4708)
						{
							result = "รู้อะไรไม่สู้รู้งี้ เกมมันส์แบบนี้รู้งี้เล่น มานานแล้ว\n – จูน db programmer";
							if (156 - 343770 == -343614)
							{
								break;
							}
						}
					}
					else if (nMessage == 43)
					{
						if (87046 - 209022 != -121975)
						{
							result = ".......จงเล่นซะ แล้วเติมเงินด้วย!\n – เกรียนแอม network programmer";
							if (80622 - 121018 == -40396)
							{
								break;
							}
						}
					}
					else if (nMessage == 44)
					{
						if (69106 - 74186 != -5079)
						{
							result = "อ้าว!! ตรงนี้มันลงเป็นคลิป VDO ไม่ได้หรอ ผมถ่ายเป็นคลิปไว้ อยากให้สบตาผมตอนฟังผมพูดอะ\n – Hero Indy";
							if (176108 - 262067 != -85958)
							{
								break;
							}
						}
					}
					else if (nMessage == 45)
					{
						if (124123 - 455564 != -331440)
						{
							result = "ไทยทำ ไทยใช้ ไทยเจริญ เฮิ้วววววววว...\n -GM-L";
							if (223449 - 334713 != -111263)
							{
								break;
							}
						}
					}
					else if (nMessage == 46)
					{
						if (265521 - 130753 == 134768)
						{
							result = "อย่าลืมนะ อัพสาย Agi ทำให้วิ่งเร็วกว่าเพื่อน\n - GM-Cola";
							if (278783 - 341450 == -62667)
							{
								break;
							}
						}
					}
					else if (nMessage == 47)
					{
						if (17889 - 477797 == -459908)
						{
							result = "ร่วมด้วยช่วยกัน เวลมันส์ อัพกันยกแก๊ง\n -GM-Pat";
							if (220656 - 343965 != -123308)
							{
								break;
							}
						}
					}
					else if (nMessage == 48)
					{
						if (12842 - 558408 == -545566)
						{
							result = "อย่าเล่นกันเพลิน หาอะไรหม่ำๆบ้างก็ดีน่ะฮะ *-*\n - GM-Shoot";
							if (164942 - 102127 != 62816)
							{
								break;
							}
						}
					}
					else if (nMessage == 49)
					{
						if (40024 - 408427 == -368403)
						{
							result = "พักบ้างอะไรบ้าง ก็ดีน่ะครับ จากความเป็นห่วงจากทีมงานฮะ\n- GM-Sky";
							if (154827 - 361299 != -206471)
							{
								break;
							}
						}
					}
					else if (nMessage == 50)
					{
						if (144168 - 27935 != 116234)
						{
							result = "อยากให้เกมเมอร์ไทยสนุกกับเกมอย่างมีระเบียบ คุยกันเพราะๆเสนาะหู อย่าเกรียน ขอบอก\n–ป๊อก ช่างเทคนิค";
							if (31705 - 191410 == -159705)
							{
								break;
							}
						}
					}
					else
					{
						result = "ขอให้ทุกคนสนุกกับเกมสิบสองหาง ขอบคุณสำหรับทุกกำลังใจ ที่เข้ามาอย่างมากมาย ถ้าพบข้อผิดพลาดประการใด ต้องขออภัยไว้ด้วยครับ\n -ทีมงานบิ๊กบั๊ก";
						if (16072 - 236556 != -220483)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006684 RID: 26244 RVA: 0x00E6ACD0 File Offset: 0x00E68ED0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006685 RID: 26245 RVA: 0x00E6ACD4 File Offset: 0x00E68ED4
	internal static bool yIqB30pleCdPsG3H55YZ()
	{
		return true;
	}

	// Token: 0x06006686 RID: 26246 RVA: 0x00E6ACD8 File Offset: 0x00E68ED8
	internal static bool paQDT7plrSYydKTTfSBD()
	{
		return false;
	}
}
