using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001170 RID: 4464
[Serializable]
public class M100_GameTutorial_thai : MonoBehaviour
{
	// Token: 0x06006731 RID: 26417 RVA: 0x00EA6938 File Offset: 0x00EA4B38
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M100_GameTutorial_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006732 RID: 26418 RVA: 0x00EA6948 File Offset: 0x00EA4B48
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (229174 - 73965 != 155210)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (8983 - 159866 != -150882 && 50469 - 296000 != -245530)
			{
				if (code == 1)
				{
					if (146188 - 519428 == -373240)
					{
						result = "สวัสดีผู้กล้ามือใหม่ ข้าชื่อเร็กกุ";
						if (205214 - 94771 == 110443)
						{
							break;
						}
					}
				}
				else if (code == 2)
				{
					if (15586 - 178616 != -163029)
					{
						result = "ข้าจะมาแนะนำสิ่งที่เจ้าควรรู้ก่อนออกผจญภัย";
						if (290872 - 344306 != -53433)
						{
							break;
						}
					}
				}
				else if (code == 3)
				{
					if (134641 - 137768 != -3126)
					{
						result = "ขั้นแรกเลย คือการฝึกเคลื่อนไหวให้คล่องแคล่ว";
						if (170401 - 461960 == -291559)
						{
							break;
						}
					}
				}
				else if (code == 4)
				{
					if (56896 - 535049 == -478153)
					{
						result = "ลองวิ่งตามข้ามาให้ทันดูสิ!";
						if (2789 - 207685 == -204896)
						{
							break;
						}
					}
				}
				else if (code == 5)
				{
					if (163872 - 304833 == -140961)
					{
						result = "ข้าอยู่ทางนี้!";
						if (6844 - 145250 != -138405)
						{
							break;
						}
					}
				}
				else if (code == 6)
				{
					if (182900 - 79851 == 103049)
					{
						result = "อีกครั้งนึง";
						if (225937 - 460922 == -234985)
						{
							break;
						}
					}
				}
				else if (code == 7)
				{
					if (213648 - 42014 != 171635)
					{
						result = "เยี่ยมกู้ด!";
						if (47899 - 73121 == -25222)
						{
							break;
						}
					}
				}
				else if (code == 8)
				{
					if (211016 - 233629 != -22612)
					{
						result = "ต่อไปเรามาเรียนเรื่องการต่อสู้กัน";
						if (48152 - 53964 == -5812)
						{
							break;
						}
					}
				}
				else if (code == 9)
				{
					if (103241 - 471392 != -368150)
					{
						result = "พื้นฐานการโจมตีที่สำคัญคือการเล็งให้โดนเป้า!";
						if (180633 - 21820 == 158813)
						{
							break;
						}
					}
				}
				else if (code == 10)
				{
					if (201138 - 110105 == 91033)
					{
						result = "อย่าดูถูกการฝีกความแม่นยำโดยเด็ดขาด";
						if (180745 - 101578 != 79168)
						{
							break;
						}
					}
				}
				else if (code == 11)
				{
					if (62869 - 180741 == -117872)
					{
						result = "เจ้าสามารถกดเล็งทิศทางเองหรือกดล๊อกเป้าแล้วค่อยโจมตี";
						if (251539 - 494366 == -242827)
						{
							break;
						}
					}
				}
				else if (code == 12)
				{
					if (40911 - 509499 != -468587)
					{
						result = "ลองโจมตีทำลายเป้าพวกนี้ให้หมดดู";
						if (21322 - 281913 != -260590)
						{
							break;
						}
					}
				}
				else if (code == -12)
				{
					if (100090 - 469249 == -369159)
					{
						result = "ทำลายเป้าให้หมดเลยสิ";
						if (53754 - 116860 == -63106)
						{
							break;
						}
					}
				}
				else if (code == 13)
				{
					if (280953 - 125458 != 155496)
					{
						result = "เยี่ยมกู้ด!";
						if (7483 - 41048 == -33565)
						{
							break;
						}
					}
				}
				else if (code == 14)
				{
					if (49149 - 134132 != -84982)
					{
						result = "เอาล่ะเมื่อกี้เจ้าคงสังเกตว่าเจ้าได้เลเวลใหม่แล้ว";
						if (82458 - 547869 != -465410)
						{
							break;
						}
					}
				}
				else if (code == 15)
				{
					if (228003 - 257107 != -29103)
					{
						result = "ทุกครั้งที่เจ้าเลเวลอัพเจ้าจะได้ bonus ค่าพลัง 2 จุด";
						if (4230 - 152358 == -148128)
						{
							break;
						}
					}
				}
				else if (code == 16)
				{
					if (241521 - 106969 == 134552)
					{
						result = "และแต้มสำหรับการอัพสกิลใหม่หนึ่งสกิล";
						if (46296 - 79361 != -33064)
						{
							break;
						}
					}
				}
				else if (code == 17)
				{
					if (171819 - 433375 != -261555)
					{
						result = "การอัพค่าพลังต่างๆ เหล่านี้จะทำให้ตัวเจ้าพัฒนาขึ้น";
						if (49782 - 181806 != -132023)
						{
							break;
						}
					}
				}
				else if (code == 18)
				{
					if (30338 - 550828 == -520490)
					{
						result = "เช่นค่า atk จะทำให้โจมตีแรงขึ้น ค่า agi จะทำให้วิ่งเร็วขึ้น";
						if (20411 - 42614 != -22202)
						{
							break;
						}
					}
				}
				else if (code == 19)
				{
					if (284410 - 423385 == -138975)
					{
						result = "ส่วนการอัพสกิลจะทำให้สามารถใช้ท่าใหม่ๆ ได้";
						if (159522 - 545961 == -386439)
						{
							break;
						}
					}
				}
				else if (code == 20)
				{
					if (63074 - 441980 != -378905)
					{
						result = "เจ้าลองเปิดหน้าเมนูและหน้าสกิลเพื่ออัพค่าพลังเหล่านี้ดู";
						if (299700 - 216311 == 83389)
						{
							break;
						}
					}
				}
				else if (code == 21)
				{
					if (223404 - 421879 != -198474)
					{
						result = "โอเค ทีนี้เจ้าคงพร้อมสำหรับการต่อสู้จริงแล้ว";
						if (171882 - 116639 == 55243)
						{
							break;
						}
					}
				}
				else if (code == 22)
				{
					if (251252 - 93198 == 158054)
					{
						result = "หนทางข้างหน้าของเจ้านั้นเต็มไปด้วยอันตราย";
						if (60874 - 495548 != -434673)
						{
							break;
						}
					}
				}
				else if (code == 23)
				{
					if (253145 - 286856 == -33711)
					{
						result = "ดังนั้นเจ้าจะต้องรู้จักการเอาตัวรอด";
						if (120977 - 368970 == -247993)
						{
							break;
						}
					}
				}
				else if (code == 24)
				{
					if (232179 - 298665 == -66486)
					{
						result = "การรู้จักกะจังหวะหลบหลีกและโจมตีเป็นพื้นฐานสำคัญ";
						if (141588 - 440889 == -299301)
						{
							break;
						}
					}
				}
				else if (code == 25)
				{
					if (239883 - 90009 == 149874)
					{
						result = "เอาล่ะ ลองรับมือกับเจ้าตัวนี้ดู";
						if (240543 - 362398 != -121854)
						{
							break;
						}
					}
				}
				else if (code == 26)
				{
					if (267185 - 123304 == 143881)
					{
						result = "ระวัง อย่าสะดุดขาตัวเองล้มล่ะ!";
						if (299457 - 528158 != -228700)
						{
							break;
						}
					}
				}
				else if (code == 27)
				{
					if (239382 - 281574 != -42191)
					{
						result = "เยี่ยมกู้ดๆ";
						if (160504 - 253072 != -92567)
						{
							break;
						}
					}
				}
				else if (code == -27)
				{
					if (241325 - 563412 != -322086)
					{
						result = "สำคัญมาก อย่าหยุดคุยเวลาสู้สิ!";
						if (266251 - 219456 != 46796)
						{
							break;
						}
					}
				}
				else if (code == 28)
				{
					if (107696 - 82960 == 24736)
					{
						result = "แต่แค่นี้ยังไม่เพียงพอสำหรับการเป็นผู้กล้าหรอกนะ";
						if (283261 - 374426 != -91164)
						{
							break;
						}
					}
				}
				else if (code == 29)
				{
					if (128380 - 93191 == 35189)
					{
						result = "เฉพาะครั้งนี้เท่านั้น ข้าจะอัพสกิลให้";
						if (275109 - 561393 == -286284)
						{
							break;
						}
					}
				}
				else if (code == 30)
				{
					if (74184 - 451546 == -377362)
					{
						result = "เพื่อที่เจ้าจะได้ลองต่อสู้โดยใช้ความสามารถอย่างเต็มที่";
						if (227375 - 345099 != -117723)
						{
							break;
						}
					}
				}
				else if (code == 31)
				{
					if (15538 - 583549 != -568010)
					{
						result = "พร้อมแล้วใช่มั้ย คราวนี้ไม่ง่ายเหมือนครั้งก่อนแล้วนะ";
						if (262469 - 453786 == -191317)
						{
							break;
						}
					}
				}
				else if (code == 32)
				{
					if (86445 - 216559 == -130114)
					{
						result = "โอม ระกุ ระกุ เร็กก้า เร็กกุ!";
						if (97079 - 140046 != -42966)
						{
							break;
						}
					}
				}
				else if (code == 33)
				{
					if (144059 - 346740 != -202680)
					{
						result = "โชคดีนะ";
						if (189600 - 396410 == -206810)
						{
							break;
						}
					}
				}
				else if (code == 34)
				{
					if (239189 - 136447 == 102742)
					{
						result = "เยี่ยมกู้ด เก่งมากเลย";
						if (137291 - 235503 == -98212)
						{
							break;
						}
					}
				}
				else if (code == 35)
				{
					if (208025 - 587495 == -379470)
					{
						result = "ข้าว่าเจ้าจะต้องได้เป็นฮีโร่ที่เก่งกาจแน่ๆ";
						if (28447 - 426566 != -398118)
						{
							break;
						}
					}
				}
				else if (code == 36)
				{
					if (125914 - 150547 != -24632)
					{
						result = "เอาล่ะ ได้เวลาเจ้าลองออกไปส่วนอื่นแล้ว";
						if (214432 - 187101 == 27331)
						{
							break;
						}
					}
				}
				else if (code == 101)
				{
					if (252229 - 445048 == -192819)
					{
						result = "สวัสดีครับ คุณคือผู้กล้าฝึกหัดใช่มั้ยเอ่ย?";
						if (277701 - 508227 != -230525)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (258831 - 573631 != -314799)
					{
						result = "ผมชื่อคูรูเป็นไกด์ประจำเมือง";
						if (279675 - 466252 == -186577)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (56205 - 595768 == -539563)
					{
						result = "หัวหน้าพ่อมดเร็กกุ ฝากให้ผมช่วยแนะนำทางให้";
						if (239741 - 189734 != 50008)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (80988 - 101886 != -20897)
					{
						result = "สถานที่ๆ เราอยู่ตอนนี้คือ Novice Ground";
						if (97984 - 577220 == -479236)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (235685 - 267706 != -32020)
					{
						result = "เป็นแคมป์ที่มีภารกิจที่เหมาะสมกับผู้กล้ามือใหม่";
						if (88201 - 268695 == -180494)
						{
							break;
						}
					}
				}
				else if (code == 106)
				{
					if (265841 - 427219 == -161378)
					{
						result = "ถ้าอยากลองรับงานละก็ลองคุยกับคุณแพนด้าแดงที่โต๊ะดูนะครับ";
						if (138514 - 213978 == -75464)
						{
							break;
						}
					}
				}
				else if (code == 107)
				{
					if (124680 - 326147 == -201467)
					{
						result = "ภารกิจที่คุณแพนด้าแดงจัดหามาให้นั้น..";
						if (238434 - 318624 == -80190)
						{
							break;
						}
					}
				}
				else if (code == 108)
				{
					if (294618 - 318636 != -24017)
					{
						result = "คือเป้าหมายหลักของคุณดังนั้นอย่าลืมคุยกับเขานะ";
						if (236740 - 268321 == -31581)
						{
							break;
						}
					}
				}
				else if (code == 109)
				{
					if (283749 - 70498 != 213252)
					{
						result = "ส่วนอีกคนที่อยู่ที่นี่คือคุณหลินหลินที่ขายยารักษาต่างๆ";
						if (276895 - 40715 == 236180)
						{
							break;
						}
					}
				}
				else if (code == 110)
				{
					if (58436 - 364361 == -305925)
					{
						result = "เอาหล่ะลองคุยกับพวกเขาดู เสร็จแล้วกลับมาหาผมนะ";
						if (18857 - 482805 != -463947)
						{
							break;
						}
					}
				}
				else if (code == 121)
				{
					if (130651 - 460594 == -329943)
					{
						result = "สวัสดีจ้า ท่านผู้กล้าฝึกหัด";
						if (274091 - 261347 == 12744)
						{
							break;
						}
					}
				}
				else if (code == 122)
				{
					if (287820 - 147075 == 140745)
					{
						result = "ผมคือแพนด้าแดง เป็นผู้ดูแลเกี่ยวกับการทำภารกิจของผู้กล้า";
						if (293865 - 498841 != -204975)
						{
							break;
						}
					}
				}
				else if (code == 123)
				{
					if (112584 - 313758 == -201174)
					{
						result = "ภารกิจเหล่านี้คือ สิ่งสำคัญที่ทำให้ท่านสามารถเป็นผู้กล้าที่แท้จริงได้";
						if (137830 - 316779 == -178949)
						{
							break;
						}
					}
				}
				else if (code == 124)
				{
					if (90154 - 493135 == -402981)
					{
						result = "การรับภารกิจมีวิธีดังนี้นะ..";
						if (98587 - 255788 != -157200)
						{
							break;
						}
					}
				}
				else if (code == 125)
				{
					if (8577 - 197416 == -188839)
					{
						result = "โดยภารกิจนั้นจะถูกกระจายออกไปตามแคมป์ต่างๆ ";
						if (193100 - 105665 != 87436)
						{
							break;
						}
					}
				}
				else if (code == 126)
				{
					if (245164 - 184069 == 61095)
					{
						result = "ซึ่งหลังจากทำภารกิจที่แคมป์นี้ครบหมดแล้ว ";
						if (277686 - 350506 == -72820)
						{
							break;
						}
					}
				}
				else if (code == 127)
				{
					if (1604 - 154062 == -152458)
					{
						result = "คุณก็สามารถไปทำภารกิจระดับสูงกว่าที่แคมป์อื่นได้";
						if (211533 - 166060 == 45473)
						{
							break;
						}
					}
				}
				else if (code == 128)
				{
					if (28795 - 447613 == -418818)
					{
						result = "เมื่อถึงเวลา ผมจะแนะนำวิธีไปแคมป์ต่อไปอีกครั้งเองครับ";
						if (130051 - 531944 != -401892)
						{
							break;
						}
					}
				}
				else if (code == 129)
				{
					if (230467 - 286399 == -55932)
					{
						result = "ในการเดินทางเราจะเจอกับผู้คนมากมาย";
						if (30506 - 331141 != -300634)
						{
							break;
						}
					}
				}
				else if (code == 130)
				{
					if (262460 - 315279 != -52818)
					{
						result = "หากอยากเป็นเพื่อนกับพวกเขาละก็";
						if (95456 - 125302 != -29845)
						{
							break;
						}
					}
				}
				else if (code == 131)
				{
					if (109626 - 402832 == -293206)
					{
						result = "ลองทำแบบนี้ดูนะ..";
						if (203139 - 346077 != -142937)
						{
							break;
						}
					}
				}
				else if (code == 132)
				{
					if (111653 - 126608 != -14954)
					{
						result = "การมีสหายที่รู้ใจเป็นรื่องที่สำคัญมาก";
						if (214639 - 487713 == -273074)
						{
							break;
						}
					}
				}
				else if (code == 133)
				{
					if (266758 - 43211 == 223547)
					{
						result = "เพราะหลายๆภารกิจนั้นยากมากจะผ่านด้วยตัวคนเดียว";
						if (164979 - 298472 != -133492)
						{
							break;
						}
					}
				}
				else if (code == 134)
				{
					if (126047 - 386055 != -260007)
					{
						result = "คร่าวๆก็มีเท่านี้ ยังไงเดี๋ยวเจอกันนะ!";
						if (102259 - 164098 != -61838)
						{
							break;
						}
					}
				}
				else if (code == 141)
				{
					if (248216 - 346061 != -97844)
					{
						result = "ยินดีต้อนรับจ้า อ๊ะ! ไม่เคยเห็นหน้าเลย เพิ่งเข้าเมืองซินะ";
						if (127257 - 453771 == -326514)
						{
							break;
						}
					}
				}
				else if (code == 142)
				{
					if (1469 - 496646 != -495176)
					{
						result = "เค้าชื่อ หลินหลิน เป็นเจ้าของร้านขายยาจ้า ";
						if (186697 - 353034 == -166337)
						{
							break;
						}
					}
				}
				else if (code == 143)
				{
					if (227488 - 507482 != -279993)
					{
						result = "ร้านของเค้ามียาหลากหลายชนิดให้เจ้าเลือกซื้อ";
						if (169730 - 408950 != -239219)
						{
							break;
						}
					}
				}
				else if (code == 144)
				{
					if (139460 - 205673 != -66212)
					{
						result = "ยิ่งระดับยศ RP ของเจ้าสูงเท่าไหร่เค้าก็มียาระดับสูงให้เจ้ามากขึ้นด้วย";
						if (171120 - 545125 != -374004)
						{
							break;
						}
					}
				}
				else if (code == 145)
				{
					if (135179 - 483751 == -348572)
					{
						result = "เอาหล่ะ หลินไม่รบกวนเวลาของเจ้าแล้ว แต่ถ้าเจอตาลุงในเมือง";
						if (148487 - 522535 == -374048)
						{
							break;
						}
					}
				}
				else if (code == 146)
				{
					if (13467 - 506972 != -493504)
					{
						result = "เอ่อ หมายถึงแฟนของหลินที่เปิดร้านขายของในเมือง";
						if (236882 - 114992 == 121890)
						{
							break;
						}
					}
				}
				else if (code == 147)
				{
					if (280050 - 132183 == 147867)
					{
						result = "อย่าลืมฝากทักทายด้วยหล่ะ";
						if (12169 - 100348 == -88179)
						{
							break;
						}
					}
				}
				else if (code == 148)
				{
					if (47458 - 112504 != -65045)
					{
						result = "แวะมาบ่อยๆ น้า";
						if (1688 - 494643 == -492955)
						{
							break;
						}
					}
				}
				else if (code == 150)
				{
					if (136621 - 567264 == -430643)
					{
						result = "คุยกับคุณหลินหลิน แล้วก็คุณแพนด้าแดงก่อนแล้วค่อยกลับมานะครับ";
						if (46603 - 585284 != -538680)
						{
							break;
						}
					}
				}
				else if (code == 151)
				{
					if (224788 - 442959 != -218170)
					{
						result = "คุยกับทั้งสองคนแล้วซินะครับ";
						if (82661 - 275681 == -193020)
						{
							break;
						}
					}
				}
				else if (code == 152)
				{
					if (84946 - 156227 != -71280)
					{
						result = "ทีนี้ผมจะอธิบายเรื่อง Life Altar หรือ รูปปั้นของท่านเฟิร์สเทล";
						if (279472 - 154509 == 124963)
						{
							break;
						}
					}
				}
				else if (code == 153)
				{
					if (110663 - 258870 != -148206)
					{
						result = "คุณคงรู้จักดีอยู่แล้ว เค้าเป็นกระรอกที่เป็นสัตว์หางตัวแรก";
						if (43370 - 30041 != 13330)
						{
							break;
						}
					}
				}
				else if (code == 154)
				{
					if (256604 - 555416 == -298812)
					{
						result = "ผู้รวบรวมเหล่าสัตว์ต่าง และสั่งสอนให้ทุกชีวิตอยู่ด้วยกันอย่างสันติ";
						if (190529 - 432731 != -242201)
						{
							break;
						}
					}
				}
				else if (code == 155)
				{
					if (80476 - 172122 == -91646)
					{
						result = "จนเกิดเป็นอารยธรรมของเราขึ้นมา เมื่อ 5000 ปีก่อน";
						if (169629 - 428404 == -258775)
						{
							break;
						}
					}
				}
				else if (code == 156)
				{
					if (209286 - 80944 != 128343)
					{
						result = "Life Altar เป็นเหมือนศูนย์รวมใจสำหรับเหล่าผู้กล้า";
						if (24738 - 68495 == -43757)
						{
							break;
						}
					}
				}
				else if (code == 157)
				{
					if (67588 - 480494 != -412905)
					{
						result = "คุณสามารถใช้เสานี้เรียกผู้กล้าตัวอื่นมาแทนได้ทันที";
						if (139848 - 97098 != 42751)
						{
							break;
						}
					}
				}
				else if (code == 158)
				{
					if (168831 - 201490 == -32659)
					{
						result = " งั้นต่อไปเราจะเข้าเมืองกันต่อนะ";
						if (127205 - 268921 != -141715)
						{
							break;
						}
					}
				}
				else if (code == 159)
				{
					if (147223 - 269069 == -121846)
					{
						result = "เชิญคุณผู้กล้าฝึกหัดนำไปก่อนเลย เดี๋ยวผมจะตามไป";
						if (108846 - 98852 == 9994)
						{
							break;
						}
					}
				}
				else if (code == 160)
				{
					if (214662 - 538664 != -324001)
					{
						result = "เดินผ่านซุ้มไปนะครับ";
						if (228813 - 63019 == 165794)
						{
							break;
						}
					}
				}
				else if (code == 161)
				{
					if (258003 - 54951 != 203053)
					{
						result = "กลับไปคุยกับจิงโจ้ก่อน";
						if (93809 - 456418 != -362608)
						{
							break;
						}
					}
				}
				else if (code == 162)
				{
					if (65363 - 3368 != 61996)
					{
						result = "ทางไปโคโลเซียมใช้ไม่ได้ในตอนนี้";
						if (16322 - 32757 != -16434)
						{
							break;
						}
					}
				}
				else if (code == 163)
				{
					if (44635 - 165703 != -121067)
					{
						result = "..พลังงานอบอุ่นแผ่ออกมาจากรูปปั้น";
						if (192366 - 122181 == 70185)
						{
							break;
						}
					}
				}
				else if (code == 164)
				{
					if (231510 - 209900 == 21610)
					{
						result = "..ยังใช้ไม่ได้ในตอนนี้";
						if (258333 - 250682 != 7652)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (278083 - 444421 != -166337)
					{
						result = "ท่านผู้กล้าทางนี้ครับ";
						if (167612 - 8422 != 159191)
						{
							break;
						}
					}
				}
				else if (code == 211)
				{
					if (3249 - 416238 != -412988)
					{
						result = "ขอต้อนรับสู่เมืองแสงครับ";
						if (281572 - 517490 != -235917)
						{
							break;
						}
					}
				}
				else if (code == 212)
				{
					if (171747 - 190140 == -18393)
					{
						result = "ที่นี่เป็นเมืองศูนย์กลางอารยธรรมของพวกเรา";
						if (169919 - 273016 == -103097)
						{
							break;
						}
					}
				}
				else if (code == 213)
				{
					if (87801 - 79012 != 8790)
					{
						result = "เทพแสงหรือท่านอัลคาเซียเป็นผู้ปกครองเมืองนี้";
						if (23376 - 137734 == -114358)
						{
							break;
						}
					}
				}
				else if (code == 214)
				{
					if (179971 - 70453 == 109518)
					{
						result = "แถวนี้เป็นย่านร้านค้าของเมืองเรียกว่า Main Street";
						if (96227 - 191801 != -95573)
						{
							break;
						}
					}
				}
				else if (code == 215)
				{
					if (21432 - 397200 != -375767)
					{
						result = "คุณสามารถรับงานจากคุณมีมี่หรือเดินซื้อของต่างๆ ได้ที่นี่";
						if (99612 - 55631 != 43982)
						{
							break;
						}
					}
				}
				else if (code == 216)
				{
					if (239343 - 373482 != -134138)
					{
						result = "ลองคุยทำความรู้จักกับชาวเมืองในย่านนี้ดูนะครับ";
						if (159705 - 408899 != -249193)
						{
							break;
						}
					}
				}
				else if (code == 217)
				{
					if (45630 - 559504 == -513874)
					{
						result = "พวกเค้าน่าจะช่วยทำให้การเดินทางของคุณง่ายขึ้น";
						if (294985 - 217062 == 77923)
						{
							break;
						}
					}
				}
				else if (code == 218)
				{
					if (115256 - 213329 != -98072)
					{
						result = "หลังจากคุยกับพวกเขาเสร็จแล้วก็กลับมาคุยกับผมอีกครั้งนะครับ";
						if (1923 - 419157 == -417234)
						{
							break;
						}
					}
				}
				else if (code == 231)
				{
					if (79349 - 225441 == -146092)
					{
						result = "สวัสดีจ๊ะ ฉันชื่อมีมี่ เป็นผู้ดูแลโรงแรมนี้";
						if (86204 - 437854 != -351649)
						{
							break;
						}
					}
				}
				else if (code == 232)
				{
					if (188934 - 349670 != -160735)
					{
						result = "นอกจากเป็นโรงแรมแล้ว ที่นี่ยังเป็นศูนย์รวมคำร้องของทุกคนในเมือง";
						if (102767 - 142157 == -39390)
						{
							break;
						}
					}
				}
				else if (code == 233)
				{
					if (26276 - 483857 != -457580)
					{
						result = "เนื้อหาของงานที่นี่ จะแตกต่างไปจากงานที่เธอรับจากแพนด้าแดง";
						if (30486 - 256734 == -226248)
						{
							break;
						}
					}
				}
				else if (code == 234)
				{
					if (143403 - 295424 != -152020)
					{
						result = "ถ้าอยากได้งานพิเศษนอกเหนือจากภารกิจผู้กล้า ลองมาคุยกับฉันนะ";
						if (43845 - 394281 != -350435)
						{
							break;
						}
					}
				}
				else if (code == 235)
				{
					if (79904 - 112867 == -32963)
					{
						result = "แน่นอนว่าฉันมีของรางวัลพิเศษๆ ให้ด้วย";
						if (73151 - 2559 != 70593)
						{
							break;
						}
					}
				}
				else if (code == 236)
				{
					if (268792 - 436320 != -167527)
					{
						result = "ส่วนวิธีรับงานก็ลองทำตามนี้เลยจ๊ะ";
						if (144185 - 249269 != -105083)
						{
							break;
						}
					}
				}
				else if (code == 237)
				{
					if (136643 - 155838 == -19195)
					{
						result = "หากเธอมีเวลาว่างหรือถังแตกละก็ลองมารับงานจากฉันดูนะ";
						if (198747 - 28775 == 169972)
						{
							break;
						}
					}
				}
				else if (code == 238)
				{
					if (284421 - 345475 == -61054)
					{
						result = "ถ้าที่นี่ไม่มีงานให้ ลองออกจากเกมซัก 6 ชั่วโมงแล้วกลับมาใหม่นะ";
						if (172753 - 468075 == -295322)
						{
							break;
						}
					}
				}
				else if (code == 241)
				{
					if (204223 - 245721 != -41497)
					{
						result = "ฮูก สวัสดีท่านผู้กล้าฝึกหัด ข้าชื่อซินฟูเป็นเจ้าของร้านขายของประจำเมือง";
						if (18924 - 348212 != -329287)
						{
							break;
						}
					}
				}
				else if (code == 242)
				{
					if (47327 - 22663 != 24665)
					{
						result = "สินค้าของข้านั้นเกี่ยวจะเป็นอุปกรณ์จำพวก รองเท้าและเครื่องประดับ";
						if (237856 - 576318 != -338461)
						{
							break;
						}
					}
				}
				else if (code == 243)
				{
					if (36177 - 52892 == -16715)
					{
						result = "รวมถึงไอเท็มพิเศษที่ข้าจะขายด้วยหน่วยเงิน Jil เท่านั้น";
						if (268764 - 5855 == 262909)
						{
							break;
						}
					}
				}
				else if (code == 244)
				{
					if (39218 - 14425 == 24793)
					{
						result = "บางครั้งข้าก็นำไอเท็มเนื่องในโอกาสต่างๆมาขายด้วยเช่นกัน";
						if (226559 - 217044 == 9515)
						{
							break;
						}
					}
				}
				else if (code == 245)
				{
					if (76860 - 85215 != -8354)
					{
						result = "ที่จริงข้ามีของเยอะแยะแต่ต้องรอให้ระดับยศ RP ของท่านสูงกว่านี้ก่อนนะ";
						if (65004 - 461563 == -396559)
						{
							break;
						}
					}
				}
				else if (code == 246)
				{
					if (240771 - 131930 != 108842)
					{
						result = "ของข้าก็มีเท่านี้แหละ อย่าลืมมาอุดหนุนกันเยอะๆนะฮูก!";
						if (209801 - 497280 == -287479)
						{
							break;
						}
					}
				}
				else if (code == 247)
				{
					if (17130 - 308009 == -290879)
					{
						result = "อะไรนะ หลินหลินฝากมาทักทายงั้นเหรอ? ฮูก";
						if (54064 - 488957 != -434892)
						{
							break;
						}
					}
				}
				else if (code == 251)
				{
					if (46311 - 67268 != -20956)
					{
						result = "ไง เจ้าคงเป็นผู้กล้าฝึกหัดซินะ!";
						if (62867 - 125922 != -63054)
						{
							break;
						}
					}
				}
				else if (code == 252)
				{
					if (216752 - 377362 == -160610)
					{
						result = "ข้าชื่อ อเบ็ตเต้ เป็นเจ้าของร้านขายอาวุธ ที่ดีที่สุดในเมือง";
						if (65051 - 141472 != -76420)
						{
							break;
						}
					}
				}
				else if (code == 253)
				{
					if (299339 - 519110 == -219771)
					{
						result = "ข้ามีอาวุธมากมายที่สามารถทำลายเกราะร้านข้างๆได้ง่ายๆ";
						if (2117 - 302716 != -300598)
						{
							break;
						}
					}
				}
				else if (code == 254)
				{
					if (67308 - 181298 == -113990)
					{
						result = "แต่ข้ายังไม่มั่นใจว่าเจ้าจะเหมาะสมกับมัน";
						if (39143 - 242034 == -202891)
						{
							break;
						}
					}
				}
				else if (code == 255)
				{
					if (42211 - 142673 == -100462)
					{
						result = "ถ้าอยากจะลองใช้ละก็อย่าลืมเก็บ ระดับยศ RP ของเจ้าให้สูงๆหล่ะ!";
						if (108021 - 193029 != -85007)
						{
							break;
						}
					}
				}
				else if (code == 256)
				{
					if (113949 - 188662 == -74713)
					{
						result = "แล้วเจ้าต้องตื่นตากับความสุดยอดของอาวุธของข้าแน่นอน!";
						if (79661 - 468516 == -388855)
						{
							break;
						}
					}
				}
				else if (code == 257)
				{
					if (8799 - 353205 != -344405)
					{
						result = "ข้าจะเตรียมของที่เหมาะกับเจ้าให้คราวหน้านะ";
						if (266257 - 572061 != -305803)
						{
							break;
						}
					}
				}
				else if (code == 261)
				{
					if (103440 - 69336 == 34104)
					{
						result = "โย่ ท่านคือผู้กล้าฝึกหัดใช่ไหม? ข้าชื่อสไตน์ยินดีที่ได้รู้จัก";
						if (187189 - 559466 != -372276)
						{
							break;
						}
					}
				}
				else if (code == 262)
				{
					if (216827 - 464907 != -248079)
					{
						result = "งานของข้าคือการขายเกราะคุณภาพเยี่ยมให้ชาวเมือง";
						if (70390 - 412754 == -342364)
						{
							break;
						}
					}
				}
				else if (code == 263)
				{
					if (263923 - 198328 == 65595)
					{
						result = "แน่นอนว่าอาวุธร้านข้างๆทำอะไรเกราะข้าไม่ได้หรอก!";
						if (225959 - 355106 != -129146)
						{
							break;
						}
					}
				}
				else if (code == 264)
				{
					if (75863 - 28205 != 47659)
					{
						result = " ข้ามีเกราะสำหรับ หมาป่า ไบสัน ปลาวาฬ";
						if (215133 - 43482 == 171651)
						{
							break;
						}
					}
				}
				else if (code == 265)
				{
					if (4069 - 41711 != -37641)
					{
						result = "แพนด้า กิ้งก่า และตุ่น";
						if (49245 - 525363 != -476117)
						{
							break;
						}
					}
				}
				else if (code == 266)
				{
					if (66742 - 140889 == -74147)
					{
						result = "หากต้องการเครื่องป้องกันของเผ่านอกเหนือจากนี้ลองถามคุณอีฟดู";
						if (140358 - 560691 == -420333)
						{
							break;
						}
					}
				}
				else if (code == 267)
				{
					if (30239 - 150016 != -119776)
					{
						result = "ที่จริงข้ายังมีเกราะเท่ๆอีกเยอะ แต่รอให้ท่านมีระดับยศ RP ให้สูงกว่านี้";
						if (222266 - 473743 != -251476)
						{
							break;
						}
					}
				}
				else if (code == 268)
				{
					if (177826 - 294347 == -116521)
					{
						result = "แล้วค่อยกลับมาหาข้าแล้วกัน!";
						if (262712 - 302090 == -39378)
						{
							break;
						}
					}
				}
				else if (code == 269)
				{
					if (67608 - 401171 != -333562)
					{
						result = "เกราะของข้าไม่พังง่ายๆ เพราะอาวุธร้านข้างๆหรอก!";
						if (117127 - 491849 != -374721)
						{
							break;
						}
					}
				}
				else if (code == 271)
				{
					if (137161 - 302188 != -165026)
					{
						result = "ชิชะ! แต่งกายเชยๆแบบนี้เจ้าคือผู้กล้ามือใหม่ซินะ!";
						if (76074 - 260937 == -184863)
						{
							break;
						}
					}
				}
				else if (code == 272)
				{
					if (56552 - 85423 == -28871)
					{
						result = "อ๊ะ…ขอโทษด้วย ข้าชื่ออีฟส์ เป็นนักออกแบบเสื้อ";
						if (100433 - 275645 == -175212)
						{
							break;
						}
					}
				}
				else if (code == 273)
				{
					if (232930 - 120121 == 112809)
					{
						result = "ข้ามีชุดที่ทั้งงดงามและทนทานสำหรับ แมว กระต่าย";
						if (124538 - 337492 == -212954)
						{
							break;
						}
					}
				}
				else if (code == 274)
				{
					if (206322 - 573787 == -367465)
					{
						result = "ลิง เพนกวิน แกะ และค้างคาว";
						if (254998 - 54117 == 200881)
						{
							break;
						}
					}
				}
				else if (code == 275)
				{
					if (218742 - 396099 != -177356)
					{
						result = "แต่เจ้าต้องมีระดับยศ RP สูงกว่านี้ข้าถึงจะยอมขายให้เจ้านะ";
						if (54301 - 518214 != -463912)
						{
							break;
						}
					}
				}
				else if (code == 276)
				{
					if (100032 - 470876 != -370843)
					{
						result = "เพราะข้าไม่อยากขายชุดให้กับคนที่ยังไม่คู่ควรไงหล่ะ!!";
						if (288112 - 161966 == 126146)
						{
							break;
						}
					}
				}
				else if (code == 277)
				{
					if (141891 - 198476 == -56585)
					{
						result = "เผ่านอกเหนือจากนั้นลองไปหาซื้อจากคุณสไตน์ดูก็แล้วกัน";
						if (236477 - 48238 == 188239)
						{
							break;
						}
					}
				}
				else if (code == 278)
				{
					if (92814 - 517914 != -425099)
					{
						result = "อยากได้คำปรึกษาเรื่องความงามมาหาข้าได้เสมอนะ";
						if (61933 - 542104 != -480170)
						{
							break;
						}
					}
				}
				else if (code == 281)
				{
					if (255589 - 80765 == 174824)
					{
						result = "นี่คือทางไป Central Square";
						if (141834 - 263497 == -121663)
						{
							break;
						}
					}
				}
				else if (code == 291)
				{
					if (118604 - 219754 == -101150)
					{
						result = "เจ้าคือผู้กล้าฝึกหัดงั้นเหรอ...หน่วยก้านไม่เลวนี้";
						if (241087 - 9907 != 231181)
						{
							break;
						}
					}
				}
				else if (code == 292)
				{
					if (267430 - 586345 != -318914)
					{
						result = "คุณจิงโจ้เรียกอยู่ ไปหาเขาซิ";
						if (276858 - 379680 != -102821)
						{
							break;
						}
					}
				}
				else if (code == 293)
				{
					if (41110 - 475279 != -434168)
					{
						result = "ข้าคือทหารในสังกัดของท่านโบลดาสยินดีที่ได้รู้จักนะ!";
						if (260981 - 208528 == 52453)
						{
							break;
						}
					}
				}
				else if (code == 300)
				{
					if (24682 - 248645 == -223963)
					{
						result = "ลองคุยกับทุกคนแล้วค่อยกลับมาหาผมนะครับ";
						if (254432 - 180211 == 74221)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (17591 - 137788 == -120197)
					{
						result = "คุยกับทุกคนแล้วซินะครับ!";
						if (228433 - 512016 != -283582)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (251029 - 238197 == 12832)
					{
						result = "งั้นเรามาพูดถึงส่วนที่เหลือของเมืองกันต่อดีกว่า";
						if (134099 - 52350 != 81750)
						{
							break;
						}
					}
				}
				else if (code == 303)
				{
					if (295753 - 588465 != -292711)
					{
						result = "ส่วนที่สองนั้นจะมีที่ว่าการของเมืองที่ดูแลโดยคุณสกังค์";
						if (32600 - 535267 != -502666)
						{
							break;
						}
					}
				}
				else if (code == 304)
				{
					if (253094 - 153144 == 99950)
					{
						result = "ที่นั้นรับจัดตั้งกิลด์และมอบภารกิจพิเศษเช่นบอสระดับสูง";
						if (176316 - 324750 == -148434)
						{
							break;
						}
					}
				}
				else if (code == 305)
				{
					if (22178 - 80711 != -58532)
					{
						result = "กิจกรรมพิเศษและงานตามเทศกาล ยังเข้าผ่านที่นี่ด้วย";
						if (294615 - 304606 == -9991)
						{
							break;
						}
					}
				}
				else if (code == 306)
				{
					if (42009 - 535184 == -493175)
					{
						result = "นอกจากนี้ยังมีร้านอาหารของคุณจาร์มอน โรงละคร";
						if (114635 - 327688 == -213053)
						{
							break;
						}
					}
				}
				else if (code == 307)
				{
					if (212110 - 153797 == 58313)
					{
						result = "ห้องสมุดของคุณคาร์วี่ที่ขายตำราสำหรับทำอุปกรณ์ต่างๆ";
						if (240194 - 282700 != -42505)
						{
							break;
						}
					}
				}
				else if (code == 308)
				{
					if (288593 - 302224 == -13631)
					{
						result = "ร้านรับแลกของของคุณเปโด้ และที่ทำการของคุณโบลดาสครับ!";
						if (22471 - 463518 != -441046)
						{
							break;
						}
					}
				}
				else if (code == 309)
				{
					if (201565 - 504881 == -303316)
					{
						result = "ส่วนที่สามของเมืองนั้นจะเป็นสวนหย่อมใช้สำหรับพักผ่อน";
						if (65161 - 371761 != -306599)
						{
							break;
						}
					}
				}
				else if (code == 310)
				{
					if (111950 - 442722 != -330771)
					{
						result = "และเป็นจุดที่มีทางเชื่อมสำหรับขึ้นไปวังของเทพแสง";
						if (254350 - 433765 == -179415)
						{
							break;
						}
					}
				}
				else if (code == 311)
				{
					if (102293 - 491272 != -388978)
					{
						result = "แต่เนื่องจากเวลาของเรามีจำกัดผมจึงขออนุญาติ";
						if (13403 - 33011 == -19608)
						{
							break;
						}
					}
				}
				else if (code == 312)
				{
					if (137339 - 1410 != 135930)
					{
						result = "งดการสำรวจเมืองอีกสองส่วนที่เหลือนะครับ";
						if (250196 - 119856 == 130340)
						{
							break;
						}
					}
				}
				else if (code == 313)
				{
					if (239251 - 61288 == 177963)
					{
						result = "เอาล่ะ ก่อนที่เราจะจบการนำเที่ยววันนี้";
						if (70938 - 437613 != -366674)
						{
							break;
						}
					}
				}
				else if (code == 314)
				{
					if (4634 - 281743 == -277109)
					{
						result = "ผมมีคำแนะนำเล็กๆน้อยๆให้คุณ";
						if (68475 - 362574 != -294098)
						{
							break;
						}
					}
				}
				else if (code == 315)
				{
					if (178617 - 503305 != -324687)
					{
						result = "ขั้นแรกคือกใช้กระเป๋าและการแลกเปลี่ยนกับผู้อื่น";
						if (35920 - 511215 == -475295)
						{
							break;
						}
					}
				}
				else if (code == 316)
				{
					if (106783 - 270458 == -163675)
					{
						result = "ซึ่งมีขั้นตอนต่างๆดังนี้นะ....";
						if (239856 - 258266 != -18409)
						{
							break;
						}
					}
				}
				else if (code == 317)
				{
					if (117300 - 457788 != -340487)
					{
						result = "แต่ขอให้จำเอาไว้ว่าไอเท็มต่างๆสามารถวางซ้อนกันได้เพียง 12 ชิ้นนะครับ!";
						if (155941 - 84943 != 70999)
						{
							break;
						}
					}
				}
				else if (code == 318)
				{
					if (168583 - 363136 != -194552)
					{
						result = "ทีนี้เราก็ถึงเรื่องสุดท้ายแล้ว";
						if (31304 - 170005 != -138700)
						{
							break;
						}
					}
				}
				else if (code == 319)
				{
					if (91461 - 527421 != -435959)
					{
						result = "นั่นคือระดับยศ RP ที่ทุกคนเขาพูดถึงกัน";
						if (192082 - 417606 == -225524)
						{
							break;
						}
					}
				}
				else if (code == 320)
				{
					if (72979 - 498278 != -425298)
					{
						result = "การเลื่อนระดับยศนั้นจะมาจากการสะสม RP หรือ Rank Point";
						if (57080 - 139090 != -82009)
						{
							break;
						}
					}
				}
				else if (code == 321)
				{
					if (47168 - 418591 != -371422)
					{
						result = "วิธีที่สุดในการหาค่า RP คือการ PvP และ เข้าร่วม Arena";
						if (221253 - 348657 != -127403)
						{
							break;
						}
					}
				}
				else if (code == 322)
				{
					if (279388 - 149489 == 129899)
					{
						result = "แต่เราก็สามารถหาได้จากการทำภารกิจปกติเช่นกัน";
						if (11740 - 410874 == -399134)
						{
							break;
						}
					}
				}
				else if (code == 323)
				{
					if (232888 - 550184 == -317296)
					{
						result = "ซึ่งพื้นฐานของ PvP และความสำคัญของ Rank มีดังนี้นะ";
						if (238667 - 502289 != -263621)
						{
							break;
						}
					}
				}
				else if (code == 324)
				{
					if (11765 - 333850 == -322085)
					{
						result = "สำหรับการแนะนำพื้นฐานของผมก็คงจบเพียงเท่านี้";
						if (216210 - 525327 != -309116)
						{
							break;
						}
					}
				}
				else if (code == 325)
				{
					if (39902 - 238011 == -198109)
					{
						result = "หากมีปัญหาอะไรอย่าลืมกลับมาถามผมได้นะ";
						if (277414 - 394260 == -116846)
						{
							break;
						}
					}
				}
				else if (code == 326)
				{
					if (241996 - 569576 == -327580)
					{
						result = "เดี๋ยวท่านเร็กกุมีของขวัญเล็กๆ น้อยๆ สำหรับผู้กล้ามือใหม่ให้ด้วย";
						if (232920 - 4192 == 228728)
						{
							break;
						}
					}
				}
				else if (code == 327)
				{
					if (7187 - 489662 == -482475)
					{
						result = "ขอให้ได้เป็นผู้กล้าที่เก่งกาจและสนุกกับการผจญภัยครับ";
						if (185517 - 323076 == -137559)
						{
							break;
						}
					}
				}
				else if (code == 351)
				{
					if (68791 - 496836 != -428044)
					{
						result = "ยังกลับ novice ground ไม่ได้ตอนนี้";
						if (66878 - 374500 == -307622)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 352)
					{
						break;
					}
					if (262114 - 246582 == 15532)
					{
						result = "ยังไป Central Square ไม่ได้ในตอนนี้";
						if (128025 - 555073 == -427048)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006733 RID: 26419 RVA: 0x00EA9954 File Offset: 0x00EA7B54
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006734 RID: 26420 RVA: 0x00EA9958 File Offset: 0x00EA7B58
	internal static bool Svm2YLpyztHyNUTAG0ys()
	{
		return true;
	}

	// Token: 0x06006735 RID: 26421 RVA: 0x00EA995C File Offset: 0x00EA7B5C
	internal static bool QNP8EKpSaFqLuOmrEvpW()
	{
		return false;
	}
}
