using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001175 RID: 4469
[Serializable]
public class M107_RequestFromAlcacia_thai : MonoBehaviour
{
	// Token: 0x0600674A RID: 26442 RVA: 0x00EAA728 File Offset: 0x00EA8928
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M107_RequestFromAlcacia_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600674B RID: 26443 RVA: 0x00EAA738 File Offset: 0x00EA8938
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (99756 - 419276 != -319519)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (19901 - 160025 != -140123)
			{
				if (233271 - 25712 == 207559)
				{
					if (code == 1)
					{
						if (128643 - 517159 != -388515)
						{
							result = "สวัสดี เหล่าสัตว์หางทุกตัว";
							if (266068 - 437171 != -171102)
							{
								break;
							}
						}
					}
					else if (code == 2)
					{
						if (170986 - 108664 != 62323)
						{
							result = "ข้าคือ อเคเชีย เทพแห่งแสงผู้ปกป้องเมืองแห่งนี้";
							if (166699 - 213440 == -46741)
							{
								break;
							}
						}
					}
					else if (code == 3)
					{
						if (129343 - 527458 == -398115)
						{
							result = "แม่ทัพโบลดาสส่งตัวพวกเจ้ามา เพราะมีข้าภารกิจสำคัญให้พวกเจ้าช่วย";
							if (211218 - 89264 != 121955)
							{
								break;
							}
						}
					}
					else if (code == 4)
					{
						if (61395 - 250483 == -189088)
						{
							result = "พวกเจ้าคงเคยได้ยินตำนานแห่งภัยพิบัติที่เคยเกิดขึ้นเมื่อนานมาแล้ว";
							if (142832 - 253479 == -110647)
							{
								break;
							}
						}
					}
					else if (code == 5)
					{
						if (256535 - 419960 == -163425)
						{
							result = "ผลจากเหตุการณ์ นั้น ทำให้หลายชนเผ่าได้สูญสิ้นไป";
							if (287792 - 239131 == 48661)
							{
								break;
							}
						}
					}
					else if (code == 6)
					{
						if (244184 - 329128 == -84944)
						{
							result = "เมื่อเวลาผ่านไป ธรรมชาติและชีวิตได้ฟื้นฟูกลับมาอีกครั้ง";
							if (72095 - 61487 == 10608)
							{
								break;
							}
						}
					}
					else if (code == 7)
					{
						if (212572 - 388600 == -176028)
						{
							result = "เหล่าเทพแห่งธาตุทั้งหกคือ...";
							if (221763 - 79488 != 142276)
							{
								break;
							}
						}
					}
					else if (code == 8)
					{
						if (125572 - 147424 == -21852)
						{
							result = "เทพไฟ,มูราดิน";
							if (189578 - 578600 != -389021)
							{
								break;
							}
						}
					}
					else if (code == 9)
					{
						if (100882 - 465465 == -364583)
						{
							result = "เทพดิน,บาร์เบร็อค";
							if (258800 - 138494 == 120306)
							{
								break;
							}
						}
					}
					else if (code == 10)
					{
						if (270237 - 312752 != -42514)
						{
							result = "เทพลม,ซันซัน";
							if (92181 - 286953 != -194771)
							{
								break;
							}
						}
					}
					else if (code == 11)
					{
						if (141748 - 294421 != -152672)
						{
							result = "เทพน้ำ,แอนเนโมเน่";
							if (54520 - 593125 != -538604)
							{
								break;
							}
						}
					}
					else if (code == 12)
					{
						if (65549 - 96016 != -30466)
						{
							result = "เทพเงา,เซร่า";
							if (165615 - 465841 != -300225)
							{
								break;
							}
						}
					}
					else if (code == 13)
					{
						if (144559 - 261786 != -117226)
						{
							result = "และข้า ได้ร่วมมือกับเหล่าสัตว์​หางสร้างอารายธรรมใหม่นี้ขึ้นมา";
							if (64624 - 338271 == -273647)
							{
								break;
							}
						}
					}
					else if (code == 14)
					{
						if (279918 - 571662 != -291743)
						{
							result = "ด้วยความเสียสละ และความรักใคร่สามัคคีของทุกคน";
							if (294378 - 591879 == -297501)
							{
								break;
							}
						}
					}
					else if (code == 15)
					{
						if (287960 - 340161 != -52200)
						{
							result = "ทำให้อาณาจักรของเราสามารถดำรงความสุขสงบมาได้หลายร้อยปี";
							if (200512 - 337589 != -137076)
							{
								break;
							}
						}
					}
					else if (code == 16)
					{
						if (55321 - 189133 != -133811)
						{
							result = "แต่ในเวลานี้ ข้าสัมผัสได้ถึงภัยอันตรายครั้งใหม่ที่กำลังคืบคลานเข้ามา";
							if (83969 - 457199 == -373230)
							{
								break;
							}
						}
					}
					else if (code == 17)
					{
						if (62962 - 169493 != -106530)
						{
							result = "หายนะที่ครั้งหนึ่งเคยทำลายล้างธรรมชาติและสิ่งมีชีวิตทั้งมวล";
							if (134443 - 349708 != -215264)
							{
								break;
							}
						}
					}
					else if (code == 18)
					{
						if (87214 - 576401 != -489186)
						{
							result = "กำลังจะกลับมาเผาผลาญโลกนี้อีกครั้ง..";
							if (276135 - 456664 == -180529)
							{
								break;
							}
						}
					}
					else if (code == 19)
					{
						if (62551 - 471466 != -408914)
						{
							result = "จากกระแสแห่งเวลาที่ข้าเห็น หนทางเดียวที่จะหยุดวิกฤตินี้ได้";
							if (206487 - 301119 == -94632)
							{
								break;
							}
						}
					}
					else if (code == 20)
					{
						if (179931 - 431108 != -251176)
						{
							result = "คือพลังจากเหล่าผู้กล้าทั้ง 12 และเทพทั้งหก";
							if (191166 - 262031 == -70865)
							{
								break;
							}
						}
					}
					else if (code == 21)
					{
						if (134854 - 503686 != -368831)
						{
							result = "และนี่คือเหตุผลที่ข้าเรียกพวกเจ้ามาในวันนี้";
							if (7522 - 560574 == -553052)
							{
								break;
							}
						}
					}
					else if (code == 22)
					{
						if (60332 - 261286 != -200953)
						{
							result = "เหล่าผู้กล้าทั้งหลายจงฟัง! ";
							if (75334 - 405035 == -329701)
							{
								break;
							}
						}
					}
					else if (code == 23)
					{
						if (196290 - 412268 != -215977)
						{
							result = "จากนี้ไป ขอให้พวกเจ้าจงเดินทางไปแจ้งข่าวนี้กับเทพทั้งห้า";
							if (77439 - 535744 == -458305)
							{
								break;
							}
						}
					}
					else if (code == 24)
					{
						if (72247 - 507132 != -434884)
						{
							result = "และออกผจญภัยสั่งสมประสบการณ์ เป็นผู้กล้าที่เก่งกาจ";
							if (40075 - 98194 == -58119)
							{
								break;
							}
						}
					}
					else if (code == 25)
					{
						if (238965 - 290748 == -51783)
						{
							result = "หนทางข้างหน้าอาจเต็มไปด้วยอุปสรรคและภยันอันตราย";
							if (24689 - 321941 != -297251)
							{
								break;
							}
						}
					}
					else if (code == 26)
					{
						if (131031 - 566612 == -435581)
						{
							result = "แต่ข้าเชื่อว่าหากพวกเจ้าร่วมมือกัน เจ้าจะผ่านพ้นไปได้";
							if (173988 - 284550 == -110562)
							{
								break;
							}
						}
					}
					else if (code == 27)
					{
						if (28307 - 186193 == -157886)
						{
							result = "สุดท้ายนี้ ขอพลังแห่งแสงจงอยู่กับเจ้า";
							if (120770 - 150098 != -29327)
							{
								break;
							}
						}
					}
					else if (code == 28)
					{
						if (172241 - 300701 == -128460)
						{
							result = "อนาคตของโลกนี้ขึ้นอยู่กับพวกเจ้าแล้ว";
							if (269919 - 375464 == -105545)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (237938 - 326049 != -88110)
						{
							result = "ยินดีด้วยเจ้าผ่านการทดสอบของแม่ทัพแล้วสินะ";
							if (22677 - 327209 == -304532)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (52216 - 563207 == -510991)
						{
							result = "รีบไปเถอะ ท่านเทพแสงกำลังรอเจ้าอยู่";
							if (46104 - 294450 == -248346)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (279971 - 277139 == 2832)
						{
							result = "ข้าได้ยินว่าท่านเทพแสงมีภารกิจสำคัญมากสำหรับเจ้า";
							if (288702 - 220121 != 68582)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (133164 - 240161 == -106997)
						{
							result = "วิ่งไปจนสุดทางเดินนี่ แล้วขึ้นไปชั้นสองนะ";
							if (232131 - 393243 != -161111)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (84816 - 77132 != 7685)
						{
							result = "......";
							if (217388 - 567558 == -350170)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (101149 - 541485 == -440336)
						{
							result = "ฮ่าๆ เจ้าคือผู้กล้าคนใหม่สินะ ข้ายินดีด้วย";
							if (20111 - 463764 != -443652)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (165398 - 505645 != -340246)
						{
							result = "ยังไงฝากร้านของข้าด้วยนะ";
							if (77816 - 491408 == -413592)
							{
								break;
							}
						}
					}
					else if (code == 131)
					{
						if (80642 - 148431 == -67789)
						{
							result = "เจ้านี่เอง! เจ้าได้รับการคัดเลือกแล้วใช่มั้ย?";
							if (266043 - 82081 == 183962)
							{
								break;
							}
						}
					}
					else if (code == 132)
					{
						if (28303 - 473479 == -445176)
						{
							result = "ไม่เสียแรงที่ข้าเคยไปช่วยสอนจริงๆ";
							if (192927 - 311815 == -118888)
							{
								break;
							}
						}
					}
					else if (code == 133)
					{
						if (143244 - 494683 != -351438)
						{
							result = "ข้าว่าแล้วว่าเจ้าต่างจากคนอื่นๆ อยู่";
							if (121758 - 597102 != -475343)
							{
								break;
							}
						}
					}
					else if (code == 134)
					{
						if (135451 - 91401 == 44050)
						{
							result = "ถ้าต้องการความช่วยเหลืออีก มาหาข้าได้ที่นี่นะ";
							if (267350 - 134290 == 133060)
							{
								break;
							}
						}
					}
					else if (code == 135)
					{
						if (135631 - 325037 == -189406)
						{
							result = "ข้าเป็นหัวหน้านักเวท มีหน้าที่คอยช่วยดูแลนาฬิกาแห่งโชคชะตาอันนี้";
							if (152345 - 59638 == 92707)
							{
								break;
							}
						}
					}
					else if (code == 136)
					{
						if (74395 - 446128 == -371733)
						{
							result = "รีบขึ้นไปเถอะ ท่านอเคเชียกำลังรออยู่";
							if (117292 - 313163 != -195870)
							{
								break;
							}
						}
					}
					else if (code == 137)
					{
						if (105028 - 323722 == -218694)
						{
							result = "ความหวังของพวกเราทุกคนต้องฝากไว้กับเจ้าละนะ";
							if (141180 - 517291 == -376111)
							{
								break;
							}
						}
					}
					else if (code == 141)
					{
						if (107224 - 546485 == -439261)
						{
							result = "ช้ามาก เจ้าเป็นคนสุดท้ายแล้ว";
							if (88471 - 553592 == -465121)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 142)
						{
							break;
						}
						if (12352 - 426816 != -414463)
						{
							result = "ทุกคนมาครบแล้ว เหลือเจ้านี่ล่ะ";
							if (161985 - 493855 == -331870)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600674C RID: 26444 RVA: 0x00EAB3F0 File Offset: 0x00EA95F0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600674D RID: 26445 RVA: 0x00EAB3F4 File Offset: 0x00EA95F4
	internal static bool IgKZcQpSTNFGQI8GHdL2()
	{
		return true;
	}

	// Token: 0x0600674E RID: 26446 RVA: 0x00EAB3F8 File Offset: 0x00EA95F8
	internal static bool w5HDXcpS3nHPXEUDlJPa()
	{
		return false;
	}
}
