using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200117A RID: 4474
[Serializable]
public class M207_TroublingGiant_thai : MonoBehaviour
{
	// Token: 0x06006763 RID: 26467 RVA: 0x00EABDAC File Offset: 0x00EA9FAC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M207_TroublingGiant_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006764 RID: 26468 RVA: 0x00EABDBC File Offset: 0x00EA9FBC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (7810 - 419636 != -411825)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (156050 - 494048 != -337997 && 177027 - 222932 != -45904)
			{
				if (code == 101)
				{
					if (110746 - 173210 == -62464)
					{
						result = "แย่ล่ะสิ...";
						if (47659 - 298080 == -250421)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (54537 - 218581 != -164043)
					{
						result = "จู่ๆ เทพดินบาร์เบร็อคก็เดินลงมาจากป่าทางเหนือ";
						if (279911 - 336098 != -56186)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (38083 - 46211 == -8128)
					{
						result = "ปกติไม่เคยเห็นท่านเดินลงมาถึงที่นี่";
						if (141414 - 384224 == -242810)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (101201 - 177420 != -76218)
					{
						result = "ข้าสงสัยว่าจะต้องเกิดอะไรผิดปกติขึ้นทางเหนือรึเปล่า?";
						if (184983 - 51029 == 133954)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (95041 - 74678 == 20363)
					{
						result = "...โฮม...";
						if (245386 - 189588 != 55799)
						{
							break;
						}
					}
				}
				else if (code == 106)
				{
					if (76029 - 439137 == -363108)
					{
						result = "ปัญหาคือถ้าเทพดินเดินต่อไปจนถึงเมืองแสงทางทิศใต้ละก็";
						if (282515 - 428534 == -146019)
						{
							break;
						}
					}
				}
				else if (code == 107)
				{
					if (145943 - 108727 == 37216)
					{
						result = "จะมีไร่แครอนและพืชผักอื่นๆ มากมายที่ถูกเหยียบเสียหายแน่ๆ";
						if (245742 - 533207 != -287464)
						{
							break;
						}
					}
				}
				else if (code == 108)
				{
					if (184068 - 505350 == -321282)
					{
						result = "เจ้าช่วยไปคุยกับเทพดินแทนพวกข้าหน่อยได้มั้ย";
						if (177044 - 358200 != -181155)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (78533 - 173625 == -95092)
					{
						result = "หยุดก่อนท่านเทพดินบาร์เบร็อค";
						if (228813 - 373828 != -145014)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (159488 - 155945 != 3544)
					{
						string type = CharacterData.current.Type;
						if (56208 - 227312 == -171104)
						{
							if (type == "Wolf")
							{
								if (99932 - 480403 != -380470)
								{
									result = "ได้โปรดหยุดฟังพวกข้าก่อน!";
									if (78945 - 80258 != -1312)
									{
										break;
									}
								}
							}
							else if (type == "Rabbit")
							{
								if (139656 - 511598 != -371941)
								{
									result = "ได้โปรดหยุดฟังพวกหนูก่อน!";
									if (252843 - 461651 != -208807)
									{
										break;
									}
								}
							}
							else if (type == "Mole")
							{
								if (110839 - 366430 != -255590)
								{
									result = "ได้โปรดหยุดฟังพวกเราก่อน ตุ่น!";
									if (297090 - 19928 == 277162)
									{
										break;
									}
								}
							}
							else if (type == "Monkey")
							{
								if (3999 - 518211 != -514211)
								{
									result = "ได้โปรดหยุดฟังพวกเราก่อน เจี๊ยก!";
									if (296327 - 414152 == -117825)
									{
										break;
									}
								}
							}
							else if (type == "Penguin")
							{
								if (99029 - 164291 == -65262)
								{
									result = "ได้โปรดหยุดฟังพวกเราก่อน กวิ้น!";
									if (171092 - 485240 != -314147)
									{
										break;
									}
								}
							}
							else
							{
								if (type == "Sheep")
								{
									if (293982 - 349233 == -55250)
									{
										continue;
									}
								}
								else if (type == "Bat")
								{
									if (75990 - 187887 == -111896)
									{
										continue;
									}
								}
								else
								{
									result = "ได้โปรดหยุดฟังพวกข้าก่อน";
									if (32600 - 200103 != -167503)
									{
										continue;
									}
									break;
								}
								result = "ได้โปรดหยุดฟังพวกฉันก่อน!";
								if (104895 - 513990 == -409095)
								{
									break;
								}
							}
						}
					}
				}
				else if (code == 203)
				{
					if (222100 - 98858 == 123242)
					{
						result = ".....โฮม~มมมม...";
						if (235775 - 154323 != 81453)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (112588 - 134258 != -21669)
					{
						result = "...ห-ลี-ก-ไ-ป ...เ-จ้-า-พ-ว-ก-ตั-ว-จ้-อ-ย..";
						if (262450 - 87231 == 175219)
						{
							break;
						}
					}
				}
				else if (code == 205)
				{
					if (112235 - 96295 != 15941)
					{
						result = "ข้-า-มี-เ-รื่-อ-ง-ต้-อ-ง-คุ-ย-กั-บ-อั-ล-ค-า-เ-ซี-ย..";
						if (267295 - 321424 == -54129)
						{
							break;
						}
					}
				}
				else if (code == 206)
				{
					if (83339 - 72410 != 10930)
					{
						result = "งั้นท่านยิ่งควรหยุดฟังพวกเราก่อน ท่านเทพดินผู้ยิ่งใหญ่";
						if (268004 - 178431 == 89573)
						{
							break;
						}
					}
				}
				else if (code == 207)
				{
					if (125220 - 64503 != 60718)
					{
						string type2 = CharacterData.current.Type;
						if (27033 - 401507 != -374473)
						{
							if (!(type2 == "Rabbit"))
							{
								if (type2 == "Mole")
								{
									if (17510 - 257757 != -240247)
									{
										continue;
									}
								}
								else if (type2 == "Monkey")
								{
									if (15438 - 321877 == -306438)
									{
										continue;
									}
								}
								else if (type2 == "Penguin")
								{
									if (270716 - 322790 == -52073)
									{
										continue;
									}
								}
								else if (type2 == "Sheep")
								{
									if (49630 - 513648 != -464018)
									{
										continue;
									}
								}
								else if (type2 == "Bat")
								{
									if (284599 - 52810 != 231789)
									{
										continue;
									}
								}
								else
								{
									result = "ท่านเทพแสงอเคเชียให้พวกข้าเป็นตัวแทนมาส่งสาส์นให้ท่าน";
									if (66816 - 352699 != -285882)
									{
										break;
									}
									continue;
								}
								IL_1C0:
								result = "ท่านเทพแสงอเคเชียให้พวกเราเป็นตัวแทนมาส่งสาส์นให้ท่าน";
								if (57366 - 74781 != -17415)
								{
									continue;
								}
								break;
								IL_C54:
								goto IL_1C0;
								IL_AFC:
								goto IL_C54;
								goto IL_AFC;
							}
							if (251705 - 179096 == 72609)
							{
								result = "ท่านเทพแสงอเคเชียให้พวกหนูเป็นตัวแทนมาส่งสาส์นให้ท่าน";
								if (77655 - 513246 == -435591)
								{
									break;
								}
							}
						}
					}
				}
				else if (code == 208)
				{
					if (122794 - 267688 == -144894)
					{
						result = "...โฮม... อั-ล-ค-า-เ-ซี-ย-?...";
						if (133231 - 224450 != -91218)
						{
							break;
						}
					}
				}
				else if (code == 209)
				{
					if (139985 - 304077 == -164092)
					{
						result = "ท่านเทพแสงได้ทำนายว่าเหตุการณ์ร้ายครั้งสำคัญกำลังใกล้เข้ามาแล้ว";
						if (79641 - 348526 == -268885)
						{
							break;
						}
					}
				}
				else if (code == 210)
				{
					if (152291 - 257508 == -105217)
					{
						result = "ท่านอยากให้ท่านเทพดินและเทพธรรมชาติทั้งหกร่วมมือกัน..";
						if (221686 - 360487 != -138800)
						{
							break;
						}
					}
				}
				else if (code == 211)
				{
					if (266212 - 148492 != 117721)
					{
						result = "ใ-ก-ล้-เ-ข้-า-ม-า-!? ..โฮมมมมมมม!!!!";
						if (39578 - 349729 == -310151)
						{
							break;
						}
					}
				}
				else if (code == 212)
				{
					if (234010 - 505082 != -271071)
					{
						result = "สิ่-ง-ชั่-ว-ร้-า-ย-จ-ำ-น-ว-น-ม-ห-า-ศ-า-ล-ไ-ด้-ท-ย-อ-ย";
						if (204941 - 550997 == -346056)
						{
							break;
						}
					}
				}
				else if (code == 213)
				{
					if (4300 - 443919 != -439618)
					{
						result = "ตื่-น-ขึ้-น-จ-า-ก-ก-า-ร-ห-ลั-บ-ไ-ห-ล-ทุ-ก-ห-น-ทุ-ก-แ-ห่-ง";
						if (160035 - 503743 == -343708)
						{
							break;
						}
					}
				}
				else if (code == 214)
				{
					if (71435 - 124487 != -53051)
					{
						result = "บ-น-อี-ก-ฝั่-ง-ข-อ-ง-แ-ผ-ล-แ-ห่-ง-โ-ล-ก-แ-ล้-ว";
						if (247555 - 167938 == 79617)
						{
							break;
						}
					}
				}
				else if (code == 215)
				{
					if (145625 - 198658 == -53033)
					{
						result = "!!?";
						if (100656 - 25404 != 75253)
						{
							break;
						}
					}
				}
				else if (code == 216)
				{
					if (70037 - 174550 != -104512)
					{
						result = ".....โฮม~มมมม...";
						if (266194 - 466899 == -200705)
						{
							break;
						}
					}
				}
				else if (code == 217)
				{
					if (298589 - 85102 != 213488)
					{
						result = "ข้-า-รู้-สึ-ก-ไ-ด้ ...ป่-า-ข-อ-ง-ข้-า-ก-ำ-ลั-ง-ห-ว-า-ด-ก-ลั-ว";
						if (289777 - 204736 != 85042)
						{
							break;
						}
					}
				}
				else if (code == 218)
				{
					if (36956 - 522982 != -486025)
					{
						result = "ใ-น-ไ-ม่-ช้-า-พ-ว-ก-มั-น-จ-ะ-รุ-ก-ร-า-น-ข้-า-ม-ม-า-ทำ-ล-า-ย";
						if (58909 - 234960 != -176050)
						{
							break;
						}
					}
				}
				else if (code == 219)
				{
					if (68335 - 110067 == -41732)
					{
						result = "ทุ-ก-สิ่-ง-ใ-น-ป่-า-ข-อ-ง-ข้-า... โฮมมมมมมม!";
						if (99177 - 560503 != -461325)
						{
							break;
						}
					}
				}
				else if (code == 220)
				{
					if (287591 - 407411 != -119819)
					{
						result = "... (นี่จะต้องเป็นเหตุการณ์ร้ายที่ท่านอเคเชียพูดถึงแน่ๆ)";
						if (237497 - 278047 != -40549)
						{
							break;
						}
					}
				}
				else if (code == 221)
				{
					if (208788 - 95141 != 113648)
					{
						result = "ข้าจะให้พวกทหารเสือนำข่าวนี้ไปบอกท่านเทพแสงโดยเร็วที่สุด";
						if (223044 - 223537 != -492)
						{
							break;
						}
					}
				}
				else if (code == 222)
				{
					if (279872 - 581044 == -301172)
					{
						result = "เชื่อว่าท่านอเคเชียจะต้องคาดการณ์และเตรียมแผนรับมือไว้แล้วแน่ๆ";
						if (157739 - 565648 == -407909)
						{
							break;
						}
					}
				}
				else if (code == 223)
				{
					if (194194 - 579306 != -385111)
					{
						result = "ตอนนี้ขอท่านเทพดินบาร์เบร็อคจงถอยกลับไปก่อนเถิด";
						if (283512 - 540639 == -257127)
						{
							break;
						}
					}
				}
				else if (code == 224)
				{
					if (12238 - 319522 != -307283)
					{
						result = "หากท่านเดินหน้าต่อไปจะมีชาวบ้านมากมายได้รับความเดือดร้อน";
						if (63036 - 419861 != -356824)
						{
							break;
						}
					}
				}
				else if (code == 225)
				{
					if (222339 - 512477 == -290138)
					{
						result = "นอกจากนี้ ถ้าเกิดเหตุร้ายอะไรขึ้นจริงๆ...";
						if (92116 - 87747 != 4370)
						{
							break;
						}
					}
				}
				else if (code == 226)
				{
					if (174706 - 8457 == 166249)
					{
						result = "ป่าของท่านยังต้องการพลังของท่านเทพดินช่วยปกป้อง";
						if (271649 - 512332 == -240683)
						{
							break;
						}
					}
				}
				else if (code == 227)
				{
					if (85359 - 513456 != -428096)
					{
						result = "ส่วนพวกเราจะรีบส่งความช่วยเหลือไปโดยเร็วที่สุดอย่างแน่นอน";
						if (92847 - 448850 == -356003)
						{
							break;
						}
					}
				}
				else if (code == 228)
				{
					if (15887 - 350304 == -334417)
					{
						result = ".....โฮม~มมมม...";
						if (220044 - 456204 != -236159)
						{
							break;
						}
					}
				}
				else if (code == 229)
				{
					if (133377 - 543018 == -409641)
					{
						result = "... ข้-า-จ-ะ-ก-ลั-บ-ไ-ป-พิ-ทั-ก-ษ์-ป่-า-ข-อ-ง-ข้-า";
						if (121918 - 374414 != -252495)
						{
							break;
						}
					}
				}
				else if (code == 230)
				{
					if (258974 - 595876 == -336902)
					{
						result = "หวั-ง-ว่-า-อัล-ค-า-เ-ซี-ย-มี-ท-า-ง-อ-อ-ก-ส-ำ-ห-รั-บ-เ-รื่-อ-ง-นี้";
						if (153692 - 416088 != -262395)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (47769 - 370588 == -322819)
					{
						result = "เทพดินเป็นเจ้าแห่งป่าเขาทางเหนือ ให้ความเคารพด้วยล่ะ";
						if (259594 - 561764 != -302169)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 302)
					{
						break;
					}
					if (184308 - 251103 == -66795)
					{
						result = "ข้าไม่ไปหรอก ข้ากลัวโดนเหยียบ";
						if (213455 - 69242 == 144213)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006765 RID: 26469 RVA: 0x00EACD5C File Offset: 0x00EAAF5C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006766 RID: 26470 RVA: 0x00EACD60 File Offset: 0x00EAAF60
	internal static bool aXyXMxpSyW8yA81qnYLm()
	{
		return true;
	}

	// Token: 0x06006767 RID: 26471 RVA: 0x00EACD64 File Offset: 0x00EAAF64
	internal static bool XjfvjOpSSY4K17wn57hp()
	{
		return false;
	}
}
