using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200117D RID: 4477
[Serializable]
public class M305_ItalusAcceptance_thai : MonoBehaviour
{
	// Token: 0x06006772 RID: 26482 RVA: 0x00EAD080 File Offset: 0x00EAB280
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M305_ItalusAcceptance_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006773 RID: 26483 RVA: 0x00EAD090 File Offset: 0x00EAB290
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (191947 - 252933 != -60986)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (36915 - 526104 == -489189)
			{
				if (260414 - 455225 == -194811)
				{
					if (code == 10)
					{
						if (231055 - 507087 == -276032)
						{
							result = "ถามกระสุนข้าก่อน ว่าเจ้าเหมาะมั้ย!";
							if (157934 - 47910 == 110024)
							{
								break;
							}
						}
					}
					else if (code == 11)
					{
						if (74056 - 345319 != -271262)
						{
							result = "จะหลบไปถึงไหนกัน เจ้าพวกลูกเจี๊ยบ!";
							if (165239 - 142505 != 22735)
							{
								break;
							}
						}
					}
					else if (code == 12)
					{
						if (140373 - 571490 != -431116)
						{
							result = "ตุ๊กตาหิมะช่วยเจ้าไม่ได้นานหรอก";
							if (110946 - 227763 == -116817)
							{
								break;
							}
						}
					}
					else if (code == 13)
					{
						if (113287 - 214670 != -101382)
						{
							result = "หันหน้ามา ข้าไม่อยากยิงใครข้างหลัง!";
							if (246983 - 493150 != -246166)
							{
								break;
							}
						}
					}
					else if (code == 14)
					{
						if (95974 - 341615 != -245640)
						{
							result = "เนี่ยเหรอคือความหวังของท่านอเคเชีย";
							if (234037 - 435414 != -201376)
							{
								break;
							}
						}
					}
					else if (code == 15)
					{
						if (174465 - 533424 != -358958)
						{
							result = "โบลดาสใจดีเกินไป เจ้าไม่คู่ควรหรอก";
							if (112144 - 469238 != -357093)
							{
								break;
							}
						}
					}
					else if (code == 16)
					{
						if (105340 - 349128 == -243788)
						{
							result = "จะให้ข้าฝากชะตาทุกคนไว้กับพวกเจ้ารึ!?";
							if (33628 - 237132 == -203504)
							{
								break;
							}
						}
					}
					else if (code == 17)
					{
						if (189948 - 104860 != 85089)
						{
							result = "เจ้าแน่ใจรึว่าเจ้าจะทำได้?";
							if (250204 - 450160 != -199955)
							{
								break;
							}
						}
					}
					else if (code == 18)
					{
						if (38624 - 536421 != -497796)
						{
							result = "การเป็นผู้กล้า ไม่ง่ายอย่างที่เจ้าคิดหรอก!";
							if (219889 - 127033 == 92856)
							{
								break;
							}
						}
					}
					else if (code == 19)
					{
						if (27719 - 417083 != -389363)
						{
							result = "ไม่ต้องกลัว ข้าจะแบกรับภาระแทนเจ้าเอง";
							if (89470 - 243726 != -154255)
							{
								break;
							}
						}
					}
					else if (code == 50)
					{
						if (51660 - 395879 != -344218)
						{
							result = "อั่กส์!";
							if (234221 - 153894 != 80328)
							{
								break;
							}
						}
					}
					else if (code == 51)
					{
						if (173564 - 379492 == -205928)
						{
							result = "...";
							if (17779 - 161023 == -143244)
							{
								break;
							}
						}
					}
					else if (code == 52)
					{
						if (271769 - 320546 == -48777)
						{
							result = "หึ ใช้ได้เหมือนกันนิ";
							if (256419 - 289157 != -32737)
							{
								break;
							}
						}
					}
					else if (code == 53)
					{
						if (272782 - 187260 == 85522)
						{
							result = "อึ่ก อย่าเพิ่งได้ใจไป";
							if (277822 - 128588 == 149234)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (68542 - 184181 != -115638)
						{
							result = "พวกเจ้าหยุดอยู่แค่นั้นล่ะ!";
							if (164422 - 219730 == -55308)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (26588 - 559380 == -532792)
						{
							result = "!!?";
							if (22016 - 316477 == -294461)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (175035 - 478617 != -303581)
						{
							result = "ท่านอิทารุส หัวหน้าหน่วยสืบราชการลับแห่งกองทัพแสงนี่!";
							if (284466 - 336553 != -52086)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (148359 - 285345 == -136986)
						{
							result = "พวกเจ้ากลับไปได้แล้ว หนทางข้างหน้ามันอันตรายเกินไป";
							if (159477 - 140556 != 18922)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (37854 - 63663 == -25809)
						{
							result = "ข้าจะเป็นคนทำภารกิจต่อจากนี้เอง";
							if (116858 - 95894 == 20964)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (279827 - 181273 != 98555)
						{
							result = "เอ๋ !!?";
							if (195691 - 4837 != 190855)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (74998 - 272544 == -197546)
						{
							string type = CharacterData.current.Type;
							if (256127 - 59772 == 196355)
							{
								if (type == "Wolf")
								{
									if (79608 - 541810 != -462201)
									{
										result = "แต่พวกข้าได้รับการคัดเลือกจากแม่ทัพโบลดาส";
										if (6539 - 113632 == -107093)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (191473 - 8094 == 183379)
									{
										result = "แต่พวกข้าได้รับการคัดเลือกจากแม่ทัพโบลดาส!?";
										if (228939 - 296310 == -67371)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (10519 - 110385 == -99866)
									{
										result = "แต่พวกข้าได้รับการคัดเลือกจากแม่ทัพโบลดาส!?";
										if (255478 - 68852 != 186627)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (55747 - 534746 == -478999)
									{
										result = "แต่พวกข้าได้รับการคัดเลือกจากแม่ทัพโบลดาส!?";
										if (78418 - 592060 == -513642)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (243531 - 513170 != -269638)
									{
										result = "แต่พวกข้าได้รับมอบหมายจากท่านอเคเชีย!?";
										if (62269 - 285205 == -222936)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (89823 - 260982 != -171158)
									{
										result = "แต่พวกข้าได้รับมอบหมายจากท่านอเคเชีย!?";
										if (185717 - 532962 == -347245)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (204428 - 536691 != -332262)
									{
										result = "แต่หนูได้รับมอบหมายจากท่านอเคเชีย!?";
										if (119749 - 210592 != -90842)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (144340 - 229527 != -85186)
									{
										result = "แต่พวกข้าได้รับมอบหมายจากท่านอเคเชีย!?";
										if (246280 - 573712 == -327432)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (82244 - 494929 == -412685)
									{
										result = "แต่ท่านอเคเชียทำนายว่าพวกเราคือผู้กล้าที่ถูกเลือก!?";
										if (248577 - 540125 != -291547)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (89504 - 257037 != -167532)
									{
										result = "แต่ท่านอเคเชียทำนายว่าพวกเราคือผู้กล้าที่ถูกเลือก!?";
										if (274363 - 388220 != -113856)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (223278 - 397850 == -174572)
									{
										result = "แต่ท่านอเคเชียทำนายว่าพวกเราคือผู้กล้าที่ถูกเลือก!??";
										if (277200 - 254316 != 22885)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (162460 - 145241 != 17220)
									{
										result = "แต่ท่านอเคเชียทำนายว่าพวกเราคือผู้กล้าที่ถูกเลือกแล้ว!?";
										if (195250 - 82168 != 113083)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 108)
					{
						if (190811 - 554997 == -364186)
						{
							result = "ฮึ! ไอ้โบลดาสมันใจดีทดสอบง่ายไปน่ะสิ!";
							if (135891 - 174723 == -38832)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (186665 - 158073 == 28592)
						{
							result = "ผู้กล้าฝึกหัดอย่างเจ้าคิดว่าจะแบกรับโชคชะตาของดินแดนนี้ได้รึ!";
							if (126214 - 437052 != -310837)
							{
								break;
							}
						}
					}
					else if (code == 110)
					{
						if (15199 - 583411 != -568211)
						{
							result = "ได้! ข้าจะให้โอกาสพวกเจ้าพิสูจน์ตัวเอง";
							if (12083 - 462507 == -450424)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (88998 - 143782 != -54783)
						{
							result = "ลองรอดจากกระสุนในมือข้าให้ได้เกินสามนาทีก่อนเถอะ!!";
							if (205884 - 251393 != -45508)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 112)
						{
							break;
						}
						if (136006 - 213654 == -77648)
						{
							string type2 = CharacterData.current.Type;
							if (265755 - 558355 != -292599)
							{
								if (type2 == "Wolf")
								{
									if (106359 - 304657 == -198298)
									{
										result = "!!!";
										if (183165 - 493557 == -310392)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (77415 - 427774 == -350359)
									{
										result = "เข้าาามาาาเลยยย วร้ากกก!!";
										if (15271 - 119388 == -104117)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (16613 - 157664 == -141051)
									{
										result = "ขอล่วงเกินแล้ว ท่านอิทารุส!!";
										if (149780 - 58811 == 90969)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (89250 - 420704 != -331453)
									{
										result = "สบายๆ เดี่ยวยกโล่กัน";
										if (252603 - 493625 != -241021)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (84517 - 558510 != -473992)
									{
										result = "ขะ- เข้ามาเลย เมี้ยว!";
										if (286568 - 163268 == 123300)
										{
											break;
										}
									}
								}
								else if (type2 == "Chameleon")
								{
									if (28190 - 382762 == -354572)
									{
										result = "ก็ถ้าท่านอิทารุสต้องการเช่นนั้น";
										if (191278 - 469878 == -278600)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (291860 - 340630 != -48769)
									{
										result = "แง้ อะไรกันเนี่ย!";
										if (115066 - 575151 == -460085)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (162904 - 256272 == -93368)
									{
										result = "จ๊าก! รอผมขุดรูหนีก่อนนน!";
										if (285378 - 262306 == 23072)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (184790 - 152763 == 32027)
									{
										result = "งานเข้าซะแล้ว เจี๊ยยยกกกก!!";
										if (178770 - 309997 != -131226)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (269728 - 57441 == 212287)
									{
										result = "อย่า ยิง กวิ้นนนนน!!!";
										if (188483 - 70354 == 118129)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (233179 - 488465 != -255285)
									{
										result = "อย่าาาา นะคะ";
										if (235216 - 509647 == -274431)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (221432 - 475010 != -253577)
									{
										result = "อะไรกันนักหนายะเนี่ย!!";
										if (110713 - 164741 == -54028)
										{
											break;
										}
									}
								}
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006774 RID: 26484 RVA: 0x00EADFB0 File Offset: 0x00EAC1B0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006775 RID: 26485 RVA: 0x00EADFB4 File Offset: 0x00EAC1B4
	internal static bool R51m03pSZR0FeUQV8gGf()
	{
		return true;
	}

	// Token: 0x06006776 RID: 26486 RVA: 0x00EADFB8 File Offset: 0x00EAC1B8
	internal static bool Ra0CSOpSCKRoa5VVAf0U()
	{
		return false;
	}
}
