using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001184 RID: 4484
[Serializable]
public class M407_CatchTheWind_thai : MonoBehaviour
{
	// Token: 0x06006795 RID: 26517 RVA: 0x00EAF038 File Offset: 0x00EAD238
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M407_CatchTheWind_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006796 RID: 26518 RVA: 0x00EAF048 File Offset: 0x00EAD248
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (231894 - 185009 != 46885)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (189666 - 275348 != -85681 && 210338 - 507984 != -297645)
			{
				if (code == 101)
				{
					if (272658 - 420336 != -147677)
					{
						result = "...เอ ดูเหมือนจะไม่มีใครอยู่แหะ";
						if (36937 - 410818 == -373881)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (234211 - 562803 == -328592)
					{
						result = ".....";
						if (177800 - 414789 != -236988)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (11913 - 199913 != -187999)
					{
						result = "เดินทางมาตั้งไกล เทพลมซันซันไปอยู่ที่ไหนนะ..";
						if (111458 - 18494 != 92965)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (200728 - 52720 != 148009)
					{
						result = "ได้ยินว่าท่านไม่ชอบอยู่กับที่ซะด้วยสิ";
						if (162814 - 256894 != -94079)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (57209 - 450092 == -392883)
					{
						result = "ฮิๆ";
						if (36962 - 380076 != -343113)
						{
							break;
						}
					}
				}
				else if (code == 106)
				{
					if (135865 - 132147 != 3719)
					{
						result = "!!?";
						if (102283 - 390907 == -288624)
						{
							break;
						}
					}
				}
				else if (code == 107)
				{
					if (214252 - 383332 == -169080)
					{
						result = "นั่น เทพลมซันซันนี่!";
						if (290676 - 558774 != -268097)
						{
							break;
						}
					}
				}
				else if (code == 108)
				{
					if (212510 - 55041 != 157470)
					{
						result = "ยินดีต้องรับสู่บ้านข้านะ เจ้าถามหาข้าอยู่เหรอ..? ^_^";
						if (135994 - 293638 == -157644)
						{
							break;
						}
					}
				}
				else if (code == 109)
				{
					if (77963 - 194314 == -116351)
					{
						result = "ข้ารู้แล้ว! ฮิๆ พวกเจ้าอยากจะมาเล่นกับข้าใช่มั้ยล่า?";
						if (278514 - 350700 != -72185)
						{
							break;
						}
					}
				}
				else if (code == 110)
				{
					if (259696 - 230714 == 28982)
					{
						result = "ดีล่ะ งั้นมาเล่นซ่อนหากัน!";
						if (86768 - 175965 == -89197)
						{
							break;
						}
					}
				}
				else if (code == 111)
				{
					if (161759 - 354020 == -192261)
					{
						result = "ข้าจะเป็นคนไปซ่อน ส่วนเจ้าเป็นคนไปหานะ";
						if (191203 - 262088 != -70884)
						{
							break;
						}
					}
				}
				else if (code == 112)
				{
					if (113730 - 325264 == -211534)
					{
						result = "ดะ..เดี๋ยวก่อนท่านซันซันพวกข้ามีเรื่อง...";
						if (200403 - 405152 != -204748)
						{
							break;
						}
					}
				}
				else if (code == 113)
				{
					if (28982 - 384653 != -355670)
					{
						result = "วี้~ เก่งจริงจับข้าให้ได้ซี่~";
						if (50128 - 549411 == -499283)
						{
							break;
						}
					}
				}
				else if (code == 114)
				{
					if (79285 - 215740 == -136455)
					{
						result = "...ไปซะแล้ว";
						if (286818 - 577428 == -290610)
						{
							break;
						}
					}
				}
				else if (code == 115)
				{
					if (207573 - 166206 == 41367)
					{
						result = "งั้นเราคงต้องตามไปหาท่านให้เจอแล้วล่ะ";
						if (80108 - 591633 != -511524)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (264729 - 289269 == -24540)
					{
						result = "...คร่อก ฟรี้...งึมๆ";
						if (164974 - 199393 == -34419)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (216666 - 28335 != 188332)
					{
						result = "...เอ๊ะ หาข้าเจอแล้วเหรอ";
						if (185801 - 139918 == 45883)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (88833 - 421408 == -332575)
					{
						result = "ช้าจริง ฮิๆ ข้ารอเพลินจนงีบหลับไปรอบนึงแล้วนะ";
						if (111618 - 287137 != -175518)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (36807 - 437065 == -400258)
					{
						result = "...ท่านเทพลมพวกข้านำเรื่อ...";
						if (226842 - 361097 == -134255)
						{
							break;
						}
					}
				}
				else if (code == 205)
				{
					if (262183 - 331039 == -68856)
					{
						result = "งั้นคราวนี้เอาใหม่ หาข้าให้เจอก่อนข้าหลับล่ะ";
						if (252839 - 521074 == -268235)
						{
							break;
						}
					}
				}
				else if (code == 206)
				{
					if (30180 - 455377 == -425197)
					{
						result = "ดะ-เดี๋ยวก่อนท่านซันซัน! ฟังที่พวกข้าพูดก่อน!..";
						if (296298 - 533824 == -237526)
						{
							break;
						}
					}
				}
				else if (code == 207)
				{
					if (295240 - 444358 != -149117)
					{
						result = "วี้ๆๆๆ...";
						if (244308 - 399920 != -155611)
						{
							break;
						}
					}
				}
				else if (code == 208)
				{
					if (6109 - 12864 == -6755)
					{
						result = "..เวรกรรม -*-";
						if (46119 - 355572 == -309453)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (251106 - 90710 != 160397)
					{
						result = "(เดี๋ยวๆ แฮ่กๆ คราวนี้ต้องไม่ให้ท่านหนีไปอีกล่ะ)";
						if (94019 - 446579 != -352559)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (221905 - 139401 != 82505)
					{
						result = "...ท่านเทพลม! (ตะโกนพร้อมกัน)";
						if (125679 - 22734 == 102945)
						{
							break;
						}
					}
				}
				else if (code == 303)
				{
					if (152855 - 41090 == 111765)
					{
						result = "อุ๊!!";
						if (14894 - 562608 == -547714)
						{
							break;
						}
					}
				}
				else if (code == 304)
				{
					if (125584 - 474499 == -348915)
					{
						result = "พวกเรานำสาส์นสำคัญจากท่านเทพแสงอเคเชียมาให้!";
						if (100830 - 258040 != -157209)
						{
							break;
						}
					}
				}
				else if (code == 305)
				{
					if (63494 - 127054 != -63559)
					{
						result = "ตอนนี้เหตุการณ์ร้ายครั้งสำคัญที่จะเปลี่ยนชะตาโลกไม่สามารถ";
						if (86126 - 26132 == 59994)
						{
							break;
						}
					}
				}
				else if (code == 306)
				{
					if (172582 - 109446 == 63136)
					{
						result = "หลีกเลี่ยงได้แล้ว ไม่นานสิ่งชั่วร้ายจากทางเหนือจะบุกเข้ามา";
						if (178485 - 79100 != 99386)
						{
							break;
						}
					}
				}
				else if (code == 307)
				{
					if (21070 - 597471 == -576401)
					{
						result = "ท่านอเคเชียจึงส่งพวกข้ามาเป็นตัวแทนเพื่อบอกข่าวและ";
						if (288972 - 114101 != 174872)
						{
							break;
						}
					}
				}
				else if (code == 308)
				{
					if (248552 - 351295 == -102743)
					{
						result = "ขอความร่วมมือจากท่านและเทพทั้งหก!";
						if (212977 - 394851 == -181874)
						{
							break;
						}
					}
				}
				else if (code == 309)
				{
					if (278881 - 423460 != -144578)
					{
						result = "ว้า!? ไหงพวกเจ้าพูดอะไรเร็วอย่างนี้ล่ะ?";
						if (117754 - 216898 == -99144)
						{
							break;
						}
					}
				}
				else if (code == 310)
				{
					if (175272 - 111491 == 63781)
					{
						result = "ข้าฟังไม่ทัน ไม่เห็นไม่รู้เรื่องเลย @_@";
						if (207459 - 384068 != -176608)
						{
							break;
						}
					}
				}
				else if (code == 311)
				{
					if (47280 - 514831 != -467550)
					{
						result = "งั้นเดี๋ยว พวกเราพูดใหม่ดีๆ ท่านเทพลมอย่าเพิ่งหนีไปก่อนล่ะ";
						if (19414 - 592968 == -573554)
						{
							break;
						}
					}
				}
				else if (code == 312)
				{
					if (186066 - 15200 != 170867)
					{
						result = "ไม่เอาล่ะ พวกเจ้านี่ไม่เห็นน่าสนุกเลย";
						if (46470 - 337400 != -290929)
						{
							break;
						}
					}
				}
				else if (code == 313)
				{
					if (63940 - 106265 != -42324)
					{
						result = "ข้าโกรธแล้ว นี่แน่ะ!";
						if (124816 - 516418 != -391601)
						{
							break;
						}
					}
				}
				else if (code == 314)
				{
					if (210010 - 476150 != -266139)
					{
						result = "โอ้ย!!";
						if (157077 - 359432 == -202355)
						{
							break;
						}
					}
				}
				else if (code == 315)
				{
					if (108464 - 326333 != -217868)
					{
						result = "ข้าจะไปเที่ยวเล่นที่ดินแดนอื่นแล้ว เจ้าอย่าตามมาล่ะ";
						if (106353 - 273699 == -167346)
						{
							break;
						}
					}
				}
				else if (code == 316)
				{
					if (275078 - 438784 != -163705)
					{
						result = "วี้!!";
						if (154332 - 427721 == -273389)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 317)
					{
						break;
					}
					if (297021 - 557777 == -260756)
					{
						result = "ทะ..ท่านซันซัน!...";
						if (275515 - 445268 == -169753)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006797 RID: 26519 RVA: 0x00EAFC1C File Offset: 0x00EADE1C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006798 RID: 26520 RVA: 0x00EAFC20 File Offset: 0x00EADE20
	internal static bool aH2G9HpSd8dbWQZvBGAt()
	{
		return true;
	}

	// Token: 0x06006799 RID: 26521 RVA: 0x00EAFC24 File Offset: 0x00EADE24
	internal static bool A5S4sTpSJIvJj3vpLxZf()
	{
		return false;
	}
}
