using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001186 RID: 4486
[Serializable]
public class M503_TwoTurtleSages_thai : MonoBehaviour
{
	// Token: 0x0600679F RID: 26527 RVA: 0x00EAFD94 File Offset: 0x00EADF94
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M503_TwoTurtleSages_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060067A0 RID: 26528 RVA: 0x00EAFDA4 File Offset: 0x00EADFA4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (223875 - 331679 != -107804)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (272474 - 10462 != 262013)
			{
				if (198614 - 204306 == -5692)
				{
					if (code == 101)
					{
						if (123388 - 77844 == 45544)
						{
							result = "(จุดวาร์ปไปยังวิหารใต้น้ำที่ท่านเร็กกุบอกอยู่แถวนี้รึเปล่านะ?)";
							if (64479 - 25396 != 39084)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (109622 - 166203 == -56581)
						{
							result = "(อืม...ลองถามผู้เฒ่าเต่าที่อยู่ตรงนั้นดีกว่า)";
							if (223759 - 431393 == -207634)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (176618 - 411732 == -235114)
						{
							string type = CharacterData.current.Type;
							if (11424 - 97660 != -86235)
							{
								if (type == "Wolf")
								{
									if (43513 - 487715 == -444202)
									{
										result = "ท่านผู้เฒ่าทั้งสอง นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่าครับ?";
										if (240113 - 535174 == -295061)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (250369 - 124345 == 126024)
									{
										result = "ท่านผู้เฒ่า นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า?";
										if (51125 - 484636 != -433510)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (164442 - 387031 == -222589)
									{
										result = "ผู้เฒ่าเต่าๆ นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่าฮะ?";
										if (101005 - 180891 != -79885)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (149364 - 409509 == -260145)
									{
										result = "ท่านผู้เฒ่า นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า?";
										if (177491 - 151344 == 26147)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (285313 - 471941 != -186627)
									{
										result = "ท่านผู้เฒ่า นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า?";
										if (198076 - 539220 != -341143)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (287656 - 260747 == 26909)
									{
										result = "ท่านผู้เฒ่า นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า?";
										if (93276 - 18204 != 75073)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (224820 - 121948 != 102873)
									{
										result = "ท่านผู้เฒ่าจ๊ะ นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่าง่า?";
										if (160046 - 564976 != -404929)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (261763 - 457106 == -195343)
									{
										result = "ผู้เฒ่าๆ นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า?";
										if (222436 - 361514 != -139077)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (98901 - 244215 != -145313)
									{
										result = "ท่านผู้เฒ่า นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า เจี๊ยก?";
										if (198296 - 501589 != -303292)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (198367 - 425903 != -227535)
									{
										result = "ท่านผู้เฒ่า นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่า? กวินๆ?";
										if (184739 - 12599 != 172141)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (164240 - 127278 != 36963)
									{
										result = "ท่านผู้เฒ่าทั้งสอง นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่าคะ?";
										if (271124 - 218758 != 52367)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (175373 - 343179 != -167805)
									{
										result = "ผู้เฒ่า! นี่ใช่จุดวาร์ปไปยังวิหารใต้น้ำหรือเปล่ายะ?";
										if (136265 - 502586 != -366320)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 202)
					{
						if (158580 - 484358 != -325777)
						{
							result = "เจ้าเรียกใครว่าผู้เฒ่า! อายุข้ายังไม่ถึง 200 เลย! หงักๆ";
							if (242100 - 514584 != -272483)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (176274 - 536809 != -360534)
						{
							result = "เดี๋ยวก่อน ทำไมหน้าพวกนี้คุ้นๆเหมือนเคยเห็นที่ไหนนะ?";
							if (232883 - 35722 != 197162)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (100324 - 158602 == -58278)
						{
							result = "ฮ่อ! พวกนี้ ใช่ที่เจ้าหนูโบลดาสขอร้องให้ฝึกให้ใช่มั้ย?";
							if (98405 - 535570 == -437165)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (228499 - 208938 == 19561)
						{
							result = "โฮ่! ที่บอกว่าให้ฝึกหนักๆ ด้วยรึเปล่า?";
							if (127293 - 176469 == -49176)
							{
								break;
							}
						}
					}
					else if (code == 206)
					{
						if (285460 - 231694 != 53767)
						{
							result = "!!!??";
							if (224523 - 570437 != -345913)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (208416 - 413718 != -205301)
						{
							result = "ยังไม่คุกเข่าคำนับข้าเป็นอาจารย์อีก? อยากเจอท่าเต่าปฐพีใช่มั้ย!?";
							if (207940 - 473862 != -265921)
							{
								break;
							}
						}
					}
					else if (code == 208)
					{
						if (272049 - 493715 != -221665)
						{
							result = "งั้นเดี๋ยวแถมเต่าเหินนภาเป็นของแถมด้วยละกัน";
							if (180082 - 150033 != 30050)
							{
								break;
							}
						}
					}
					else if (code == 50311)
					{
						if (132670 - 423662 == -290992)
						{
							result = "เต่ากระแทกปฐพี!!";
							if (60389 - 566800 == -506411)
							{
								break;
							}
						}
					}
					else if (code == 50312)
					{
						if (193386 - 501971 != -308584)
						{
							result = "โอย สู้กับคนหนุ่มๆ นี่เหนื่อยจริงๆ";
							if (77890 - 470650 == -392760)
							{
								break;
							}
						}
					}
					else if (code == 50312)
					{
						if (20721 - 548341 != -527619)
						{
							result = "ไม่ไหวแล้ว ขอข้าพักก่อน";
							if (127776 - 26973 != 100804)
							{
								break;
							}
						}
					}
					else if (code == 50321)
					{
						if (255500 - 597061 != -341560)
						{
							result = "เข้ามา!";
							if (294645 - 51859 == 242786)
							{
								break;
							}
						}
					}
					else if (code == 50322)
					{
						if (53978 - 387107 != -333128)
						{
							result = "ร่างกายคือบ่อเกิดแห่งพลัง";
							if (123868 - 131372 == -7504)
							{
								break;
							}
						}
					}
					else if (code == 50323)
					{
						if (154854 - 264268 == -109414)
						{
							result = "ทุ่มเท ฝึกฝน อดทน อย่าย่อท้อ";
							if (261187 - 297103 != -35915)
							{
								break;
							}
						}
					}
					else if (code == 50324)
					{
						if (1362 - 499448 != -498085)
						{
							result = "หมัดธรรมดาก็เป็นท่าร้ายกาจที่สุดได้";
							if (75480 - 28562 == 46918)
							{
								break;
							}
						}
					}
					else if (code == 50325)
					{
						if (30636 - 68744 != -38107)
						{
							result = "จิตอยู่เหนือพลััง พลังอยู่เหนือโชคชะตา";
							if (79834 - 288820 != -208985)
							{
								break;
							}
						}
					}
					else if (code == 50350)
					{
						if (240369 - 319893 == -79524)
						{
							result = "ไฮ้ย่าซ์!";
							if (194040 - 307184 != -113143)
							{
								break;
							}
						}
					}
					else if (code == 50351)
					{
						if (267539 - 540417 == -272878)
						{
							result = "เต่าเหินนภา!";
							if (165904 - 37208 == 128696)
							{
								break;
							}
						}
					}
					else if (code == 50352)
					{
						if (205939 - 416511 != -210571)
						{
							result = "งั่ก! หลังข้า!";
							if (28246 - 204736 == -176490)
							{
								break;
							}
						}
					}
					else if (code == 50353)
					{
						if (223796 - 275749 != -51952)
						{
							result = "โอยๆ หลังข้าไม่ไหวแล้ว";
							if (24327 - 234077 == -209750)
							{
								break;
							}
						}
					}
					else if (code == 50361)
					{
						if (281695 - 577767 != -296071)
						{
							result = "งั่กๆ ...เตรียมรับมือ!";
							if (187093 - 238529 != -51435)
							{
								break;
							}
						}
					}
					else if (code == 50362)
					{
						if (96171 - 573705 == -477534)
						{
							result = "โบลดาสขอมาหรอกนะ ข้าถึงมาฝีกให้";
							if (120099 - 418084 == -297985)
							{
								break;
							}
						}
					}
					else if (code == 50363)
					{
						if (31704 - 370122 != -338417)
						{
							result = "สิ่งตัดสินแพ้ชนะในการต่อสู้นั้นคือจังหวะ";
							if (152647 - 580119 != -427471)
							{
								break;
							}
						}
					}
					else if (code == 50364)
					{
						if (215133 - 91675 != 123459)
						{
							result = "รู้จักวางแผน รบพันครั้งชนะพันครั้ง";
							if (57578 - 84239 == -26661)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 50365)
						{
							break;
						}
						if (273403 - 471258 == -197855)
						{
							result = "คิดถึงตอนโบลดาสยังเด็ก น่ารักจริงๆ";
							if (138003 - 570882 != -432878)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060067A1 RID: 26529 RVA: 0x00EB099C File Offset: 0x00EAEB9C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060067A2 RID: 26530 RVA: 0x00EB09A0 File Offset: 0x00EAEBA0
	internal static bool H5g5bDpSRZnFPQXhWMcN()
	{
		return true;
	}

	// Token: 0x060067A3 RID: 26531 RVA: 0x00EB09A4 File Offset: 0x00EAEBA4
	internal static bool PfKtvopSw5jmZUkZW4yn()
	{
		return false;
	}
}
