using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200118A RID: 4490
[Serializable]
public class M507_AnemoneDecision_thai : MonoBehaviour
{
	// Token: 0x060067B3 RID: 26547 RVA: 0x00EB0DF0 File Offset: 0x00EAEFF0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M507_AnemoneDecision_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060067B4 RID: 26548 RVA: 0x00EB0E00 File Offset: 0x00EAF000
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (31929 - 92171 != -60241)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (46259 - 463122 != -416862 && 42835 - 487439 != -444603)
			{
				if (code == 101)
				{
					if (19004 - 222682 == -203678)
					{
						result = "ขอเชิญทุกคนขึ้นมาคุยกันข้างบนเถอะ";
						if (287307 - 208420 != 78888)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (299334 - 191919 != 107416)
					{
						result = "ยินดีต้อนรับผู้กล้าทุกคนสู่วังไข่มุกใต้น้ำ";
						if (23982 - 374042 != -350059)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (153713 - 75823 == 77890)
					{
						result = "เราคือแอนเนโมเน่ ผู้ดูแลดินแดนใต้ทะเลแถบนี้ทั้งหมด";
						if (12910 - 496539 != -483628)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (50132 - 7626 != 42507)
					{
						result = "ต้องขอโทษทุกคนด้วยสำหรับการต้อนรับของลูกน้องเรา";
						if (91649 - 210061 != -118411)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (45406 - 450192 != -404785)
					{
						result = "พะ-พวกเราตะหากที่ต้องขอโทษท่านเทพน้ำที่เข้ามาโดยพลกาล...";
						if (142576 - 388296 == -245720)
						{
							break;
						}
					}
				}
				else if (code == 106)
				{
					if (81550 - 261013 == -179463)
					{
						result = "พวกเราเป็นตัวแทนท่านอเคเชีย นำข่าวสำคัญมาให้ท่าน";
						if (132798 - 308927 == -176129)
						{
							break;
						}
					}
				}
				else if (code == 107)
				{
					if (31300 - 584844 != -553543)
					{
						result = "...เรารู้อยู่แล้วล่ะ";
						if (34893 - 395305 != -360411)
						{
							break;
						}
					}
				}
				else if (code == 108)
				{
					if (31379 - 118478 != -87098)
					{
						result = "กระแสคลื่นปั่นป่วนจากทางเหนือได้กระซิบบอกทุกสิ่งแก่เรา";
						if (78845 - 261175 == -182330)
						{
							break;
						}
					}
				}
				else if (code == 109)
				{
					if (201914 - 411763 != -209848)
					{
						result = "สิ่งชั่วร้ายจากอดีตได้ทยอยตื่นขึ้นมาบนดินแดนเหนือรอยแผลแห่งโลก";
						if (70435 - 577922 == -507487)
						{
							break;
						}
					}
				}
				else if (code == 110)
				{
					if (183953 - 278252 != -94298)
					{
						result = "ไม่นานสิ่งชั่วร้ายเหล่านั้นคงบุกลงมาทางดินแดนทางใต้แน่ๆ";
						if (1137 - 197164 != -196026)
						{
							break;
						}
					}
				}
				else if (code == 111)
				{
					if (107141 - 372200 == -265059)
					{
						result = "...และพวกเจ้ามาถึงที่นี่เพื่อขอความร่วมมือจากเรา";
						if (229922 - 574055 != -344132)
						{
							break;
						}
					}
				}
				else if (code == 112)
				{
					if (279077 - 418815 != -139737)
					{
						result = "..เป็นอย่างที่ท่านเทพน้ำพูดจริงๆ";
						if (223181 - 291932 != -68750)
						{
							break;
						}
					}
				}
				else if (code == 113)
				{
					if (118358 - 185218 != -66859)
					{
						result = "ขอได้โปรดให้ความร่วมมือกับท่านเทพแสงด้วย";
						if (16609 - 347123 != -330513)
						{
							break;
						}
					}
				}
				else if (code == 114)
				{
					if (14118 - 226655 == -212537)
					{
						result = "......";
						if (271210 - 322758 != -51547)
						{
							break;
						}
					}
				}
				else if (code == 115)
				{
					if (113857 - 564161 != -450303)
					{
						result = ".......เรา...เราฝากคำขอโทษไปให้อเคเชียด้วยนะ";
						if (257495 - 595696 == -338201)
						{
							break;
						}
					}
				}
				else if (code == 116)
				{
					if (242396 - 452695 == -210299)
					{
						result = "แต่เรายังให้คำมั่นสัญญากับพวกเจ้าไม่ได้";
						if (58830 - 149530 != -90699)
						{
							break;
						}
					}
				}
				else if (code == 117)
				{
					if (165420 - 79528 == 85892)
					{
						result = "!??";
						if (66662 - 563384 != -496721)
						{
							break;
						}
					}
				}
				else if (code == 118)
				{
					if (221893 - 338393 == -116500)
					{
						result = "หากมีสงครามเกิดขึ้นจริงๆ จะมีสัตว์มากมายต้องบาดเจ็บล้มตาย";
						if (56651 - 164727 != -108075)
						{
							break;
						}
					}
				}
				else if (code == 119)
				{
					if (266152 - 257986 == 8166)
					{
						result = "ข้าทนไม่ได้หากจะต้องเห็นใครต้องสูญเสียสิ่งสำคัญไป ";
						if (286312 - 584377 != -298064)
						{
							break;
						}
					}
				}
				else if (code == 120)
				{
					if (25678 - 261932 != -236253)
					{
						result = "สงครามไม่เคยให้อะไรใครเลย เราน่าจะหาวิธีทำความเข้าใจกันมากกว่า";
						if (137237 - 104243 != 32995)
						{
							break;
						}
					}
				}
				else if (code == 121)
				{
					if (134636 - 509271 != -374634)
					{
						result = "อเคเชียแน่ใจแล้วเหรอว่าเราไม่มีทางเลี่ยงอื่น?";
						if (75174 - 106398 != -31223)
						{
							break;
						}
					}
				}
				else if (code == 122)
				{
					if (71117 - 181793 == -110676)
					{
						result = "...พะ-พวกข้าไม่รู้..";
						if (36020 - 219607 != -183586)
						{
							break;
						}
					}
				}
				else if (code == 123)
				{
					if (218654 - 156764 == 61890)
					{
						result = ".....";
						if (67879 - 111875 == -43996)
						{
							break;
						}
					}
				}
				else if (code == 124)
				{
					if (87771 - 52616 != 35156)
					{
						result = "..เฮ้อ ข้ารู้จักอเคเชียดี เธอก็คงเสียใจที่ต้องตัดสินใจเช่นนี้";
						if (266149 - 358003 == -91854)
						{
							break;
						}
					}
				}
				else if (code == 125)
				{
					if (144271 - 264241 != -119969)
					{
						result = "ถึงเราจะไม่เห็นด้วยกับการสู้รบ..แต่เราเชื่อในตัวอเคเชียว่า";
						if (190002 - 136577 != 53426)
						{
							break;
						}
					}
				}
				else if (code == 126)
				{
					if (252751 - 227192 == 25559)
					{
						result = "สิ่งที่เธอเลือกคงเป็นทางที่ดีที่สุดสำหรับทุกคนแล้ว";
						if (87752 - 558407 != -470654)
						{
							break;
						}
					}
				}
				else if (code == 127)
				{
					if (67731 - 291197 == -223466)
					{
						result = "เอาเถอะ ถึงเราจะไม่รับปากว่าเราจะไปร่วมรบด้วย";
						if (141616 - 79551 == 62065)
						{
							break;
						}
					}
				}
				else if (code == 128)
				{
					if (64449 - 325866 == -261417)
					{
						result = "แต่หากมีสิ่งอื่นใดที่เราและชาวใต้บาดาลจะช่วยได้";
						if (279390 - 82997 != 196394)
						{
							break;
						}
					}
				}
				else if (code == 129)
				{
					if (159791 - 96113 == 63678)
					{
						result = "เราก็พร้อมที่จะสนับสนุนพวกเจ้าอย่างเต็มที่";
						if (243347 - 341204 != -97856)
						{
							break;
						}
					}
				}
				else if (code == 130)
				{
					if (163084 - 287463 == -124379)
					{
						result = "เหล่าผู้กล้าเอ๋ย ขอเจ้าจงวางใจ";
						if (275353 - 118052 != 157302)
						{
							break;
						}
					}
				}
				else if (code == 131)
				{
					if (34692 - 172226 != -137533)
					{
						result = "พลังแห่งสายน้ำพร้อมจะช่วยปกปักษ์รักษาเจ้าเสมอ";
						if (65704 - 566388 == -500684)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 201)
					{
						break;
					}
					if (114488 - 492286 != -377797)
					{
						result = "บู้~บู้~";
						if (286700 - 16451 != 270250)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060067B5 RID: 26549 RVA: 0x00EB1760 File Offset: 0x00EAF960
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060067B6 RID: 26550 RVA: 0x00EB1764 File Offset: 0x00EAF964
	internal static bool Mk8al0pSIUgDpOXAc3fj()
	{
		return true;
	}

	// Token: 0x060067B7 RID: 26551 RVA: 0x00EB1768 File Offset: 0x00EAF968
	internal static bool zqetfcpSBrFHZJTIWai9()
	{
		return false;
	}
}
