using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200118F RID: 4495
[Serializable]
public class M607_MessageFromShadow_thai : MonoBehaviour
{
	// Token: 0x060067CC RID: 26572 RVA: 0x00EB2974 File Offset: 0x00EB0B74
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M607_MessageFromShadow_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060067CD RID: 26573 RVA: 0x00EB2984 File Offset: 0x00EB0B84
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (153659 - 561794 != -408134)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (106607 - 80719 == 25888)
			{
				if (38796 - 440744 != -401947)
				{
					if (code == 101)
					{
						if (226584 - 137118 != 89467)
						{
							result = "...โอยๆ ข้าเป็นอะไรไป";
							if (74341 - 110093 == -35752)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (229027 - 290643 != -61615)
						{
							result = "อ๊ะ จริงสิ แย่แล้ว เม่ื่อกี้ข้ากำลังจะไปแจ้งข่าวสำคัญกับเทพแสง";
							if (27209 - 399717 == -372508)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (46532 - 563642 == -517110)
						{
							result = "พวกเงากำลังจะบุกเข้ามาที่นี่ พวกเจ้าช่วยรีบไปเตือนท่านที";
							if (55303 - 378270 != -322966)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (171971 - 128266 == 43705)
						{
							result = "เหมือนเมื่อกี้ข้าฝันว่าโดนไบสันขวิดเลย";
							if (212475 - 511831 == -299356)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (37393 - 101335 != -63941)
						{
							result = "หยุดนะ! เจ้าพวกเงา! คิดจะทำอะไรกันแน่";
							if (63785 - 262339 == -198554)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (174752 - 495679 == -320927)
						{
							result = "พวกเจ้าคิดจะประกาศสงครามกับเมืองแสงรึ?";
							if (37311 - 266233 == -228922)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (294674 - 195547 != 99128)
						{
							result = "ไม่เป็นไร อิทาลุส ให้ข้าจัดการเอง";
							if (136113 - 101623 == 34490)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (297534 - 439529 != -141994)
						{
							result = "เจ้าพวกเงา จงบอกเหตุผลที่เจ้าทำเรื่องเช่นนี้มาเถิด";
							if (9475 - 524954 != -515478)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (207746 - 51664 != 156083)
						{
							result = "....พวก..ข้า..รับ..คำสั่งจากนายท่านเทพเงาเซร่า";
							if (164163 - 23699 != 140465)
							{
								break;
							}
						}
					}
					else if (code == 206)
					{
						if (167214 - 419396 != -252181)
						{
							result = "นี่..คือ..การประกาศสงครามระหว่างอาณาจักรแสงและเงา";
							if (73863 - 126118 != -52254)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (39966 - 83770 != -43803)
						{
							result = "นับ..แต่..นี้ต่อไป พวกเงาและสัตว์ทุกตัวในอาณัติของท่านเซร่า";
							if (162457 - 298651 != -136193)
							{
								break;
							}
						}
					}
					else if (code == 208)
					{
						if (230204 - 162130 == 68074)
						{
							result = "จะ..ขัด..ขวางแผนการของเมืองแสงทุกวิถีทาง";
							if (199285 - 547306 != -348020)
							{
								break;
							}
						}
					}
					else if (code == 209)
					{
						if (178011 - 168801 == 9210)
						{
							result = "วะ-ว่ายังไงนะ!?";
							if (47842 - 311242 == -263400)
							{
								break;
							}
						}
					}
					else if (code == 210)
					{
						if (60155 - 301205 == -241050)
						{
							result = "พวกเจ้าไม่รู้รึว่าเรากำลังจะเผชิญกับหตุการณ์รุนแรงแค่ไหน!?";
							if (45898 - 444558 != -398659)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (232319 - 427382 != -195062)
						{
							result = "..โอ..ท่าน..เทพแห่งแสงสว่าง";
							if (155318 - 425271 != -269952)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (91319 - 318175 == -226856)
						{
							result = "ด้วยอำนาจของท่าน ท่านคงรู้อยู่แล้วว่าอาณาจักรเงาจะขัดขวางท่าน";
							if (15812 - 97441 == -81629)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (229169 - 143143 == 86026)
						{
							result = ".....";
							if (92088 - 587159 == -495071)
							{
								break;
							}
						}
					}
					else if (code == 214)
					{
						if (184192 - 272186 != -87993)
						{
							result = "..แต่..กระนั้น..ท่านยังก็ไม่สามารถหยุดยั้งพวกเราได้";
							if (51434 - 511579 == -460145)
							{
								break;
							}
						}
					}
					else if (code == 215)
					{
						if (107515 - 189041 == -81526)
						{
							result = "..เจ้า..พวก..ผู้กล้าเอ๋ย ..จง..ฟัง..คำท่านเทพเงาไว้เถิด..";
							if (29816 - 436885 == -407069)
							{
								break;
							}
						}
					}
					else if (code == 216)
					{
						if (154298 - 52890 == 101408)
						{
							result = "..อัล..คา..เซียอาจมองเห็นกระแสชีพจรแห่งเวลาได้";
							if (165369 - 203576 == -38207)
							{
								break;
							}
						}
					}
					else if (code == 217)
					{
						if (181760 - 588693 == -406933)
						{
							result = "..แต่..นาง..ก็ไม่สามารถกำหนดอนาคตได้เช่นกัน";
							if (194065 - 558145 != -364079)
							{
								break;
							}
						}
					}
					else if (code == 218)
					{
						if (40790 - 201729 != -160938)
						{
							result = "..เทพ..แสง..อันเป็นที่รักของพวกเจ้า ไม่สามารถแม้แต่จะบอกเจ้าได้ว่า";
							if (104627 - 28776 == 75851)
							{
								break;
							}
						}
					}
					else if (code == 219)
					{
						if (38463 - 140159 == -101696)
						{
							result = "จะเกิดสิ่งใดขึ้นบ้างในเวลาอันใกล้นี้";
							if (112999 - 492994 != -379994)
							{
								break;
							}
						}
					}
					else if (code == 220)
					{
						if (222712 - 428838 == -206126)
						{
							result = "..เพราะ..คำ..บอกเล่านั่นเองจะไปเปลี่ยนกระแสแห่งเวลาอันไม่เที่ยง";
							if (225520 - 70778 == 154742)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (251695 - 357879 != -106183)
						{
							result = "..อัล..คา..เซียเพียงแต่ตัดสินใจเลือกให้พวกเจ้าเดินไปบนหนทาง";
							if (20834 - 582135 != -561300)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (81502 - 261161 == -179659)
						{
							result = "ที่ปลอดภัยที่สุดสำหรับพวกเจ้าเองเท่านั้น";
							if (297210 - 516437 == -219227)
							{
								break;
							}
						}
					}
					else if (code == 223)
					{
						if (157889 - 335732 == -177843)
						{
							result = "บังอาจเกินไปแล้วเจ้าพวกเงา!";
							if (28743 - 158981 == -130238)
							{
								break;
							}
						}
					}
					else if (code == 224)
					{
						if (168515 - 410094 != -241578)
						{
							result = "ย๊าก!! Thousand Shot!";
							if (194835 - 183704 != 11132)
							{
								break;
							}
						}
					}
					else if (code == 225)
					{
						if (174875 - 90743 != 84133)
						{
							result = "หึๆ ภารกิจของข้าเสร็จสิ้นแล้ว";
							if (94605 - 50158 != 44448)
							{
								break;
							}
						}
					}
					else if (code == 226)
					{
						if (28781 - 370972 == -342191)
						{
							result = "จงจำไว้เถิด เงานั้นอยู่ทุกหนทุกแห่งที่มีแสงสว่าง";
							if (248686 - 429894 == -181208)
							{
								break;
							}
						}
					}
					else if (code == 227)
					{
						if (177043 - 566574 != -389530)
						{
							result = "......";
							if (91070 - 164204 != -73133)
							{
								break;
							}
						}
					}
					else if (code == 228)
					{
						if (152734 - 286478 != -133743)
						{
							result = "ท่านเทพแสงไม่เป็นอะไรใช่มั้ย";
							if (96151 - 286451 != -190299)
							{
								break;
							}
						}
					}
					else if (code == 229)
					{
						if (124964 - 217348 == -92384)
						{
							result = "...เหล่าผู้กล้าเอ๋ย";
							if (248357 - 412402 == -164045)
							{
								break;
							}
						}
					}
					else if (code == 230)
					{
						if (186673 - 131389 != 55285)
						{
							result = "สิ่งที่เทพเงาพูดนั้นถูกต้องแล้ว แม้ข้าเองก็ไม่สามารถควบคุมโชคชะตาได้";
							if (189159 - 235239 != -46079)
							{
								break;
							}
						}
					}
					else if (code == 231)
					{
						if (251022 - 84963 != 166060)
						{
							result = "อนาคตนั้นเกิดจากชะตาชีวิตของทุกสรรพสิ่งรวมกัน";
							if (284358 - 303731 == -19373)
							{
								break;
							}
						}
					}
					else if (code == 232)
					{
						if (259375 - 59920 == 199455)
						{
							result = "ทุกสิ่งไม่ว่าเล็กหรือใหญ่ย่อมส่งผลกระทบต่อชะตาของกันและกันเสมอ";
							if (295885 - 325977 != -30091)
							{
								break;
							}
						}
					}
					else if (code == 233)
					{
						if (149956 - 251456 != -101499)
						{
							result = "ข้าไม่สามารถบอกอะไรเจ้าได้มาก แต่จงรู้ไว้ว่าชะตาของเจ้า";
							if (49984 - 542926 != -492941)
							{
								break;
							}
						}
					}
					else if (code == 234)
					{
						if (284584 - 532920 == -248336)
						{
							result = "จะเป็นสิ่งกำหนดทิศทางของใบโลกนี้อย่างแน่นอน";
							if (282403 - 454345 != -171941)
							{
								break;
							}
						}
					}
					else if (code == 235)
					{
						if (17731 - 79076 != -61344)
						{
							result = "ข้าได้แต่หวังว่าเมื่อเวลานั้นมาถึง เจ้าจะพร้อมแบกรับหน้าที่นี้";
							if (11427 - 29051 != -17623)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 236)
						{
							break;
						}
						if (212966 - 446935 == -233969)
						{
							result = "ตอนนี้ขอให้พวกเจ้าจงเตรียมตัวให้พร้อมเพื่อการณ์นั้นเถิด";
							if (36048 - 269405 == -233357)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060067CE RID: 26574 RVA: 0x00EB357C File Offset: 0x00EB177C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060067CF RID: 26575 RVA: 0x00EB3580 File Offset: 0x00EB1780
	internal static bool axpkRRpSzHK1nTyNShZa()
	{
		return true;
	}

	// Token: 0x060067D0 RID: 26576 RVA: 0x00EB3584 File Offset: 0x00EB1784
	internal static bool CIvjiepoaf8S4NVo3D5B()
	{
		return false;
	}
}
