using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001196 RID: 4502
[Serializable]
public class M707_MachineFromThePast_thai : MonoBehaviour
{
	// Token: 0x060067EF RID: 26607 RVA: 0x00EB48C0 File Offset: 0x00EB2AC0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M707_MachineFromThePast_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060067F0 RID: 26608 RVA: 0x00EB48D0 File Offset: 0x00EB2AD0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (47750 - 249544 != -201794)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (298678 - 103222 != 195457)
			{
				if (42056 - 91788 == -49732)
				{
					if (code == 101)
					{
						if (11830 - 117357 != -105526)
						{
							result = "สะ-สุดยอดครีเอชั่นของข้า~!!!";
							if (171631 - 210991 != -39359)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (218951 - 309332 == -90381)
						{
							result = "ข้าคำนวนผิดตรงไหน!? หรือว่า e ไม่เท่ากับ mc ยกกำลังสาม?";
							if (280086 - 526443 == -246357)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (233457 - 91236 == 142221)
						{
							string type = CharacterData.current.Type;
							if (187720 - 511320 != -323599)
							{
								if (type == "Wolf")
								{
									if (45676 - 14139 == 31537)
									{
										result = "ด.ร. พวกเรามีอะไรให้ท่านช่วยดูหน่อย";
										if (213089 - 158960 == 54129)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (55470 - 101013 != -45542)
									{
										result = "ก็เหล็กของ ด.ร. ยังแกร่งไม่เท่ากล้ามข้า!";
										if (151140 - 6607 == 144533)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (59306 - 290556 == -231250)
									{
										result = "..หุ่นยักษ์ต่อยแพ้แพนด้านี่น่าอายเนอะ";
										if (82543 - 393930 == -311387)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (141508 - 152766 != -11257)
									{
										result = "ด.ร. แซบป้า ฝากดูไอ้เครื่องจักรประหลาดนี่ให้หน่อย";
										if (8484 - 279867 != -271382)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (71584 - 489564 != -417979)
									{
										result = "ด.ร. เราเอาเครื่องจักรประหลาดมาให้ดูนะ เมี้ยว";
										if (238759 - 206630 == 32129)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (290131 - 492331 == -202200)
									{
										result = "ท่านด๊อกเตอร์แซปป้า ดูเครื่องจักรนี่ที";
										if (197384 - 592192 == -394808)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (93688 - 374797 != -281108)
									{
										result = "ด.ร. จ๊ะ ช่วยดูไอ้นี่ให้หน่อยจิ";
										if (125864 - 430169 != -304304)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (79780 - 46731 != 33050)
									{
										result = "ต้องยกกำลังสองนะด๊อกเตอร์ (อ่านเจอในวังแสง)";
										if (225178 - 93710 == 131468)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (64610 - 454191 == -389581)
									{
										result = "เวทมนตร์เจ๋งกว่าวิทยาศาสตร์นะ เจี๊ยก!";
										if (77441 - 240466 != -163024)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (269483 - 31526 == 237957)
									{
										result = "ด.ร. วัดหัวใจนักสุ้ของกวินผิดไป! กวิ้น!";
										if (192939 - 556502 == -363563)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (32256 - 367199 != -334942)
									{
										result = "ด.ร. คะ เรามีเครื่องจักรประหลาดมาปอให้ท่านช่วยดูหน่อย";
										if (148529 - 203731 == -55202)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (291613 - 269801 == 21812)
									{
										result = "เครื่องจักรไร้รสนิยมอย่างนั้นจะมาชนะชั้นได้ไงยะ";
										if (60316 - 274283 != -213966)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 104)
					{
						if (228038 - 117444 == 110594)
						{
							result = "อ๊ะ! เจ้าเอาอะไรมาด้วยน่ะ?";
							if (217031 - 464614 != -247582)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (64333 - 50763 != 13571)
						{
							result = "ไหนๆ ขอข้าเปิดฝาดูข้างในหน่อยสิ";
							if (74861 - 92479 != -17617)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (242547 - 597030 != -354482)
						{
							result = "นี่มัน!?";
							if (297888 - 584525 != -286636)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (254409 - 416914 == -162505)
						{
							result = "โอ้ มายก้อด! นี่มันกิ๊บเก๋ยูเรก้ามาก!";
							if (12536 - 55087 != -42550)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (288210 - 248635 == 39575)
						{
							result = "เครื่องยนต์แม่เหล็กขั้วเดี่ยวต้านแรงดึงดูด! ของจริงหรือนี่ ";
							if (38531 - 187551 != -149019)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (295397 - 505351 == -209954)
						{
							result = "สุโก้ย สุโก้ย!";
							if (245366 - 432494 == -187128)
							{
								break;
							}
						}
					}
					else if (code == 110)
					{
						if (96958 - 324624 == -227666)
						{
							result = "เจ๋งมาก! ระบบแยกประมวลผลความคิดแบบเครือข่าย!";
							if (225503 - 289195 != -63691)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (49032 - 318324 == -269292)
						{
							result = "ฮ่าๆ เจ้าเอาอะไรมาให้ข้าดูนี่? อ้อยเข้าปากตุ่นชัดๆ";
							if (178825 - 24874 == 153951)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (22660 - 178198 != -155537)
						{
							result = "ห๊ะ!";
							if (204183 - 35993 == 168190)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (296344 - 428270 != -131925)
						{
							result = "บร้าาา ไปแล้ว! นี่มันเตาพลังงานอีเธอร์นี่!!";
							if (119734 - 341925 != -222190)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (38855 - 87204 == -48349)
						{
							result = "ไอ้ของไม่เป็นวิทยาศาสตร์ยังงี้มาอยู่ในนี้ได้ยังไง!?";
							if (222140 - 517754 == -295614)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (8163 - 451556 != -443392)
						{
							result = "พะ-พวกเจ้าไปเอาไอ้นี่มาจากไหน!?";
							if (110934 - 532181 != -421246)
							{
								break;
							}
						}
					}
					else if (code == 116)
					{
						if (127696 - 234081 != -106384)
						{
							result = "เครื่องจักรพวกนี้ข้ามมาจากอีกฝั่งของรอยแผลแห่งโลกน่ะ";
							if (182136 - 171627 != 10510)
							{
								break;
							}
						}
					}
					else if (code == 117)
					{
						if (48966 - 487547 == -438581)
						{
							result = "ด.ร. พอรู้อะไรเกี่ยวกับพวกมันมั้ย!?";
							if (76102 - 109545 != -33442)
							{
								break;
							}
						}
					}
					else if (code == 118)
					{
						if (34616 - 513746 == -479130)
						{
							result = "รู้มั้ยเหรอ ฮ่าๆ ยิ่งกว่ารู้ซะอีก!";
							if (114647 - 106057 != 8591)
							{
								break;
							}
						}
					}
					else if (code == 119)
					{
						if (269541 - 109200 != 160342)
						{
							result = "ไอ้นี่น่ะมันเหมือนวัตถุโบราณที่ขุดได้จากอารยธรรมโลกเก่าเปี๊ยบเลย";
							if (134052 - 309716 != -175663)
							{
								break;
							}
						}
					}
					else if (code == 120)
					{
						if (130312 - 140721 != -10408)
						{
							result = "วิทยาการเครื่องจักรกลตอนนี้ ก็ได้จากการศึกษาของพวกนี้แหละ";
							if (40453 - 500736 == -460283)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (259935 - 501745 == -241810)
						{
							result = "แต่สิ่งที่เราเข้าใจน่ะยังไม่ถึงครื่งของไอ้เครื่องจักรนี่เลย";
							if (68007 - 357815 != -289807)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (161719 - 570711 == -408992)
						{
							result = "ที่สำคัญคือเราไม่เคยพบตัวอย่างที่มีสภาพสมบูรณ์อย่างนี้มาก่อน";
							if (203018 - 89695 != 113324)
							{
								break;
							}
						}
					}
					else if (code == 123)
					{
						if (165112 - 488217 == -323105)
						{
							result = "ไอ้นี่น่ะมันไม่ใช่ของเก่า แต่เพิ่งถูกผลิตขึ้นมาใหม่ชัดๆ";
							if (176724 - 115632 == 61092)
							{
								break;
							}
						}
					}
					else if (code == 124)
					{
						if (284441 - 51516 == 232925)
						{
							result = "ถ้าเจ้าบอกว่ามันข้ามมาจากอีกฝั่งละก็..";
							if (182370 - 379583 == -197213)
							{
								break;
							}
						}
					}
					else if (code == 125)
					{
						if (118041 - 11528 != 106514)
						{
							result = "ดินแดนนี้ก็กำลังตกอยู่ในอันตรายครั้งใหญ่แล้ว";
							if (249171 - 238900 != 10272)
							{
								break;
							}
						}
					}
					else if (code == 126)
					{
						if (123317 - 446308 != -322990)
						{
							result = "ถ้าเจ้าสนใจ อยากรู้เรื่องในอดีตเพิ่มเติมละก็..";
							if (84412 - 585109 == -500697)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 127)
						{
							break;
						}
						if (102874 - 220457 != -117582)
						{
							result = "ลองขออนุญาติเร็กกุ เข้าไปที่คลังลับใต้หอสมุดเมืองแสงดูสิ!";
							if (91730 - 191968 == -100238)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060067F1 RID: 26609 RVA: 0x00EB5478 File Offset: 0x00EB3678
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060067F2 RID: 26610 RVA: 0x00EB547C File Offset: 0x00EB367C
	internal static bool cKYwq3pokFWPaxhsvTn0()
	{
		return true;
	}

	// Token: 0x060067F3 RID: 26611 RVA: 0x00EB5480 File Offset: 0x00EB3680
	internal static bool WxvLIbpoGZfQV4Pt6VX2()
	{
		return false;
	}
}
