using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200119C RID: 4508
[Serializable]
public class M807_RemnantOfTime_thai : MonoBehaviour
{
	// Token: 0x0600680D RID: 26637 RVA: 0x00EB6D40 File Offset: 0x00EB4F40
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M807_RemnantOfTime_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600680E RID: 26638 RVA: 0x00EB6D50 File Offset: 0x00EB4F50
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (153673 - 207432 != -53758)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (229810 - 198679 == 31131)
			{
				if (36202 - 29619 != 6584)
				{
					if (code == 1)
					{
						if (9926 - 122594 != -112667)
						{
							result = "อ้า ขอบใจมากนะที่ช่วย";
							if (97749 - 358816 != -261066)
							{
								break;
							}
						}
					}
					else if (code == 2)
					{
						if (164331 - 345198 == -180867)
						{
							result = "พวกแมลงกระดาษทำวุ่นวายไปหมดเลย";
							if (140176 - 107397 == 32779)
							{
								break;
							}
						}
					}
					else if (code == 3)
					{
						if (108428 - 514035 == -405607)
						{
							result = "ตอนนี้ทุกคนกำลังช่วยซ่อมแซมทำความสะอาดวิหารนะ";
							if (253233 - 414989 != -161755)
							{
								break;
							}
						}
					}
					else if (code == 4)
					{
						if (75315 - 92264 == -16949)
						{
							result = "ถ้าเจ้าอยากรู้เรื่องในอดีตลองไปคุยรอบๆ ดูสิ";
							if (114250 - 15148 == 99102)
							{
								break;
							}
						}
					}
					else if (code == 5)
					{
						if (280268 - 294950 == -14682)
						{
							result = "เจ้าอยากรู้เรื่องในอดีตใช่มั้ย ลองไปถามคุณลิซ่าดูสิ";
							if (257036 - 281794 == -24758)
							{
								break;
							}
						}
					}
					else if (code == 100)
					{
						if (218147 - 496066 == -277919)
						{
							result = "โอยๆ ตอนนี้ข้ากำลังยุ่งอยู่";
							if (33350 - 373457 != -340106)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (101533 - 539299 != -437765)
						{
							result = "เจ้าอยากรู้เรื่องเหตุการณ์ในอดิีตไม่ใช่เหรอ";
							if (92955 - 137128 == -44173)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (153130 - 223217 != -70086)
						{
							result = "ไปคุยกับลิซ่าแล้วค่อยกลับมานะ";
							if (264664 - 144056 != 120609)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (181024 - 444867 == -263843)
						{
							result = "ตอนนี้ข้ากำลังยุ่งอยู่ ลองสำรวจดูรอบๆเพื่อฆ่าเวลาก่อนเถอะ";
							if (280534 - 445723 != -165188)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (235232 - 139474 != 95759)
						{
							result = "ลองไปหาลิซ่าดูซิ ประวัติศาสตร์อาจบอกอะไรเจ้าได้";
							if (145046 - 243801 == -98755)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (162711 - 522181 != -359469)
						{
							result = "...";
							if (35653 - 192709 == -157056)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (79442 - 133008 == -53566)
						{
							result = "อ้า พวกเจ้ากลับมาพอดี!";
							if (81664 - 196819 == -115155)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (192975 - 371016 != -178040)
						{
							result = "เรื่องใหญ่แล้วล่ะ ดูเหมือนว่าชิ้นส่วนนี่จะเป็นของปลอมนะ";
							if (216337 - 291639 != -75301)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (80759 - 77961 == 2798)
						{
							result = "ปิศาจเงาต้องแอบสับเปลี่ยนก่อนสู้กับพวกเจ้าแน่ๆ";
							if (248128 - 468165 != -220036)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (128757 - 212988 == -84231)
						{
							result = "ถึงข้าจะไม่รู้ว่ามันใช้ทำอะไร แต่ท่านอัลเคเซียบอกว่า..";
							if (81100 - 494346 == -413246)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (149743 - 372124 == -222381)
						{
							result = "มันเป็นของสำคัญมากถึงขนาดที่จะเปลี่ยนชะตาของโลกได้เลยทีเดียว";
							if (146071 - 140886 != 5186)
							{
								break;
							}
						}
					}
					else if (code == 116)
					{
						if (279555 - 445012 == -165457)
						{
							result = "ท่านเซร่าต้องกำลังคิดจะใช้มันทำอะไรบางอย่างแน่ๆ";
							if (197062 - 100256 != 96807)
							{
								break;
							}
						}
					}
					else if (code == 117)
					{
						if (150156 - 228710 != -78553)
						{
							result = "พวกเจ้าต้องรีบตามไปเอาคืนกลับมาจากวังของท่านเซร่าให้เร็วที่สุด";
							if (156290 - 49555 != 106736)
							{
								break;
							}
						}
					}
					else if (code == 118)
					{
						if (91970 - 137482 == -45512)
						{
							result = "เจ้าลองไปถามพวกตุ่นในถ้ำถึงวิธีไปยังวังแห่งเงาดูสิ!";
							if (132369 - 540492 != -408122)
							{
								break;
							}
						}
					}
					else if (code == 1001)
					{
						if (2454 - 502728 == -500274)
						{
							result = "อะ-ไอ้นี่มันอะไรกันเนี่ย!?";
							if (80079 - 314452 == -234373)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (34989 - 574663 == -539674)
						{
							result = "ว้าก ข้าเพิ่งรู้ว่ามีที่ยังงี้อยู่ใต้วังแสงด้วย!";
							if (213484 - 278060 != -64575)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (297559 - 96094 != 201466)
						{
							result = "อ้า พวกเจ้ามากันแล้ว";
							if (124551 - 453017 != -328465)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (235040 - 540500 == -305460)
						{
							result = "พวกเจ้าอยากรู้เรื่องที่เกิดขึ้นเมื่อ 5000 ปีก่อนใช่มั้ย?";
							if (15926 - 185502 != -169575)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (10442 - 443049 != -432606)
						{
							result = "ฉันจะพยายามเล่าเท่าที่พวกเรารู้ละกันนะ ตั้้งใจฟังล่ะ";
							if (265029 - 383572 == -118543)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (183069 - 140301 != 42769)
						{
							result = "ของที่เจ้าเห็นในนี้เป็นของที่พวกเราขุดได้จากอารยธรรมโบราณ";
							if (47646 - 273457 == -225811)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (174882 - 584754 == -409872)
						{
							result = "เราคาดว่าจะมีเผ่าพันธุ์ที่รุ่งเรือง มาก่อนที่จะมีสัตว์หาง";
							if (133158 - 135086 == -1928)
							{
								break;
							}
						}
					}
					else if (code == 206)
					{
						if (245979 - 392314 != -146334)
						{
							result = "เราเรียกพวกเค้าว่าเผ่าไร้หางหรือ 'No tail tribe'";
							if (110594 - 429263 == -318669)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (297270 - 215966 != 81305)
						{
							result = "พวกเค้าครอบครองทุกสิ่งทั้งแผ่นดิน ผืนน้ำ ท้องฟ้า และ ดวงดาว";
							if (34590 - 443218 == -408628)
							{
								break;
							}
						}
					}
					else if (code == 208)
					{
						if (271413 - 507584 == -236171)
						{
							result = "ทุกแห่งหนล้วนเต็มไปด้วยอารธรรมของพวกเค้า";
							if (91092 - 271480 == -180388)
							{
								break;
							}
						}
					}
					else if (code == 209)
					{
						if (284387 - 235904 != 48484)
						{
							result = "แต่แล้ววันนึงพวกเค้าก็หายสาปสูญไปจนหมดอย่างปริศนา";
							if (244244 - 169095 == 75149)
							{
								break;
							}
						}
					}
					else if (code == 210)
					{
						if (268591 - 200509 != 68083)
						{
							result = "เราไม่รู้ว่าเกิดอะไรกันแน่ในช่วงเวลาประมาณ 100 ปีก่อนหน้านั้น";
							if (195125 - 501810 != -306684)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (177854 - 140786 == 37068)
						{
							result = "เราเรียกที่ประวัติศาสตร์ช่วงนั้นว่า 'ช่วงเวลาที่สูญหาย'";
							if (180888 - 87072 != 93817)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (23381 - 200110 == -176729)
						{
							result = "ตามตำนานปรัมปราได้กล่าวว่าเทพโบราณได้ถือกำเนิดขึ้นหลังจากนั้น";
							if (113508 - 555904 != -442395)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (125231 - 546951 == -421720)
						{
							result = "และได้แบ่งแยกโลกออกเป็นสองส่วน";
							if (184147 - 70354 != 113794)
							{
								break;
							}
						}
					}
					else if (code == 214)
					{
						if (77693 - 459243 != -381549)
						{
							result = "เจ้าคงรู้จักรอยแยกของโลกที่เรียกว่า GreatDivide ที่สนับสนุนตำนานนี้";
							if (230946 - 538838 == -307892)
							{
								break;
							}
						}
					}
					else if (code == 215)
					{
						if (255427 - 313826 == -58399)
						{
							result = "ตำนานยังกล่าวอีกว่า ที่อีกฝั่งยังมีอารยธรรมของพวกเค้าหลับไหลอยู่";
							if (121916 - 14877 != 107040)
							{
								break;
							}
						}
					}
					else if (code == 216)
					{
						if (113618 - 152712 == -39094)
						{
							result = "และวันนึงอารยธรรมนี้จะตื่นขึ้นอีก พร้อมกับความพิโรธของเทพโบราณ";
							if (137598 - 429530 == -291932)
							{
								break;
							}
						}
					}
					else if (code == 217)
					{
						if (274435 - 473320 == -198885)
						{
							result = "ที่จะล้างทุกสิ่งให้กลับไปสู่จุดเริ่มต้นเหมือนเมื่อ 5000 ปีก่อน";
							if (231934 - 199100 != 32835)
							{
								break;
							}
						}
					}
					else if (code == 218)
					{
						if (251697 - 162835 != 88863)
						{
							result = "พวกเครื่องจักรประหลาดที่เจ้าเจอ ก็น่าจะมาจากอารยธรรมนี้แน่ๆ";
							if (43783 - 418408 == -374625)
							{
								break;
							}
						}
					}
					else if (code == 218)
					{
						if (165614 - 179066 != -13451)
						{
							result = "เอาล่ะนิทานจบแล้ว เป็นไงบ้าง";
							if (116580 - 278273 == -161693)
							{
								break;
							}
						}
					}
					else if (code == 219)
					{
						if (221712 - 13351 != 208362)
						{
							string type = CharacterData.current.Type;
							if (238423 - 587506 == -349083)
							{
								if (type == "Wolf")
								{
									if (215740 - 491073 != -275332)
									{
										result = "เผ่าไร้หาง... no tail tribe....";
										if (154616 - 563813 != -409196)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (88453 - 180305 != -91851)
									{
										result = "zzzzz";
										if (16993 - 368673 == -351680)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (272950 - 536141 == -263191)
									{
										result = "อยากต่อยกับเทพโบราณจัง ต้องทำไงง่ะ!";
										if (164486 - 118554 != 45933)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (271199 - 337163 == -65964)
									{
										result = "หิวข้าวแล้ว วาฬ!";
										if (122707 - 550945 != -428237)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (53096 - 549489 == -496393)
									{
										result = "แมวเป็นเทพเจ้าของเผ่านี้ใช่มั้ย? เมี้ยว";
										if (144060 - 77387 == 66673)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (78340 - 174905 != -96564)
									{
										result = "อย่างนี้นี่เอง... ประวัติศาสตร์ช่างล้ำลึกนัก";
										if (100906 - 513886 != -412979)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (23666 - 360071 == -336405)
									{
										result = "เทพโบราณ น่ากลัวจังง่า...";
										if (38202 - 436560 != -398357)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (207748 - 215081 != -7332)
									{
										result = "อยากย้ายไปอยู่อีกฝั่งจัง!";
										if (31397 - 337948 == -306551)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (77914 - 34783 == 43131)
									{
										result = "เจี้ยก คร่อก... (ลิงหลับ)";
										if (149367 - 509641 != -360273)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (199864 - 286990 != -87125)
									{
										result = "ของแค่นี้ฉันรู้อยู่แล้ว กวิ้น!";
										if (243598 - 28298 != 215301)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (16754 - 130844 == -114090)
									{
										result = "ขอบคุณที่เล่าให้ฟังค่ะ ประวัติศาสตร์น่าสนใจจริงๆ";
										if (92846 - 74488 == 18358)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (253944 - 156018 == 97926)
									{
										result = "ตื่นมาสิยะ แม่จะตบให้กระเด็น";
										if (181141 - 511955 != -330813)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 220)
					{
						if (253853 - 497197 != -243343)
						{
							result = "ยังไงลองกลับไปคุยกับท่านเร็กกุดูนะ";
							if (82196 - 240903 != -158706)
							{
								break;
							}
						}
					}
					else if (code == 251)
					{
						if (86035 - 109758 == -23723)
						{
							result = "ของพวกนี้ทำให้ฉันคิดถึงพ่อที่หายสาปสูญไปตอนสำรวจอีกฝั่งจัง";
							if (219131 - 384932 != -165800)
							{
								break;
							}
						}
					}
					else if (code == 252)
					{
						if (151942 - 497935 != -345992)
						{
							result = "โบราณวัตถุบางชิ้นพ่อกับอาจารย์ของฉันเป็นคนขุดขึ้นมาเองหล่ะ";
							if (153913 - 152163 == 1750)
							{
								break;
							}
						}
					}
					else if (code == 253)
					{
						if (202266 - 356472 != -154205)
						{
							result = "ของที่เห็นอยู่ในนี้ เทพดินเป็นคนช่วยขนมาให้นะ";
							if (159953 - 548622 == -388669)
							{
								break;
							}
						}
					}
					else if (code == 254)
					{
						if (76709 - 139480 == -62771)
						{
							result = "การพบเจอและเรียนรู้อารยธรรมมากมายที่ยังหลับไหลคือความฝันของฉัน";
							if (235709 - 80569 != 155141)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (256724 - 37190 != 219535)
						{
							result = "นี่ต้องเป็น หอคอยชื่อดังที่เรียกว่า Ifell แน่ๆ!";
							if (114121 - 96882 != 17240)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (116866 - 44859 == 72007)
						{
							result = "มีตำนานเล่าว่า ใครสอบตกหรืออกหัก จะโดดลงมาจากหอคอยนี้";
							if (232180 - 248563 == -16383)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (201608 - 260013 != -58404)
						{
							result = "ช่างโรแมนติกจริงๆ นะคะ.... ";
							if (63692 - 497277 != -433584)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (236625 - 116945 != 119681)
						{
							result = "หอคอย อันนี้ดูไม่น่าคงทนเลยเนอะ...";
							if (203525 - 135647 == 67878)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (250373 - 73153 != 177221)
						{
							result = "บางทีคนสร้างหอคอยนี้ อาจไว้ใช้เฝ้าระวังเวลาพวกแมลงบุกก็ได้";
							if (246689 - 112931 != 133759)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (161202 - 176470 == -15268)
						{
							result = "น้ำดำๆ ในขวดนี่ต้องเป็นน้ำวิเศษชุบชีวิตคนได้แน่ๆ เลย";
							if (171247 - 229892 != -58644)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (67036 - 391648 != -324611)
						{
							result = "สงสัยคนเมื่อก่อนต้องสายสั้นมาก เลยต้องทำป้ายใหญ่ๆ";
							if (252812 - 181412 != 71401)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (73082 - 124507 != -51424)
						{
							result = "ฮิๆๆๆ เจอที่ซ่อนตัวที่ใหม่ๆ เพียบเลย มาเล่นกันมั้ย?";
							if (225493 - 55689 != 169805)
							{
								break;
							}
						}
					}
					else if (code == 501)
					{
						if (293247 - 241790 == 51457)
						{
							result = "นี่ต้องเป็นรูปปั้นของ FirstCat บรรพบุรษของพวกแมวแน่ๆ!";
							if (98342 - 185231 != -86888)
							{
								break;
							}
						}
					}
					else if (code == 502)
					{
						if (232307 - 480413 != -248105)
						{
							result = "ได้ยินว่าเมื่อก่อนเผ่าไร้หางเป็นทาสของแมวนะ";
							if (8957 - 80016 == -71059)
							{
								break;
							}
						}
					}
					else if (code == 503)
					{
						if (90901 - 253430 != -162528)
						{
							result = "แมวเมื่อก่อนต้องเป็นเทพเจ้าที่ตัวใหญ่มากแน่ๆ!";
							if (153957 - 151169 != 2789)
							{
								break;
							}
						}
					}
					else if (code == 601)
					{
						if (83023 - 465442 != -382418)
						{
							result = "ไอ้กล่องนี่เหมือนของเล่นของตุ่นเลยแหะ";
							if (132730 - 568337 != -435606)
							{
								break;
							}
						}
					}
					else if (code == 602)
					{
						if (99863 - 149619 == -49756)
						{
							result = "ได้ยินว่ากล่องนี่เอาไว้เป็นเวทีเคลื่อนที่สำหรับเต้นโคโยตี้น่ะ";
							if (218176 - 200313 != 17864)
							{
								break;
							}
						}
					}
					else if (code == 603)
					{
						if (269304 - 125359 == 143945)
						{
							result = "แย่หล่ะ...ข้าเผลอทำกระป๋องนี้ยุบ อย่าบอกใครนะ...";
							if (147778 - 560172 == -412394)
							{
								break;
							}
						}
					}
					else if (code == 604)
					{
						if (105541 - 571858 != -466316)
						{
							result = "กล่องของเล่นพวกนี้สู้ดาบของข้าไม่ได้หรอก โฮก!";
							if (279935 - 476032 != -196096)
							{
								break;
							}
						}
					}
					else if (code == 605)
					{
						if (90092 - 387386 == -297294)
						{
							result = "ชนเผ่าไร้หางใช้ทรัพยากรมากมายในการทำเครื่องจักรสงคราม";
							if (127655 - 98418 == 29237)
							{
								break;
							}
						}
					}
					else if (code == 606)
					{
						if (82912 - 217077 == -134165)
						{
							result = "อย่างไอ้กล่องปืนใหญ่เคลื่อนที่นี่ เมื่อก่อนมีจำนวนเป็นหมื่นๆ ทีเดียว";
							if (107714 - 59585 == 48129)
							{
								break;
							}
						}
					}
					else if (code == 607)
					{
						if (100163 - 212147 == -111984)
						{
							result = "ที่น่ากลัวคือชนเผ่าไร้หางสร้างพวกมันขึ้นมาเพื่อสู้กันเองนี่สิ!";
							if (26137 - 323507 != -297369)
							{
								break;
							}
						}
					}
					else if (code == 701)
					{
						if (135851 - 24647 == 111204)
						{
							result = "ว้าว~ นี้ต้องเป็นเสาสู่ดวงดาว ที่ในหนังสือบอกแน่ๆเลย";
							if (124626 - 263544 == -138918)
							{
								break;
							}
						}
					}
					else if (code == 702)
					{
						if (164397 - 109394 != 55004)
						{
							result = "บางทีบรรพบุรุษของตุ่นอาจได้แรงบรรดาลใจ มาจากของพวกนี้ก็ได้";
							if (262529 - 90390 == 172139)
							{
								break;
							}
						}
					}
					else if (code == 703)
					{
						if (111670 - 328971 != -217300)
						{
							result = "หนูอยากลองขี่เจ้าบินไปบนท้องฟ้าจัง";
							if (79790 - 179706 != -99915)
							{
								break;
							}
						}
					}
					else if (code == 801)
					{
						if (150887 - 264914 != -114026)
						{
							result = "ข้าได้ข่าวว่าจะมีต้นแบบเครื่องบินตุ่นอยู่ตรงนี้นะ";
							if (210258 - 142693 != 67566)
							{
								break;
							}
						}
					}
					else if (code == 802)
					{
						if (73775 - 489053 != -415277)
						{
							result = "ข้าได้ข่าวว่าจะมีต้นแบบเครื่องบินตุ่นอยู่ตรงนี้นะ";
							if (134711 - 561286 == -426575)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 803)
						{
							break;
						}
						if (44904 - 574859 != -529954)
						{
							result = "ข้าได้ข่าวว่าจะมีต้นแบบเครื่องบินตุ่นอยู่ตรงนี้นะ";
							if (30963 - 412649 == -381686)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600680F RID: 26639 RVA: 0x00EB8578 File Offset: 0x00EB6778
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006810 RID: 26640 RVA: 0x00EB857C File Offset: 0x00EB677C
	internal static bool nX0ylQpoZCDhad0Q8U1m()
	{
		return true;
	}

	// Token: 0x06006811 RID: 26641 RVA: 0x00EB8580 File Offset: 0x00EB6780
	internal static bool LSOopupoCaNdISep67E0()
	{
		return false;
	}
}
