using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x0200119F RID: 4511
[Serializable]
public class M903_ShadowPalace_thai : MonoBehaviour
{
	// Token: 0x0600681C RID: 26652 RVA: 0x00EB8928 File Offset: 0x00EB6B28
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M903_ShadowPalace_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600681D RID: 26653 RVA: 0x00EB8938 File Offset: 0x00EB6B38
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (83929 - 485978 != -402049)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (240529 - 296853 != -56323 && 120305 - 394412 != -274106)
			{
				if (code == 101)
				{
					if (182685 - 423551 == -240866)
					{
						string type = CharacterData.current.Type;
						if (234768 - 266288 != -31519)
						{
							if (type == "Wolf")
							{
								if (217045 - 452583 != -235537)
								{
									result = "นี่คงเป็นประตูทางเข้าวังเทพเงาเซร่าสินะ";
									if (185970 - 354347 != -168376)
									{
										break;
									}
								}
							}
							else if (type == "Bison")
							{
								if (102035 - 167266 == -65231)
								{
									result = "โฮก! (ได้พังวังเทพเงาเซร่าเล่นแล้ว!)";
									if (59572 - 574607 != -515034)
									{
										break;
									}
								}
							}
							else if (type == "Panda")
							{
								if (298722 - 226014 != 72709)
								{
									result = "(..อว๋า ประตูวังเทพเงาเซร่าใหญ่งี้ เราเปิดไหวมั้ยนะ)";
									if (21125 - 385073 == -363948)
									{
										break;
									}
								}
							}
							else if (type == "Whale")
							{
								if (295970 - 509143 == -213173)
								{
									result = "ประตูวังเทพเงาเซร่า.. อยากให้ทุกประตูใหญ่งี้จัง";
									if (9097 - 313933 != -304835)
									{
										break;
									}
								}
							}
							else if (type == "Cat")
							{
								if (222405 - 378606 == -156201)
								{
									result = "ฮืม ถึงวังเทพเซร่าแล้ว กดกริ่งที่ไหนเนี่ย";
									if (221458 - 171471 == 49987)
									{
										break;
									}
								}
							}
							else if (type == "Chameleon")
							{
								if (192399 - 477958 == -285559)
								{
									result = "นี่คงเป็นประตูทางเข้าปราสาทเทพเงาเซร่าสินะ";
									if (21518 - 466699 == -445181)
									{
										break;
									}
								}
							}
							else if (type == "Rabbit")
							{
								if (63740 - 454713 != -390972)
								{
									result = "ถึงวังเทพเงาแล้ว น่ากลัวจังง่า...";
									if (123661 - 291282 == -167621)
									{
										break;
									}
								}
							}
							else if (type == "Mole")
							{
								if (282846 - 401606 == -118760)
								{
									result = "(เห็นประตูวังเทพเงามาตั้งแต่เด็ก ไม่เคยเข้าไปเลยแหะ)";
									if (5872 - 39626 == -33754)
									{
										break;
									}
								}
							}
							else if (type == "Monkey")
							{
								if (73934 - 104100 != -30165)
								{
									result = "นี่คงเป็นประตูทางเข้าวังเทพเงาเซร่าสินะ เจี้ยก";
									if (125907 - 557392 != -431484)
									{
										break;
									}
								}
							}
							else if (type == "Penguin")
							{
								if (200521 - 165717 == 34804)
								{
									result = "ประตูเข้าวังเทพเงาเซร่า.. น่ากลัวจัง กวิ้น!";
									if (35090 - 194188 != -159097)
									{
										break;
									}
								}
							}
							else if (type == "Sheep")
							{
								if (2526 - 342449 == -339923)
								{
									result = "(นี่คงเป็นประตูทางเข้าวังเทพเงาเซร่าสินะคะ)";
									if (278182 - 489059 != -210876)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type == "Bat"))
								{
									break;
								}
								if (108183 - 445391 == -337208)
								{
									result = "(ฮ้า ไม่ได้มาวังท่านเทพเงาเซร่าตั้งนานนะเรา)";
									if (121812 - 442630 != -320817)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 201)
				{
					if (246499 - 88253 != 158247)
					{
						result = "หยุดก่อน! พวกเจ้าคือพวกผู้กล้าจากเมืองแสงนี่ยะ";
						if (180198 - 335470 != -155271)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (97842 - 530966 == -433124)
					{
						result = "ท่านเซร่า สั่งลัทธิเงาให้ประกาศสงครามกับพวกเจ้าแล้ว";
						if (84854 - 549624 != -464769)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (122648 - 241238 != -118589)
					{
						result = "ไบสัน! โฮก! (กลับไปซะ หรืออยากโดนขวานจามหัวก่อน!)";
						if (139995 - 206830 == -66835)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (285214 - 115547 != 169668)
					{
						result = "เชอะ ไงเจ้าก็เข้าไปไม่ถึงปราสาทจริงๆ หรอกย่ะ";
						if (280831 - 45936 == 234895)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (297709 - 126101 != 171609)
					{
						result = "ท่านเซร่าร่ายเวทลวงตาปกป้องปราสาทจากผู้บุกรุกไว้แล้ว";
						if (104443 - 589917 == -485474)
						{
							break;
						}
					}
				}
				else if (code == 303)
				{
					if (104132 - 4379 == 99753)
					{
						result = "ไบสัน! (ใช่ๆ ข้ายังหลงทุกที ต้องมาเฝ้าข้างหน้านี่แหละ)";
						if (255100 - 228573 != 26528)
						{
							break;
						}
					}
				}
				else if (code == 401)
				{
					if (11541 - 407771 == -396230)
					{
						string type2 = CharacterData.current.Type;
						if (159753 - 176464 == -16711)
						{
							if (type2 == "Wolf")
							{
								if (82013 - 208692 != -126678)
								{
									result = "...กระจกบานนี้ไม่เหมือนอันอื่น อาจจะเป็นทางออกก็ได้";
									if (299073 - 215438 != 83636)
									{
										break;
									}
								}
							}
							else if (type2 == "Bison")
							{
								if (157659 - 494744 != -337084)
								{
									result = "โฮก!?..(กระจกสีแดง อย่างนี้ต้องชน!)";
									if (263943 - 103913 == 160030)
									{
										break;
									}
								}
							}
							else if (type2 == "Panda")
							{
								if (176183 - 403415 != -227231)
								{
									result = "อ๊ะ กระจกอันนี้ต่างไปแหะ";
									if (5188 - 105867 != -100678)
									{
										break;
									}
								}
							}
							else if (type2 == "Whale")
							{
								if (170193 - 597955 != -427761)
								{
									result = "(ดีใจ กระจกใบใหญ่! ไม่คับตัวแล้ว!)";
									if (39369 - 250513 == -211144)
									{
										break;
									}
								}
							}
							else if (type2 == "Cat")
							{
								if (3773 - 528424 == -524651)
								{
									result = "กระจกบานนี้ไม่เหมือนอันอื่น อาจจะเป็นทางออกก็ได้";
									if (289351 - 129730 == 159621)
									{
										break;
									}
								}
							}
							else if (type2 == "Chameleon")
							{
								if (38367 - 356832 != -318464)
								{
									result = "กระจกบานนี้ไม่เหมือนอันอื่น อาจจะเป็นทางออกก็ได้";
									if (64401 - 592609 != -528207)
									{
										break;
									}
								}
							}
							else if (type2 == "Rabbit")
							{
								if (59023 - 380312 == -321289)
								{
									result = "กระจกบานนี้ไม่เหมือนอันอื่น อาจจะเป็นทางออกก็ได้";
									if (267922 - 135248 == 132674)
									{
										break;
									}
								}
							}
							else if (type2 == "Mole")
							{
								if (130096 - 336286 == -206190)
								{
									result = "กระจกบานนี้ไม่เหมือนอันอื่น อาจจะเป็นทางออกก็ได้";
									if (213892 - 585637 != -371744)
									{
										break;
									}
								}
							}
							else if (type2 == "Monkey")
							{
								if (118470 - 597715 == -479245)
								{
									result = "นี่คงเป็นทางออกสินะ ไม่เนียนเลย เจี๊ยก";
									if (38262 - 316168 == -277906)
									{
										break;
									}
								}
							}
							else if (type2 == "Penguin")
							{
								if (54229 - 140283 != -86053)
								{
									result = "นี่คงเป็นทางออกสินะ ไม่เนียนเลย กวิ้น!";
									if (9389 - 46432 == -37043)
									{
										break;
									}
								}
							}
							else if (type2 == "Sheep")
							{
								if (113491 - 263542 == -150051)
								{
									result = "...กระจกบานนี้ไม่เหมือนอันอื่น อาจจะเป็นทางออกก็ได้ค่ะ";
									if (251698 - 268644 != -16945)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type2 == "Bat"))
								{
									break;
								}
								if (185537 - 26560 == 158977)
								{
									result = "นี่คงเป็นทางออกสินะ ไม่เนียนเลย";
									if (146638 - 287414 == -140776)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 501)
				{
					if (164541 - 594360 == -429819)
					{
						result = "ทางวาร์ปนี่จะต้องเป็นทางออกแน่ๆ เลย!";
						if (166010 - 162882 == 3128)
						{
							break;
						}
					}
				}
				else if (code == 601)
				{
					if (41193 - 530500 != -489306)
					{
						result = "ลัทธิเงาเป็นกลุ่มกองของพวกที่เชื่อในความมืด";
						if (40919 - 130945 != -90025)
						{
							break;
						}
					}
				}
				else if (code == 602)
				{
					if (112124 - 102753 != 9372)
					{
						result = "พวกเค้าฟังแต่คำสั่งของท่านเทพเงาเซร่าเท่านั้นแหละ";
						if (182363 - 400678 == -218315)
						{
							break;
						}
					}
				}
				else if (code == 606)
				{
					if (251424 - 380986 != -129561)
					{
						result = "ฉันยังอยากเข้าลัทธิมืดเลย ก็ชุดสวยกว่าตั้งเยอะนี่";
						if (181010 - 95838 == 85172)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 607)
					{
						break;
					}
					if (167391 - 389316 == -221925)
					{
						result = "พวกลัทธิเงาไม่ใช่คนไม่ดีนะ แค่พวกเค้ามีความคิดที่ต่างไปเอง";
						if (284562 - 461325 == -176763)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600681E RID: 26654 RVA: 0x00EB94DC File Offset: 0x00EB76DC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600681F RID: 26655 RVA: 0x00EB94E0 File Offset: 0x00EB76E0
	internal static bool jfRcUgpoMJ3ZxrwpYjtT()
	{
		return true;
	}

	// Token: 0x06006820 RID: 26656 RVA: 0x00EB94E4 File Offset: 0x00EB76E4
	internal static bool TMLg1ipoxSWoKmWcyoSn()
	{
		return false;
	}
}
