using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011A3 RID: 4515
[Serializable]
public class M907_ZerasHiddenPlan_thai : MonoBehaviour
{
	// Token: 0x06006830 RID: 26672 RVA: 0x00EBA4C8 File Offset: 0x00EB86C8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M907_ZerasHiddenPlan_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006831 RID: 26673 RVA: 0x00EBA4D8 File Offset: 0x00EB86D8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (52499 - 262252 != -209752)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (231797 - 329147 != -97349)
			{
				if (19368 - 418704 == -399336)
				{
					if (code == 101)
					{
						if (45159 - 36809 != 8351)
						{
							string type = CharacterData.current.Type;
							if (261773 - 418603 == -156830)
							{
								if (type == "Wolf")
								{
									if (164407 - 206635 != -42227)
									{
										result = "...สำเร็จ เราได้ชิ้นส่วนเทพโบราณคืนมาแล้ว";
										if (43898 - 570763 != -526864)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (8777 - 334744 == -325967)
									{
										result = "... (นี่ข้าชนะเทพได้รึนี่!!)";
										if (20226 - 587697 != -567470)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (216786 - 438951 == -222165)
									{
										result = "ฮึ! หมัดแพนด้า ฆ่าได้แม้แต่เงา";
										if (50581 - 299636 != -249054)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (173404 - 573373 == -399969)
									{
										result = "ได้ชิ้นส่วนเทพโบราณคืนมาแล้ว วาฬ!";
										if (295324 - 401337 != -106012)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (29867 - 566365 != -536497)
									{
										result = "เทพเงาไม่เก๋าอย่างที่คิดเลย เมี๊ยว!";
										if (217882 - 162591 == 55291)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (130639 - 447978 == -317339)
									{
										result = "...สำเร็จ เราได้ชิ้นส่วนเทพโบราณคืนมาแล้ว";
										if (58307 - 326466 != -268158)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (228902 - 599977 != -371074)
									{
										result = "ว้ายๆ หนูฆ่าเทพเงาได้แล้ว";
										if (138724 - 40440 != 98285)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (110281 - 110852 != -570)
									{
										result = "ได้ชิ้นส่วนเทพโบราณคืนมาแล้ว ตุ่น!";
										if (93448 - 474983 != -381534)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (204497 - 39800 == 164697)
									{
										result = "ได้ชิ้นส่วนเทพโบราณคืนมาแล้ว เจี๊ยก";
										if (35185 - 435125 == -399940)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (51501 - 17341 != 34161)
									{
										result = "ได้ชิ้นส่วนเทพโบราณคืนมาแล้ว กวิ้น!";
										if (291142 - 165417 == 125725)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (34192 - 231325 != -197132)
									{
										result = "...เงาอาจจะอยู่ในทุกสิ่ง แต่ขอเพียงเราเชื่อในแสงสว่าง";
										if (142541 - 35440 == 107101)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (176794 - 590333 == -413539)
									{
										result = "ไม่น่าเชื่อนี่ชั้นชนะเทพเงาได้เชียวรึนี่";
										if (139447 - 26823 != 112625)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 102)
					{
						if (79307 - 457700 == -378393)
						{
							string type2 = CharacterData.current.Type;
							if (216759 - 342685 != -125925)
							{
								if (type2 == "Wolf")
								{
									if (100986 - 190655 != -89668)
									{
										result = "เป็นเพราะทุกหางร่วมมือกันแท้ๆ";
										if (41441 - 45479 != -4037)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (234998 - 5605 == 229393)
									{
										result = "(ข้าคงดูถูกพลังกล้ามตัวเองมากเกินไป โฮก!)";
										if (247338 - 212315 != 35024)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (113731 - 478963 != -365231)
									{
										result = "อิๆ ไปท้าเทพไฟสู้ต่อดูดีกว่า";
										if (90099 - 177397 != -87297)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (157186 - 521011 != -363824)
									{
										result = "รีบกลับไปกินข้าวดีกว่าพวกเรา หิวแล้ว";
										if (111744 - 471037 != -359292)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (268159 - 230384 != 37776)
									{
										result = "เอาชิ้นส่วนเทพโบราณกลับไปคืนดีกว่า";
										if (269737 - 376615 != -106877)
										{
											break;
										}
									}
								}
								else if (type2 == "Chameleon")
								{
									if (5365 - 327332 == -321967)
									{
										result = "รีบเอาของอันตรายอย่างนี้ กลับไปคืนวิหารดีกว่า";
										if (105307 - 592000 == -486693)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (108641 - 528653 != -420011)
									{
										result = "รีบเอาชิ้นส่วนเทพโบราณกลับไปคืนดีกว่า";
										if (179724 - 234309 == -54585)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (274692 - 360278 == -85586)
									{
										result = "ขนาดแค่ส่วนเดียว ยังมีอานุภาพขนาดนี้ น่ากลัวจริง..";
										if (2489 - 496209 != -493719)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (63277 - 471681 == -408404)
									{
										result = "รีบเอากลับไปคืน แล้วไปหากล้วยทานดีกว่า";
										if (229567 - 30337 == 199230)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (268665 - 27334 == 241331)
									{
										result = "ขนาดส่วนเดียว ยังน่ากลัวขนาดนี้เลย..";
										if (117353 - 353599 == -236246)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (100967 - 38758 == 62209)
									{
										result = "โลกเราจะต้องพบกับสิ่งที่ดีกว่า แน่นอนค่ะ";
										if (9432 - 63174 != -53741)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (150659 - 555531 != -404871)
									{
										result = "ยังงี้ชั้นก็ได้เป็นเทพแทนละสิ โฮะๆๆ";
										if (96451 - 196855 != -100403)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 103)
					{
						if (274969 - 468818 == -193849)
						{
							result = "หึๆ อิทารุสเอ๋ย เจ้าจะซ่อนตัวไปถึงไหน";
							if (248510 - 74626 != 173885)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (164686 - 93511 == 71175)
						{
							result = "...เป็นละครที่สนุกมากท่านเซร่า";
							if (170949 - 223076 == -52127)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (178636 - 23565 != 155072)
						{
							result = "ท่านตบตาข้าไม่ได้หรอก ท่านมีแผนอะไรกันแน่";
							if (156388 - 230933 != -74544)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (6656 - 67794 != -61137)
						{
							result = "ตอนนี้เหล่าผู้กล้าแห่งแสงคงจะไปบอกทุกคนว่าข้าตายแล้ว";
							if (255084 - 404019 != -148934)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (86612 - 566038 == -479426)
						{
							result = "แผนการที่แท้จริงของข้า ก็จะได้เริ่มต้นขึ้นซะที";
							if (708 - 30277 != -29568)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (116562 - 428785 == -312223)
						{
							result = "แล้วถ้าข้านำเรื่องนี้ไปเปิดโปงล่ะ ท่านจะทำยังไง?";
							if (152716 - 220217 == -67501)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (145342 - 270373 != -125030)
						{
							result = "เจ้าเหยี่ยวผู้ทรนงเอ๋ย เจ้าไม่ทำเช่นนั้นหรอก";
							if (269490 - 398553 == -129063)
							{
								break;
							}
						}
					}
					else if (code == 110)
					{
						if (239130 - 341209 != -102078)
						{
							result = "เพราะหนึ่งในจุดมุ่งหมายของแผนข้าคือพาตัวเจ้ามาที่นี่";
							if (22858 - 396770 != -373911)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (89263 - 192783 == -103520)
						{
							result = "ข้ารู้และข้าเห็นเงาแห่งจิตใจเจ้า ข้าแน่ใจว่าเจ้าจะฟังข้า";
							if (241079 - 522766 == -281687)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (23602 - 65981 == -42379)
						{
							result = "ไร้สาระสิ้นดี! ท่านคิดว่าข้าจะทรยศท่านอัลคาเซียรึ!";
							if (95963 - 238356 == -142393)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (105285 - 47360 != 57926)
						{
							result = "พอแล้ว ถ้าท่านคิดว่าจะหยุดข้าได้ก็ลองดู";
							if (257444 - 158614 == 98830)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (118439 - 459301 == -340862)
						{
							result = "หึๆ แสงสว่างที่จ้าเกินไปมีแต่จะทำให้ตามืดบอด";
							if (251276 - 148688 == 102588)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (45384 - 341110 != -295725)
						{
							result = "หลายครั้ง ความจริงก็หาได้แต่ในความมืดเท่านั้น";
							if (298037 - 23528 != 274510)
							{
								break;
							}
						}
					}
					else if (code == 116)
					{
						if (143833 - 73127 == 70706)
						{
							result = "ถ้าเจ้าอยากช่วยอัลคาเซียแล้ว เจ้ามีแต่จะต้องฟังข้าเท่านั้น";
							if (215809 - 87261 != 128549)
							{
								break;
							}
						}
					}
					else if (code == 117)
					{
						if (94356 - 401410 == -307054)
						{
							result = "!!!?";
							if (232957 - 418669 != -185711)
							{
								break;
							}
						}
					}
					else if (code == 118)
					{
						if (4501 - 355318 != -350816)
						{
							result = "เจ้าคิดว่าเจ้าสามารถฝากความหวังไว้กับพวกผู้กล้าได้รึ";
							if (86256 - 566213 != -479956)
							{
								break;
							}
						}
					}
					else if (code == 119)
					{
						if (74186 - 411691 == -337505)
						{
							result = "...แต่สิ่งที่ท่านอัลคาเซียทำนายนั้นไม่เคยพลาด";
							if (201552 - 539938 == -338386)
							{
								break;
							}
						}
					}
					else if (code == 120)
					{
						if (37546 - 238048 != -200501)
						{
							result = "ฮ่าๆๆ แน่นอน แต่เจ้าแน่ใจรึว่าอัลคาเซียจะบอกเจ้าทุกอย่าง";
							if (174908 - 537344 != -362435)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (147831 - 526827 != -378995)
						{
							result = "ตราบใดยังมีเงา ข้าก็สามารถมองทะลุจิตใจสิ่งมีชีวิตได้ทั้งหมด";
							if (214828 - 589578 != -374749)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (172359 - 421893 != -249533)
						{
							result = "อิทารุส เจ้าคือหางที่เคารพและรักอัลคาเซียมากที่สุด";
							if (213664 - 301951 != -88286)
							{
								break;
							}
						}
					}
					else if (code == 123)
					{
						if (27383 - 145889 != -118505)
						{
							result = "แต่หากเจ้าอยากจะช่วยนางจริงๆ ละก็..";
							if (143998 - 367872 != -223873)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 124)
						{
							break;
						}
						if (91209 - 114162 != -22952)
						{
							result = "ลองฟังเรื่องราวที่นางปกปิดเจ้าไว้เถิด";
							if (116423 - 321260 != -204836)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006832 RID: 26674 RVA: 0x00EBB364 File Offset: 0x00EB9564
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006833 RID: 26675 RVA: 0x00EBB368 File Offset: 0x00EB9568
	internal static bool w4jKf3podPPAqU6iebcn()
	{
		return true;
	}

	// Token: 0x06006834 RID: 26676 RVA: 0x00EBB36C File Offset: 0x00EB956C
	internal static bool QWnZgDpoJC4rMejr4Je7()
	{
		return false;
	}
}
