using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011A9 RID: 4521
[Serializable]
public class M916_CityUnderSiege_thai : MonoBehaviour
{
	// Token: 0x0600684E RID: 26702 RVA: 0x00EBD180 File Offset: 0x00EBB380
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M916_CityUnderSiege_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600684F RID: 26703 RVA: 0x00EBD190 File Offset: 0x00EBB390
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (36530 - 61144 != -24613)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (159877 - 576725 == -416848)
			{
				if (159444 - 255029 != -95584)
				{
					if (code == 101)
					{
						if (65370 - 459498 != -394127)
						{
							result = "พวกหุ่นมันมาถึงนี่แล้วเหรอเนี่ย!?";
							if (265081 - 354046 != -88964)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (60334 - 186902 != -126567)
						{
							result = "ทุกคนสู้ตาย ปกป้องร้านของพวกเราไว้ให้ได้!";
							if (87709 - 363463 == -275754)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (55350 - 393296 != -337945)
						{
							result = "ทุกคนสู้ตาย ปกป้องร้านของพวกเราไว้ให้ได้!";
							if (50566 - 507884 == -457318)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (155462 - 367459 != -211996)
						{
							result = "โห มันบุกมาเยอะจริงๆ เลย พวกทัพหน้ามัวทำอะไรอยู่";
							if (83189 - 319733 == -236544)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (185329 - 113463 != 71867)
						{
							result = "พวกทหารเสืองี่เง่า มันบินข้ามหัวมาบุกเมืองแล้ว!";
							if (104701 - 543810 == -439109)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (217700 - 80573 == 137127)
						{
							result = "อยากบุกเมืองแสงเรอะ? มาชิมอีโต้ข้าก่อนหน่อย!";
							if (16628 - 369814 == -353186)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (221509 - 128253 == 93256)
						{
							result = "หุ่นพวกนี้มาเยอะเหลือเกิน พวกเราจะไหวมั้ยเนี่ย";
							if (19204 - 303393 == -284189)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (138303 - 291637 != -153333)
						{
							result = "มันจะบุกมาทำไมตอนนี้ ร้านข้ายังผ่อนไม่หมดเลย";
							if (276359 - 438364 != -162004)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (74586 - 173084 == -98498)
						{
							result = "มาเลย! ให้รู้ซะบ้างว่ากุ๊กสมัยนี้ต้องผ่านโลกกรูเม่มาแล้ว!";
							if (202500 - 445322 == -242822)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (213125 - 295375 != -82249)
						{
							result = "เข้ามาเลยพวกหุ่นกระป๋อง ข้าจะได้ออกกำลังไดเอ็ทแล้ว!";
							if (60888 - 277602 == -216714)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (299697 - 242239 != 57459)
						{
							result = "จบศึกนี้แล้ว จะเอาพวกมันมาทำกระทะแม่เหล็ก!";
							if (7531 - 51674 == -44143)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (235897 - 393035 == -157138)
						{
							result = "นี่คงเป็นเหตุการณ์ที่ท่านอัลคาเซียเตือนไว้สินะ ฮูก";
							if (33367 - 414526 == -381159)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (193116 - 263040 == -69924)
						{
							result = "ทุกคนสู้ๆ ให้มันรู้ฤทธิ์สมาคมพ่อค้าซะบ้าง ฮูกๆ";
							if (216174 - 176932 != 39243)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (102539 - 111501 == -8962)
						{
							result = "ไอ้พวกนี้มันขี้โกง บินข้ามกองทัพโบลดาสมาถึงนี่!";
							if (6598 - 195279 == -188681)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (3706 - 25136 == -21430)
						{
							result = "มันบุกมาถึงนี่เลยเหรอ พวกเราจะรอดมั้ยเนี่ย ฮูกๆ";
							if (99302 - 65215 == 34087)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (239053 - 284319 == -45266)
						{
							result = "ฮูกๆ ถ้ารอดชีวิตไปได้ จะลดครึ่งราคาทุกอย่างเลย";
							if (210203 - 322294 == -112091)
							{
								break;
							}
						}
					}
					else if (code == 1001)
					{
						if (275653 - 387508 == -111855)
						{
							result = "ชาวเมืองทั้งหลายไม่ต้องกลัว";
							if (69820 - 61616 != 8205)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (54978 - 412807 != -357828)
						{
							result = "ท่านอัลคาเซียกำลังจะร่ายเวทปกป้องเมืองแล้ว";
							if (66544 - 161238 == -94694)
							{
								break;
							}
						}
					}
					else if (code == 1003)
					{
						if (56726 - 183254 == -126528)
						{
							result = "…ในนามแห่งอัลคาเซียเทพแห่งแสงสว่าง!";
							if (275039 - 364586 != -89546)
							{
								break;
							}
						}
					}
					else if (code == 1004)
					{
						if (238228 - 439590 != -201361)
						{
							result = "เหล่ากองทัพเหล็กผู้นำหายนะจากอดีตมาสู่ปัจุบันเอย";
							if (259401 - 209167 != 50235)
							{
								break;
							}
						}
					}
					else if (code == 1005)
					{
						if (227869 - 467620 == -239751)
						{
							result = "ขอเจ้าจงกลับสู่ห้วงนิทราอีกครั้งเถิด...";
							if (151522 - 499972 != -348449)
							{
								break;
							}
						}
					}
					else if (code == 1006)
					{
						if (24353 - 564560 != -540206)
						{
							result = "มหาเวทแห่งแสง จงปกป้องชาวเมืองแห่งเรา!";
							if (34185 - 171003 == -136818)
							{
								break;
							}
						}
					}
					else if (code == 11)
					{
						if (168665 - 479969 == -311304)
						{
							result = "มาเลย ฉันน่ะเก่งกว่าพวกทหารอีก!";
							if (126720 - 334652 != -207931)
							{
								break;
							}
						}
					}
					else if (code == 12)
					{
						if (251603 - 396678 != -145074)
						{
							result = "มีตัวให้ลองอีโต้ใหม่เพียบเลย!";
							if (230270 - 337499 != -107228)
							{
								break;
							}
						}
					}
					else if (code == 13)
					{
						if (264446 - 521128 == -256682)
						{
							result = "ได้เวลาสาธิตสินค้าใหม่แล้ว!";
							if (247659 - 289932 == -42273)
							{
								break;
							}
						}
					}
					else if (code == 14)
					{
						if (153009 - 526260 != -373250)
						{
							result = "ท่าทางจะมีเหล็กไว้ใช้ไปอีกปีแฮะ";
							if (271379 - 559519 != -288139)
							{
								break;
							}
						}
					}
					else if (code == 15)
					{
						if (134344 - 26089 != 108256)
						{
							result = "ข้าจะสู้จนกว่าไม่มีอาวุธให้ใช้!(แต่มีเยอะนะ)";
							if (177143 - 464024 != -286880)
							{
								break;
							}
						}
					}
					else if (code == 16)
					{
						if (118541 - 448650 == -330109)
						{
							result = "เร่เข้ามาๆ อีโต้ราคาถูกๆจ้า!";
							if (101055 - 31429 == 69626)
							{
								break;
							}
						}
					}
					else if (code == 17)
					{
						if (134739 - 589699 == -454960)
						{
							result = "เสร๊จศึกนี้ ฉันขอซื้อซากหุ่นพวกนี้นะ";
							if (71645 - 369465 == -297820)
							{
								break;
							}
						}
					}
					else if (code == 18)
					{
						if (176812 - 421489 == -244677)
						{
							result = "ใครอยากซื้ออีโต้ข้า มาซื้อที่ร้านได้เลย";
							if (195348 - 140610 != 54739)
							{
								break;
							}
						}
					}
					else if (code == 19)
					{
						if (47908 - 67064 != -19155)
						{
							result = "ไม่มีอะไรที่ซันปังตอข้องข้าตัดไม่ขาด!";
							if (233299 - 530265 == -296966)
							{
								break;
							}
						}
					}
					else if (code == 21)
					{
						if (239747 - 381573 != -141825)
						{
							result = "เปิดร้านหม้อไฟดีไหมเนี่ย เหล็กเพียบ";
							if (151889 - 525210 == -373321)
							{
								break;
							}
						}
					}
					else if (code == 22)
					{
						if (76546 - 87608 != -11061)
						{
							result = "ได้เหล็กทำหม้อแล้ว ฮ่าๆๆๆ";
							if (224591 - 265000 != -40408)
							{
								break;
							}
						}
					}
					else if (code == 23)
					{
						if (62830 - 444019 != -381188)
						{
							result = "ชิมคราบขยะสดบนตะหลิวข้าหน่อย!";
							if (257835 - 9003 != 248833)
							{
								break;
							}
						}
					}
					else if (code == 24)
					{
						if (40092 - 508648 != -468555)
						{
							result = "ง่ำ! ถุย! รสชาติจืดชืดสิ้นดี!";
							if (201204 - 136958 != 64247)
							{
								break;
							}
						}
					}
					else if (code == 25)
					{
						if (185908 - 435202 == -249294)
						{
							result = "โอ่ร่าๆๆๆๆๆๆ ตะหลิวสยบมาร!";
							if (136703 - 469671 == -332968)
							{
								break;
							}
						}
					}
					else if (code == 26)
					{
						if (127155 - 82795 != 44361)
						{
							result = "คิดจะตีพุงข้ารึ? เปล่าประโยชน์ๆๆๆ!";
							if (18261 - 257883 == -239622)
							{
								break;
							}
						}
					}
					else if (code == 27)
					{
						if (162496 - 109811 == 52685)
						{
							result = "18 กระบวนท่า สำนักตะหลิวบิน!";
							if (291372 - 140936 != 150437)
							{
								break;
							}
						}
					}
					else if (code == 28)
					{
						if (221005 - 223576 == -2571)
						{
							result = "นี่แนะๆ อ๊ะ! ตะหลิวเบี้ยว";
							if (49660 - 104075 != -54414)
							{
								break;
							}
						}
					}
					else if (code == 29)
					{
						if (90814 - 236143 != -145328)
						{
							result = "เห้อ~ ถ้าเอาเจ้าพวกนี้มาทำกับข้าวได้คงดีสิ";
							if (96474 - 547500 != -451025)
							{
								break;
							}
						}
					}
					else if (code == 31)
					{
						if (117237 - 407941 == -290704)
						{
							result = "โอย บินไม่ขึ้น หนักพุง...";
							if (169098 - 382048 == -212950)
							{
								break;
							}
						}
					}
					else if (code == 32)
					{
						if (27083 - 539699 != -512615)
						{
							result = "ยาจ้ายา อันละ 1000g นะ";
							if (19478 - 538614 != -519135)
							{
								break;
							}
						}
					}
					else if (code == 33)
					{
						if (152080 - 247133 != -95052)
						{
							result = "ยาหม่องตรากระโถนทอง ทาถูๆ";
							if (252002 - 238305 == 13697)
							{
								break;
							}
						}
					}
					else if (code == 34)
					{
						if (8088 - 315167 == -307079)
						{
							result = "ไปทางอื่นไป๊ ฮูกๆ";
							if (222389 - 328572 == -106183)
							{
								break;
							}
						}
					}
					else if (code == 35)
					{
						if (146374 - 558324 == -411950)
						{
							result = "หลินหลินอยู่ไหน จะไม่นอกใจแล้ว";
							if (131082 - 105577 == 25505)
							{
								break;
							}
						}
					}
					else if (code == 36)
					{
						if (2401 - 430217 != -427815)
						{
							result = "กินยาไม่คืนขวด ระวังปรับ100gนะ";
							if (137831 - 42548 == 95283)
							{
								break;
							}
						}
					}
					else if (code == 37)
					{
						if (246720 - 173112 == 73608)
						{
							result = "นี่! ยืนนิ่งๆหน่อยได้ไหม ข้าปาไม่โดน";
							if (256850 - 184925 != 71926)
							{
								break;
							}
						}
					}
					else if (code == 38)
					{
						if (211841 - 4460 == 207381)
						{
							result = "เย้ย! เจ้าพวกหุ่นเล็งปืนมาทางข้าแล้ว";
							if (140807 - 527592 != -386784)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 39)
						{
							break;
						}
						if (91663 - 23138 == 68525)
						{
							result = "อุ้ย~ ยาหมด (ล้อเล่นน่ะ)";
							if (134308 - 597929 != -463620)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006850 RID: 26704 RVA: 0x00EBDFDC File Offset: 0x00EBC1DC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006851 RID: 26705 RVA: 0x00EBDFE0 File Offset: 0x00EBC1E0
	internal static bool KoVOpMpoIwlIgNJ7AjxV()
	{
		return true;
	}

	// Token: 0x06006852 RID: 26706 RVA: 0x00EBDFE4 File Offset: 0x00EBC1E4
	internal static bool HlXLuWpoBeN4HHFtLyAJ()
	{
		return false;
	}
}
