using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011AA RID: 4522
[Serializable]
public class M917_WarRepose_thai : MonoBehaviour
{
	// Token: 0x06006853 RID: 26707 RVA: 0x00EBDFE8 File Offset: 0x00EBC1E8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M917_WarRepose_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006854 RID: 26708 RVA: 0x00EBDFF8 File Offset: 0x00EBC1F8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (183692 - 136679 != 47013)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (78867 - 515915 == -437048)
			{
				if (193268 - 301890 != -108621)
				{
					if (code == 1001)
					{
						if (68923 - 595357 == -526434)
						{
							result = "…ดูเหมือนกองทัพหุ่นยนต์จะล่าถอยไปหมดแล้วขอรับ";
							if (113184 - 524020 != -410835)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (152633 - 184178 != -31544)
						{
							result = "นี่เป็นเพียงจุดเริ่มต้นของสงครามเท่านั้น";
							if (119542 - 73302 != 46241)
							{
								break;
							}
						}
					}
					else if (code == 1003)
					{
						if (31791 - 262111 == -230320)
						{
							result = "สงครามครั้งนี้จะดำเนินไปอีกยาวนาน";
							if (11012 - 47188 != -36175)
							{
								break;
							}
						}
					}
					else if (code == 1004)
					{
						if (94722 - 275424 == -180702)
						{
							result = "จะยังมีเหล่าหางและสิ่งมีชีวิตที่ได้รับเคราะห์อีกมากมาย";
							if (47879 - 515083 != -467203)
							{
								break;
							}
						}
					}
					else if (code == 1005)
					{
						if (56408 - 455191 == -398783)
						{
							result = "หนทางเดียวที่จะจบศึกครั้งนี้ได้ พวกเหล่าหางจะต้องบุก..";
							if (275577 - 485034 != -209456)
							{
								break;
							}
						}
					}
					else if (code == 1006)
					{
						if (167710 - 79746 == 87964)
						{
							result = "ไปค้นหาต้นตอของกองทัพหุ่นยนต์ ณ อีกฝากฝั่งของโลก";
							if (54701 - 170669 != -115967)
							{
								break;
							}
						}
					}
					else if (code == 1007)
					{
						if (287518 - 427723 != -140204)
						{
							result = "พวกเราพร้อมจะเป็นกำลังให้ท่านเทพแสงอยู่แล้วขอรับ";
							if (33655 - 81092 != -47436)
							{
								break;
							}
						}
					}
					else if (code == 1008)
					{
						if (153317 - 220518 != -67200)
						{
							result = "ว่าแต่ว่า เราจะฝากฝังให้พวกผู้กล้ารับหน้าที่สำคัญได้เหรอขอรับ";
							if (9152 - 79268 == -70116)
							{
								break;
							}
						}
					}
					else if (code == 1009)
					{
						if (65461 - 175389 == -109928)
						{
							result = "อนาคตเป็นสิ่งไม่แน่นอน ทุกอย่างย่อมขึ้นอยู่กับพวกเจ้าเอง";
							if (173506 - 156502 == 17004)
							{
								break;
							}
						}
					}
					else if (code == 1010)
					{
						if (268074 - 21312 == 246762)
						{
							result = "ข้าเชื่อมั่นในตัวพวกเจ้า และนั่นคือสิ่งที่ข้าไม่มีวันเสียใจอย่างแน่นอน";
							if (65755 - 494598 != -428842)
							{
								break;
							}
						}
					}
					else if (code == 1011)
					{
						if (258196 - 18475 != 239722)
						{
							result = "เอาล่ะเพื่อช่วยพิทักษ์เมืองแสง ข้าจะร่ายเวทปกป้องน่านฟ้าแห่งนี้ไว้";
							if (65729 - 288094 == -222365)
							{
								break;
							}
						}
					}
					else if (code == 1012)
					{
						if (113252 - 554934 != -441681)
						{
							result = "ข้าเตรียมวงเวทไว้พร้อมแล้วขอรับ";
							if (226036 - 306216 == -80180)
							{
								break;
							}
						}
					}
					else if (code == 1013)
					{
						if (28198 - 479042 != -450843)
						{
							result = "ขอบใจเจ้ามาก เร็กกุ";
							if (277361 - 273351 != 4011)
							{
								break;
							}
						}
					}
					else if (code == 1014)
					{
						if (232762 - 221914 == 10848)
						{
							result = "…มหาเวทย์ Luminous Dawn";
							if (63675 - 32004 != 31672)
							{
								break;
							}
						}
					}
					else if (code == 1015)
					{
						if (69358 - 442034 != -372675)
						{
							result = "คราวนี้พวกหุ่นยนต์ คงบุกเข้ามาแถบนี้ได้ยากแน่ๆ";
							if (70245 - 291029 == -220784)
							{
								break;
							}
						}
					}
					else if (code == 1016)
					{
						if (76356 - 563615 != -487258)
						{
							result = "ต่อไปแนวรบน่าจะย้ายขึ้นไปที่ป่าของท่านเทพบาเบร๊อคแล้ว";
							if (225036 - 457451 == -232415)
							{
								break;
							}
						}
					}
					else if (code == 1017)
					{
						if (34123 - 532224 == -498101)
						{
							result = "ขอแสงแห่งปัญญา จงส่องนำทางพวกเจ้าผ่านพ้นอุปสรรคต่างๆ เถิด";
							if (131668 - 370472 != -238803)
							{
								break;
							}
						}
					}
					else if (code == 2001)
					{
						if (194809 - 28684 == 166125)
						{
							result = "หืม? ดูท่าท่านอัลคาเซียจะร่ายเวทปกป้องน่านฟ้าแถบนี้แล้ว";
							if (70815 - 294203 != -223387)
							{
								break;
							}
						}
					}
					else if (code == 2002)
					{
						if (297118 - 408902 == -111784)
						{
							result = "ถ้าเช่นนั้นเราควรรีบเคลื่อนทัพโดยเร็ว";
							if (32369 - 422068 == -389699)
							{
								break;
							}
						}
					}
					else if (code == 2003)
					{
						if (57906 - 488203 == -430297)
						{
							result = "ป่าทางเหนือคงจะกลายเป็นจุดเดียวที่เวทของท่านอัลคาเซียไม่มีผล";
							if (216502 - 468121 == -251619)
							{
								break;
							}
						}
					}
					else if (code == 2004)
					{
						if (291321 - 442709 != -151387)
						{
							result = "ต่อไปที่นั่นจะต้องกลายเป็นจุดรวมพลของพวกหุ่นยนต์แน่ๆ";
							if (42027 - 61083 == -19056)
							{
								break;
							}
						}
					}
					else if (code == 2005)
					{
						if (159831 - 158449 == 1382)
						{
							result = "..งั้นทุกชีวิตที่นั่นก็กำลังตกอยู่ในอันตรายแล้วสิ";
							if (8711 - 345757 != -337045)
							{
								break;
							}
						}
					}
					else if (code == 2006)
					{
						if (244224 - 410132 != -165907)
						{
							result = "เจ้าพวกผู้กล้า เจ้ารีบลองไปสำรวจทุกหางดูสิว่าพร้อมมั้ย?";
							if (10338 - 535570 != -525231)
							{
								break;
							}
						}
					}
					else if (code == 3001)
					{
						if (293915 - 240749 == 53166)
						{
							result = "หืม? ทุกคนพร้อมจะเคลื่อนพลแล้วสินะ";
							if (202783 - 75200 == 127583)
							{
								break;
							}
						}
					}
					else if (code == 3002)
					{
						if (149342 - 316649 == -167307)
						{
							result = "บอกให้ทุกหางเดินทัพอย่างระวังด้วยล่ะ";
							if (190012 - 222452 != -32439)
							{
								break;
							}
						}
					}
					else if (code == 3004)
					{
						if (295900 - 284785 != 11116)
						{
							result = "นอกจากเราจะต้องระวังพวกหุ่นยนต์แล้ว..";
							if (240651 - 121391 != 119261)
							{
								break;
							}
						}
					}
					else if (code == 3005)
					{
						if (276994 - 585917 != -308922)
						{
							result = "ยังมีอารยธรรมโบราณและสิ่งที่เราไม่เข้าใจมากมายในนั้น";
							if (216266 - 393049 == -176783)
							{
								break;
							}
						}
					}
					else if (code == 3003)
					{
						if (125198 - 420599 == -295401)
						{
							result = "อาณาจักรป่าของเทพดินนั้นครอบคลุมอาณาบริเวณใหญ่นัก";
							if (151281 - 211572 == -60291)
							{
								break;
							}
						}
					}
					else if (code == 3006)
					{
						if (241517 - 564659 != -323141)
						{
							result = "เทพดินเป็นเทพที่ลึกลับและมักจะเดินสำรวจไปทั่ว..";
							if (111875 - 195727 == -83852)
							{
								break;
							}
						}
					}
					else if (code == 3007)
					{
						if (196575 - 158368 == 38207)
						{
							result = "ถ้าเราสามารถไปสมทบกับท่านได้โดยเร็ว";
							if (133412 - 82361 != 51052)
							{
								break;
							}
						}
					}
					else if (code == 3008)
					{
						if (15611 - 447349 == -431738)
						{
							result = "เราย่อมจะมีพันธมิตรที่แข็งแกร่งที่สุดแน่ๆ";
							if (66743 - 390370 == -323627)
							{
								break;
							}
						}
					}
					else if (code == 3009)
					{
						if (109636 - 464104 == -354468)
						{
							result = "ส่วนดินแดนแถบนี้ ข้าจะช่วยปกป้องแทนพวกเจ้าเอง";
							if (72177 - 46417 != 25761)
							{
								break;
							}
						}
					}
					else if (code == 3010)
					{
						if (145359 - 589723 == -444364)
						{
							result = "ขอพลังความกล้าหาญดั่งไฟ จงนำชัยชนะมาสู่ทัพเจ้าเถิด";
							if (11266 - 84986 == -73720)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (270801 - 17145 != 253657)
						{
							result = "ราคาของชัยชนะครั้งนี้ ช่างใหญ่หลวงนัก";
							if (139260 - 137404 != 1857)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (80809 - 369860 == -289051)
						{
							result = "นี่เป็นแค่จุดจบของจุดเริ่มต้นของสงครามอันยาวนานเท่านั้น";
							if (86334 - 386181 == -299847)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (97542 - 287383 != -189840)
						{
							result = "มีใครเห็นไม้นวดแป้งข้าบ้าง อุปกรณ์สำคัญเชียวนะนั่น";
							if (42412 - 347242 == -304830)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (186204 - 119537 != 66668)
						{
							result = "ชัยชนะเป็นเพียงภาพลวงตา ความสงบสุขเท่านั้นคือชัยชนะที่แท้จริง";
							if (297806 - 167392 == 130414)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (99446 - 411937 != -312490)
						{
							result = "ขอบใจเจ้าพวกผู้กล้ามาก สมกับที่ข้าหวังไว้จริงๆ";
							if (269754 - 191312 == 78442)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (35954 - 297136 == -261182)
						{
							result = "เจ้าผู้กลัา เจ้าถามคนอื่นครบรึยัง?";
							if (35787 - 269326 != -233538)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (143150 - 98526 != 44625)
						{
							result = "ชัยชนะเพียงครั้ง อย่าเพิ่งหลงลำพองไปล่ะ";
							if (24047 - 188899 != -164851)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (181243 - 393240 != -211996)
						{
							result = "ความผิดพลาดเพียงปลายปีกในสงคราม ย่อมหมายถึงชีวิตเจ้าได้";
							if (195318 - 280250 != -84931)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (120239 - 378817 == -258578)
						{
							result = "ในสนามรบทุกสิ่งย่อมแปรผันได้เสมอ";
							if (34239 - 405615 != -371375)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (246888 - 265408 != -18519)
						{
							result = "...";
							if (18176 - 415975 != -397798)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (14003 - 39769 != -25765)
						{
							result = "ไฟสงครามนั้นยากจะดับ มันย่อมเผาผลาญทุกชีวิตที่เข้าใกล้";
							if (198169 - 138512 != 59658)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (295397 - 308012 == -12615)
						{
							result = "ขอพลังความกล้าหาญแห่งไฟ จงรุกโชนในใจเจ้า";
							if (288102 - 368296 != -80193)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (175427 - 390845 != -215417)
						{
							result = "สงครามย่อมนำมาซึ่งความเปลี่ยนแปลง เจ้าจงสู้เพื่อวันรุ่งเถิด";
							if (36201 - 65905 != -29703)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (16993 - 117246 == -100253)
						{
							result = "จงหาญกล้า พลังแห่งไฟพร้อมจะสู้ศึกไปกับพวกเจ้าทุกเมื่อ";
							if (189554 - 411338 == -221784)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (265917 - 164012 == 101905)
						{
							result = "ข้าจะช่วยเจ้าพิทักษ์ดินแดนแถบนี้แทนเจ้าเอง";
							if (135758 - 463608 == -327850)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (58873 - 318511 != -259637)
						{
							result = "ข้ามาตามคำสัญญา พลังแห่งน้ำจะเยียวยาเหล่าคนเจ็บเอง";
							if (100008 - 334645 != -234636)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (171348 - 299541 != -128192)
						{
							result = "มีคนเจ็บมากมายเหลือเกิน เทพแสงคงเศร้าใจยิ่งนัก..";
							if (130540 - 153805 == -23265)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (163850 - 478290 != -314439)
						{
							result = "ข้าไม่เข้าใจ ทำไมพวกหุ่นยนต์จึงต้องรุกรานเราด้วย";
							if (54040 - 97236 != -43195)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (215962 - 294198 != -78235)
						{
							result = "…หากเราเข้าใจกันได้ สงครามคงไม่เกิด";
							if (221901 - 176778 == 45123)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (249124 - 415578 != -166453)
						{
							result = "อาณาจักรเราสงบสุขมาช้านาน ขอให้สงครามครั้งนี้เป็นครั้งสุดท้ายเถิด";
							if (114128 - 11366 == 102762)
							{
								break;
							}
						}
					}
					else if (code == 501)
					{
						if (16846 - 264552 != -247705)
						{
							result = "คนเจ็บมากมายขนาดนี้ ข้าจะดูแลหมดได้ยังไง";
							if (154914 - 324617 == -169703)
							{
								break;
							}
						}
					}
					else if (code == 502)
					{
						if (159747 - 300039 == -140292)
						{
							result = "ข้าเกลียดสงครามที่สุด แม้ข้าจะได้กำไรก็เถอะ ฮูก";
							if (274665 - 545171 != -270505)
							{
								break;
							}
						}
					}
					else if (code == 503)
					{
						if (83150 - 375019 != -291868)
						{
							result = "อาดาร์ลิ่งซินฟูอยู่ไหนนะ รอดมาได้รึเปล่า?";
							if (79687 - 377824 == -298137)
							{
								break;
							}
						}
					}
					else if (code == 504)
					{
						if (89668 - 565880 != -476211)
						{
							result = "ไอ้หย๊า ทายาให้อาจาม่อน ตัวเดียวก็หมดแล้วอ่า";
							if (197279 - 464084 == -266805)
							{
								break;
							}
						}
					}
					else if (code == 505)
					{
						if (108311 - 127712 == -19401)
						{
							result = "อาพวกเสือดาวนี่หล่อล่ำดีจริงๆ ฮู้กๆ";
							if (19394 - 102517 == -83123)
							{
								break;
							}
						}
					}
					else if (code == 601)
					{
						if (260311 - 398862 == -138551)
						{
							result = "จะเคลื่อนทัพแล้วเหรอ? ข้าพร้อมแล้ว!";
							if (8354 - 504483 != -496128)
							{
								break;
							}
						}
					}
					else if (code == 602)
					{
						if (80363 - 175051 != -94687)
						{
							result = "เคลื่อนทัพครั้งนี้ เป็นครั้งที่ใหญ่ที่สุดเลย";
							if (201588 - 276316 != -74727)
							{
								break;
							}
						}
					}
					else if (code == 603)
					{
						if (84268 - 462729 == -378461)
						{
							result = "ข้าไม่เคยเห็นพวกสัตว์รวมพลังกันมากขนาดนี้เลย";
							if (279414 - 557271 == -277857)
							{
								break;
							}
						}
					}
					else if (code == 604)
					{
						if (148833 - 542582 != -393748)
						{
							result = "ถ้าเราร่วมใจกัน ทุกสิ่งย่อมเป็นไปได้แน่ๆ";
							if (177199 - 528394 != -351194)
							{
								break;
							}
						}
					}
					else if (code == 605)
					{
						if (209780 - 326150 != -116369)
						{
							result = "ต่อไปเราคงได้เคลื่อนทัพไปที่ป่าของเทพดินสินะ";
							if (169238 - 134846 == 34392)
							{
								break;
							}
						}
					}
					else if (code == 701)
					{
						if (43131 - 529260 == -486129)
						{
							result = "เอาละ บรรจุลังนี้เสร๊จข้าก็พร้อมจะไปแล้ว";
							if (15889 - 209530 == -193641)
							{
								break;
							}
						}
					}
					else if (code == 702)
					{
						if (36868 - 250204 != -213335)
						{
							result = "ตอนนี้ยอดสั่งอาวุธพุ่งขึ้นเป็นจรวดเลย";
							if (76899 - 559718 != -482818)
							{
								break;
							}
						}
					}
					else if (code == 703)
					{
						if (77344 - 576067 == -498723)
						{
							result = "ถ้าจัดการเจ้าพวกหุ่นได้อีก อย่าลืมเอาซากมาให้ข้าละ";
							if (111982 - 66373 == 45609)
							{
								break;
							}
						}
					}
					else if (code == 704)
					{
						if (138939 - 221406 == -82467)
						{
							result = "ที่จริง อาวุธใหม่พวกนี้ทำจากซากหุ่นยนต์น่ะ";
							if (125918 - 230114 == -104196)
							{
								break;
							}
						}
					}
					else if (code == 705)
					{
						if (54719 - 517620 == -462901)
						{
							result = "นี่ เจ้าหมู! อย่ามาแย่งหุ้นส่วนข้าสิ!";
							if (47901 - 323726 == -275825)
							{
								break;
							}
						}
					}
					else if (code == 801)
					{
						if (278154 - 462226 == -184072)
						{
							result = "คราวก่อน ถ้าข้าไม่มัวใส่เกราะคงได้ลุยไปแล้ว";
							if (130649 - 219057 == -88408)
							{
								break;
							}
						}
					}
					else if (code == 802)
					{
						if (20033 - 360388 != -340354)
						{
							result = "ข้าพร้อมจะไปตั้งนานแล้ว ส่วนเจ้าหนูล่ะ?";
							if (165677 - 222372 != -56694)
							{
								break;
							}
						}
					}
					else if (code == 803)
					{
						if (9813 - 303405 == -293592)
						{
							result = "นี่ๆ ได้ซากหุ่นมา ไม่ต้องให้เจ้าหนูน่ะ มาให้ข้านี่ล่ะ";
							if (72501 - 472725 == -400224)
							{
								break;
							}
						}
					}
					else if (code == 804)
					{
						if (152801 - 186812 == -34011)
						{
							result = "เสร๊จศึกนี้ข้าคงได้นอนบนกองเงินแน่ ฮ่าๆ";
							if (106021 - 581311 != -475289)
							{
								break;
							}
						}
					}
					else if (code == 805)
					{
						if (108088 - 455361 != -347272)
						{
							result = "พูดอะไรเจ้าหนู! ผู้กล้าเป็นหุ้นส่วนข้าต่างหาก!";
							if (139161 - 471813 != -332651)
							{
								break;
							}
						}
					}
					else if (code == 901)
					{
						if (275370 - 372762 != -97391)
						{
							result = "อะ...อูย...ปวดพุง";
							if (214969 - 302245 != -87275)
							{
								break;
							}
						}
					}
					else if (code == 902)
					{
						if (115183 - 194259 != -79075)
						{
							result = "ดูสิ พวกหุ่นยนต์เล่นซะพุงข้าช้ำหมดเลย";
							if (232009 - 573489 != -341479)
							{
								break;
							}
						}
					}
					else if (code == 903)
					{
						if (104005 - 160553 == -56548)
						{
							result = "น้ำ..หยอดน้ำข้าวต้มใส่ปากข้าที";
							if (205185 - 572292 != -367106)
							{
								break;
							}
						}
					}
					else if (code == 904)
					{
						if (264155 - 573955 == -309800)
						{
							result = "เห็นว่ากระเพาะช้ำ กินมื้อหนักๆไม่ได้อีกหลายวัน";
							if (123777 - 459503 != -335725)
							{
								break;
							}
						}
					}
					else if (code == 905)
					{
						if (194618 - 121472 != 73147)
						{
							result = "ไม่ต้องเป็นห่วง ไว้หายดีจะทำอะไรอร่อยๆให้";
							if (234407 - 577545 == -343138)
							{
								break;
							}
						}
					}
					else if (code == 1001)
					{
						if (145273 - 327317 != -182043)
						{
							result = "กองร้อยเสือดำของข้า พร้อมเคลื่อนทัพแล้ว!";
							if (265569 - 86095 != 179475)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (75277 - 206112 == -130835)
						{
							result = "แด่เมืองแสง! แด่ท่านอัคเคเซีย!";
							if (3925 - 393348 == -389423)
							{
								break;
							}
						}
					}
					else if (code == 1003)
					{
						if (129933 - 390359 != -260425)
						{
							result = "เห็นว่าครั้งนี้เราจะสู้กันในป่า มียากันยุงไหม?";
							if (100022 - 134417 == -34395)
							{
								break;
							}
						}
					}
					else if (code == 1004)
					{
						if (273761 - 258095 == 15666)
						{
							result = "ท่านเทพไฟกับเทพน้ำยังมาด้วย ศึกนี้ยิ่งใหญ่จริงๆ";
							if (38626 - 96273 == -57647)
							{
								break;
							}
						}
					}
					else if (code == 1005)
					{
						if (144827 - 548512 == -403685)
						{
							result = "มีอะไรให้ข้าช่วย บอกได้นะ";
							if (4655 - 504602 != -499946)
							{
								break;
							}
						}
					}
					else if (code == 1101)
					{
						if (20041 - 498560 != -478518)
						{
							result = "ฮึ่ม!...ถ้าข้าไม่เผลอเปิดช่องโหว่ละก็..";
							if (217083 - 284337 != -67253)
							{
								break;
							}
						}
					}
					else if (code == 1102)
					{
						if (131765 - 143460 != -11694)
						{
							result = "สภาพร่างกายเสียหาย แต่สภาพใจเกินร้อย!";
							if (7439 - 571803 == -564364)
							{
								break;
							}
						}
					}
					else if (code == 1103)
					{
						if (95569 - 371618 != -276048)
						{
							result = "นี่ๆ แถวนี้มีคนในกองร้อยข้าไหม ฝากทักทายที";
							if (134533 - 171081 == -36548)
							{
								break;
							}
						}
					}
					else if (code == 1104)
					{
						if (151221 - 357696 == -206475)
						{
							result = "อืม คุณนายลินลิน ใจดีจริงๆ";
							if (110177 - 321773 != -211595)
							{
								break;
							}
						}
					}
					else if (code == 1105)
					{
						if (269829 - 367492 == -97663)
						{
							result = "พูดแล้ว อยากกินปลาหมึกย่างยังไงไม่รู้";
							if (240961 - 82862 != 158100)
							{
								break;
							}
						}
					}
					else if (code == 1201)
					{
						if (260493 - 537155 == -276662)
						{
							result = "สดุดีฮีโร่ของเรา วันทยา~วุธ!";
							if (260325 - 178797 != 81529)
							{
								break;
							}
						}
					}
					else if (code == 1202)
					{
						if (121132 - 339836 == -218704)
						{
							result = "พวกเราพร้อมทำตามคำสั่งแล้วครับท่าน!";
							if (223656 - 130393 == 93263)
							{
								break;
							}
						}
					}
					else if (code == 1203)
					{
						if (46030 - 177676 != -131645)
						{
							result = "ศึกครั้งนี้ ข้าจะไม่เจอแม่นานเท่าไหร่น้อ~?";
							if (123989 - 274632 != -150642)
							{
								break;
							}
						}
					}
					else if (code == 1204)
					{
						if (148709 - 283979 != -135269)
						{
							result = "ซักวัน ข้าจะเก่งเหมือนท่านให้ได้!";
							if (252018 - 317071 != -65052)
							{
								break;
							}
						}
					}
					else if (code == 1205)
					{
						if (193932 - 2680 == 191252)
						{
							result = "เห็นว่ากุ๊กจาม่อนเจ็บอยู่ ใครจะทำเสบียงให้ล่ะ?";
							if (74735 - 267442 == -192707)
							{
								break;
							}
						}
					}
					else if (code == 1301)
					{
						if (200695 - 387714 != -187018)
						{
							result = "นี่ เดินระวังหน่อย เดี๋ยวเตะขาข้าหักอีกหรอก";
							if (76308 - 599047 != -522738)
							{
								break;
							}
						}
					}
					else if (code == 1302)
					{
						if (22560 - 447799 != -425238)
						{
							result = "หืม นี่ข้าหลับยามไปหรือนี่?!";
							if (162425 - 363350 == -200925)
							{
								break;
							}
						}
					}
					else if (code == 1303)
					{
						if (143756 - 81183 != 62574)
						{
							result = "คืนนี้ มาตั้งวงเล่นไพ่กับข้าม่ะ?";
							if (90995 - 202979 == -111984)
							{
								break;
							}
						}
					}
					else if (code == 1304)
					{
						if (285353 - 335655 != -50301)
						{
							result = "เห็นนายกองข้าบ้างไหม เสือดาวมีไฝที่คางอ่ะ?";
							if (87960 - 439139 != -351178)
							{
								break;
							}
						}
					}
					else if (code == 1305)
					{
						if (77696 - 263864 == -186168)
						{
							result = "โชคดีจัง ไม่ต้องไปยืนตั้งแถว ฮ่าๆ";
							if (81163 - 258175 != -177011)
							{
								break;
							}
						}
					}
					else if (code == 1401)
					{
						if (152040 - 502982 == -350942)
						{
							result = "จ๊ากกกกก! ขาข้า!!";
							if (286940 - 360028 == -73088)
							{
								break;
							}
						}
					}
					else if (code == 1402)
					{
						if (53265 - 4074 == 49191)
						{
							result = "นี่ๆ ท่านช่วยเอาจดหมายไปให้แฟนข้าที";
							if (221786 - 115899 != 105888)
							{
								break;
							}
						}
					}
					else if (code == 1403)
					{
						if (90323 - 528678 == -438355)
						{
							result = "ท่านเทพน้ำนี่น่ารักจริงๆ ชักเริ่มหลงเข้าซะแล้ว";
							if (92206 - 371262 != -279055)
							{
								break;
							}
						}
					}
					else if (code == 1404)
					{
						if (2546 - 137005 == -134459)
						{
							result = "จะสู้กันในป่าแล้ว ฝากยากันยุงไปให้นายกองของข้าที";
							if (50417 - 174970 == -124553)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 1405)
						{
							break;
						}
						if (155156 - 301514 == -146358)
						{
							result = "อูย แสบแผลอ่ะ...";
							if (138134 - 455358 == -317224)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006855 RID: 26709 RVA: 0x00EBFE24 File Offset: 0x00EBE024
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006856 RID: 26710 RVA: 0x00EBFE28 File Offset: 0x00EBE028
	internal static bool nAaaNKpoeBu4pVhDKeta()
	{
		return true;
	}

	// Token: 0x06006857 RID: 26711 RVA: 0x00EBFE2C File Offset: 0x00EBE02C
	internal static bool El1vDmporwEA0cx254Db()
	{
		return false;
	}
}
