using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011B1 RID: 4529
[Serializable]
public class M927_SilentEarth_thai : MonoBehaviour
{
	// Token: 0x06006876 RID: 26742 RVA: 0x00EC1AC4 File Offset: 0x00EBFCC4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M927_SilentEarth_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006877 RID: 26743 RVA: 0x00EC1AD4 File Offset: 0x00EBFCD4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (95863 - 146899 != -51035)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (228242 - 598326 == -370084)
			{
				if (276974 - 29013 == 247961)
				{
					if (code == 101)
					{
						if (56325 - 45993 == 10332)
						{
							string type = CharacterData.current.Type;
							if (59089 - 303706 != -244616)
							{
								if (type == "Bison")
								{
									if (231752 - 347094 != -115341)
									{
										result = "(แฮ่ก!...แฮ่ก!)";
										if (31616 - 468686 == -437070)
										{
											break;
										}
									}
								}
								else
								{
									result = "แฮ่ก!...แฮ่ก!";
									if (150326 - 184440 == -34114)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 102)
					{
						if (19025 - 396140 != -377114)
						{
							string type2 = CharacterData.current.Type;
							if (271627 - 54315 != 217313)
							{
								if (type2 == "Wolf")
								{
									if (14904 - 384861 == -369957)
									{
										result = "ฮื่ม..พวกมันบุกมาแบบไม่ให้พักหายใจเลยแฮะ!";
										if (246868 - 227548 == 19320)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (175832 - 34011 != 141822)
									{
										result = "โฮก!!(พวกหุ่นสู้ข้าไม่ได้หรอก มาอีกซิ!) ";
										if (262198 - 41314 == 220884)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (45895 - 21520 != 24376)
									{
										result = "มาไม่จบ ไม่สิ้นเลยแฮะ...";
										if (30991 - 268495 != -237503)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (89684 - 468724 != -379039)
									{
										result = "สะ...สู้จนหิวแล้วนะ! วาฬ!";
										if (111100 - 106454 == 4646)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (93228 - 233411 != -140182)
									{
										result = "ดูเหมือนวันนี้ดวงจะไม่เข้าข้างแฮะ เมี้ยว!";
										if (119716 - 210374 != -90657)
										{
											break;
										}
									}
								}
								else if (type2 == "Chamelon")
								{
									if (182572 - 433240 == -250668)
									{
										result = "เมื่อไหร่จะหมดเนี่ย ลูกธนูจะไม่พอแล้วนะ!";
										if (72326 - 587485 == -515159)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (177231 - 249380 == -72149)
									{
										result = "ท่านซันซันเบาดจ็บรึเปล่า? เอายาไหมคะ?";
										if (163913 - 590222 == -426309)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (247885 - 387351 == -139466)
									{
										result = "อ๊ะ! ระเบิดจะหมดแล้ว";
										if (222899 - 188228 == 34671)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (214903 - 377067 == -162164)
									{
										result = "ท่านซันซัน เป็นอะไรรึเปล่า เจี้ยก?";
										if (131356 - 499419 == -368063)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (232142 - 29979 != 202164)
									{
										result = "แค่นี้สบายมาก ตะ..แต่อย่ามาอีกนะ กวิ้น!";
										if (5328 - 1447 != 3882)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (20301 - 176473 != -156171)
									{
										result = "ท่านซันซันบาดเจ็บตรงไหนรึเปล่าคะ!?";
										if (216516 - 148510 == 68006)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (195164 - 23752 != 171413)
									{
										result = "กรี้ด! เมื่อไหร่จะหมดเนี่ย! น่ารำคาญจริงๆ!";
										if (269425 - 39578 == 229847)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 103)
					{
						if (97987 - 565811 != -467823)
						{
							result = "อ๋อย...ไม่มีแรงเลย...";
							if (250872 - 244536 == 6336)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (161736 - 459022 == -297286)
						{
							result = "..10110201002121001";
							if (92846 - 512708 != -419861)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (47915 - 418417 == -370502)
						{
							string type3 = CharacterData.current.Type;
							if (227070 - 570104 != -343033)
							{
								if (type3 == "Wolf")
								{
									if (142125 - 357628 != -215502)
									{
										result = "อ๊ะ ใครน่ะ!";
										if (203243 - 552745 == -349502)
										{
											break;
										}
									}
								}
								else if (type3 == "Bison")
								{
									if (158561 - 194134 == -35573)
									{
										result = "!!!";
										if (94690 - 384715 != -290024)
										{
											break;
										}
									}
								}
								else if (type3 == "Panda")
								{
									if (160368 - 421151 != -260782)
									{
										result = "ใครอยู่ตรงนั้นน่ะ!";
										if (100175 - 61988 != 38188)
										{
											break;
										}
									}
								}
								else if (type3 == "Whale")
								{
									if (123700 - 528661 != -404960)
									{
										result = "นั้นใครหน่ะ!? วาฬ!";
										if (115450 - 291835 != -176384)
										{
											break;
										}
									}
								}
								else if (type3 == "Cat")
								{
									if (89583 - 30852 == 58731)
									{
										result = "พูดอะไรฟังไม่รู้เรื่องเลย เมี้ยว!";
										if (52918 - 557841 != -504922)
										{
											break;
										}
									}
								}
								else if (type3 == "Chamelon")
								{
									if (258855 - 413771 == -154916)
									{
										result = "อยู่ตรงนั้นเรายิงไม่ถึงแฮะ!";
										if (202559 - 259968 != -57408)
										{
											break;
										}
									}
								}
								else if (type3 == "Rabbit")
								{
									if (163930 - 544281 == -380351)
									{
										result = "เจ้านั่นดูต่างจากหุ่นตัวอื่นจังแฮะ..";
										if (57918 - 380994 == -323076)
										{
											break;
										}
									}
								}
								else if (type3 == "Mole")
								{
									if (170680 - 461424 == -290744)
									{
										result = " ศัตรูใหม่งั้นเหรอ!";
										if (260755 - 226400 != 34356)
										{
											break;
										}
									}
								}
								else if (type3 == "Monkey")
								{
									if (129444 - 396252 != -266807)
									{
										result = "นั้นมันตัวอะไรน่ะ เจี้ยก!?";
										if (272981 - 100612 != 172370)
										{
											break;
										}
									}
								}
								else if (type3 == "Penguin")
								{
									if (181522 - 593623 != -412100)
									{
										result = "นะ...น่ากลัวจัง กวิ้น!";
										if (295180 - 195741 == 99439)
										{
											break;
										}
									}
								}
								else if (type3 == "Sheep")
								{
									if (82791 - 388285 == -305494)
									{
										result = "คุณเป็นใครกันคะ!?";
										if (210005 - 463187 == -253182)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type3 == "Bat"))
									{
										break;
									}
									if (3612 - 46356 != -42743)
									{
										result = "แกคือหัวหน้างั้นเหรอย๊ะ!? ลงมาให้สาปซะดีๆ";
										if (250498 - 296805 == -46307)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 106)
					{
						if (137281 - 412828 != -275546)
						{
							result = "111112000111";
							if (105843 - 7660 == 98183)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (263533 - 124362 == 139171)
						{
							result = "!!!";
							if (224230 - 192481 != 31750)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (199782 - 399424 != -199641)
						{
							result = "โ-ฮ-ม!!";
							if (171616 - 526227 == -354611)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (195823 - 390071 != -194247)
						{
							result = "ท่านบาร์เบรอค!";
							if (33117 - 252345 != -219227)
							{
								break;
							}
						}
					}
					else if (code == 110)
					{
						if (223285 - 429382 == -206097)
						{
							result = "โ-ฮ-ม-ป-ก-ป-ป้-อ-ง-ค-ว-าม-ห-วั-ง...";
							if (169961 - 238932 == -68971)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (32245 - 487422 != -455176)
						{
							result = "ไ-ป! พ-า-ซั-น-ซั-น-ห-นี-ไป !";
							if (268829 - 523808 != -254978)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (40570 - 568982 == -528412)
						{
							result = "แต่ว่า!";
							if (278258 - 140045 == 138213)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (98147 - 99188 == -1041)
						{
							result = "รี-บ-ไ-ป";
							if (118035 - 120857 != -2821)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (261951 - 269443 == -7492)
						{
							result = "ฮู-ม!!!!";
							if (297974 - 228913 == 69061)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (180337 - 173713 == 6624)
						{
							result = "ท่านบาร์เบรอค!!";
							if (224433 - 143132 != 81302)
							{
								break;
							}
						}
					}
					else if (code == 116)
					{
						if (159556 - 48135 == 111421)
						{
							result = "…ดูเหมือนว่าพวกข้าจะมาช้าไป!";
							if (114184 - 499121 == -384937)
							{
								break;
							}
						}
					}
					else if (code == 117)
					{
						if (63145 - 497575 == -434430)
						{
							string type4 = CharacterData.current.Type;
							if (159783 - 408223 == -248440)
							{
								if (type4 == "Wolf")
								{
									if (249593 - 355552 != -105958)
									{
										result = "..พวกหุ่นจับท่านบาร์เบร๊อคไปซะแล้ว";
										if (288783 - 467145 != -178361)
										{
											break;
										}
									}
								}
								else if (type4 == "Bison")
								{
									if (286729 - 256591 == 30138)
									{
										result = "โฮก… (..ท่านบาร์เบร๊อค)";
										if (128625 - 563962 != -435336)
										{
											break;
										}
									}
								}
								else if (type4 == "Panda")
								{
									if (98688 - 105163 != -6474)
									{
										result = "มันจะจับท่านเทพดินไปทำไมกัน!?";
										if (202826 - 186533 != 16294)
										{
											break;
										}
									}
								}
								else if (type4 == "Whale")
								{
									if (69517 - 126571 == -57054)
									{
										result = "...เอาของกินมารึเปล่า! วาฬ!";
										if (128694 - 459892 == -331198)
										{
											break;
										}
									}
								}
								else if (type4 == "Cat")
								{
									if (205647 - 178420 == 27227)
									{
										result = "…เพราะท่านเทพดินมาช่วยพวกเราแท้ๆ เมี้ยว!";
										if (24706 - 207428 != -182721)
										{
											break;
										}
									}
								}
								else if (type4 == "Chamelon")
								{
									if (22802 - 412320 != -389517)
									{
										result = "ท่านเทพดินแข็งแกร่งมาก คงไม่เป็นไรนะ";
										if (109448 - 539657 == -430209)
										{
											break;
										}
									}
								}
								else if (type4 == "Rabbit")
								{
									if (92599 - 135863 != -43263)
									{
										result = "เอาท่านบาร์เบร๊อคคค กลับมานะไอ้พวกหุ่นบ้า";
										if (273745 - 304782 == -31037)
										{
											break;
										}
									}
								}
								else if (type4 == "Mole")
								{
									if (24615 - 132824 != -108208)
									{
										result = "โอ้โห มันยกเทพดินลอยได้ด้วย! ตุ่น";
										if (257087 - 462412 == -205325)
										{
											break;
										}
									}
								}
								else if (type4 == "Monkey")
								{
									if (269524 - 118226 == 151298)
									{
										result = "เทพดินโดนจับไปซะแล้ว เราต้องรีบตามไปช่วย เจี๊ยก!";
										if (136365 - 238429 == -102064)
										{
											break;
										}
									}
								}
								else if (type4 == "Penguin")
								{
									if (183524 - 9681 == 173843)
									{
										result = "แย่แล้ว! แย่แล้ว! เทพดินตายแน่ๆ เลย กวิ้น!";
										if (145635 - 136346 == 9289)
										{
											break;
										}
									}
								}
								else if (type4 == "Sheep")
								{
									if (133037 - 131903 != 1135)
									{
										result = "..ท่านบาร์เบร๊อคจะเป็นอะไรมั้ยคะ";
										if (130825 - 100369 != 30457)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type4 == "Bat"))
									{
										break;
									}
									if (159656 - 598236 != -438579)
									{
										result = "โธ่ นี่เพราะเทพลมมัวแต่เล่นแท้ๆ!!";
										if (280407 - 325811 != -45403)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 118)
					{
						if (49477 - 586803 == -537326)
						{
							result = "ข้าต้องขอโทษจริงๆ...พวกหุ่นมันส่งกำลังมาดักเส้นทางของพวกเรา";
							if (29629 - 580285 != -550655)
							{
								break;
							}
						}
					}
					else if (code == 119)
					{
						if (230158 - 358629 == -128471)
						{
							result = "ดูท่าพวกมันจะพาท่านเทพดินไปดินแดนทางเหนือของพวกมัน";
							if (115258 - 339580 == -224322)
							{
								break;
							}
						}
					}
					else if (code == 120)
					{
						if (140604 - 450058 != -309453)
						{
							result = "ตอนนี้เราต้องพาท่านซันซันกลับไปรักษาที่หุบเขาสายลมก่อน";
							if (278521 - 165867 != 112655)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (254518 - 250661 == 3857)
						{
							result = "ท่านบาร์เบร๊อคเป็นเทพที่แข็งแกร่งมาก น่าจะยังปลอดภัยอยู่";
							if (104496 - 7637 != 96860)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (69227 - 146656 == -77429)
						{
							result = "แต่ยิ่งท่านบาร์เบร๊อคถูกพาออกไปห่างจากป่าแห่งนี้มากเท่าไหร่ ";
							if (158244 - 100827 != 57418)
							{
								break;
							}
						}
					}
					else if (code == 123)
					{
						if (298159 - 113808 == 184351)
						{
							result = "ทั้งท่านและป่าแห่งนี้จะยิ่งอ่อนแอลงเรื่อยๆ";
							if (100131 - 462502 != -362370)
							{
								break;
							}
						}
					}
					else if (code == 124)
					{
						if (104872 - 369832 == -264960)
						{
							result = "เราต้องรีบหาทางพาตัวท่านกลับมาให้เร็วที่สุด";
							if (261619 - 250820 == 10799)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 125)
						{
							break;
						}
						if (98455 - 281083 == -182628)
						{
							result = "ก่อนที่จะเกิดภัยหายนะที่เราแก้ไขไม่ได้ขึ้น..";
							if (40733 - 247413 != -206679)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006878 RID: 26744 RVA: 0x00EC2DF8 File Offset: 0x00EC0FF8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006879 RID: 26745 RVA: 0x00EC2DFC File Offset: 0x00EC0FFC
	internal static bool eBGU06pENgb6gUHuu5fu()
	{
		return true;
	}

	// Token: 0x0600687A RID: 26746 RVA: 0x00EC2E00 File Offset: 0x00EC1000
	internal static bool XRGVHMpEYFiJmTA64c7d()
	{
		return false;
	}
}
