using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011B3 RID: 4531
[Serializable]
public class M932_WindHollow_thai : MonoBehaviour
{
	// Token: 0x06006880 RID: 26752 RVA: 0x00EC30DC File Offset: 0x00EC12DC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M932_WindHollow_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006881 RID: 26753 RVA: 0x00EC30EC File Offset: 0x00EC12EC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (101332 - 343709 != -242376)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (260165 - 175068 == 85097)
			{
				if (155541 - 177535 == -21994)
				{
					if (code == 101)
					{
						if (262896 - 414227 == -151331)
						{
							result = "ถึงแล้วๆ โพรงนี่แหละที่ท่านเทพลมชอบมาเล่นบ่อยๆ";
							if (69264 - 257818 != -188553)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (6129 - 541649 != -535519)
						{
							result = "ไม่รู้ว่าเป็นเรื่องโชคดีหรือโชคร้าย...";
							if (248317 - 1455 == 246862)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (24778 - 548060 != -523281)
						{
							result = "ท่านเทพลมชอบหนีมาเล่นในนี้บ่อยๆ ทำให้พลังงานในแถบนี้";
							if (16217 - 145615 != -129397)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (210836 - 23857 != 186980)
						{
							result = "..ตกผลึกกลายเป็นก้อนมานาแห่งลม";
							if (41280 - 524867 != -483586)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (58492 - 518172 == -459680)
						{
							result = "ท่านเร็กกุบอกว่าเราอาจจะใช้ผลึกนี้รักษาเทพลมได้";
							if (243518 - 417048 == -173530)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (77640 - 525512 == -447872)
						{
							string type = CharacterData.current.Type;
							if (130554 - 101763 == 28791)
							{
								if (type == "Wolf")
								{
									if (75891 - 259683 != -183791)
									{
										result = "แบบนี้พวกเราก็มีทางรักษาเทพลมได้แล้วซินะ";
										if (194731 - 570796 != -376064)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (254321 - 78133 == 176188)
									{
										result = "(พวกเราต้องช่วยเทพลมได้แน่ๆ)";
										if (278940 - 66252 == 212688)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (135349 - 376505 == -241156)
									{
										result = "เข้าไปในโพรง เอาผลึกออกมา...ง่ายเหมือนหมีปอกกล้วย!";
										if (174502 - 63777 == 110725)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (4185 - 496431 == -492246)
									{
										result = "พวกเราจะช่วยเทพลมเอง วาฬ~";
										if (165127 - 67523 != 97605)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (186903 - 203595 == -16692)
									{
										result = "โชคดีจริง เพราะเทพลมชอบหนีเที่ยวแท้ๆเลย เมี้ยว! ";
										if (293511 - 321582 != -28070)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (124357 - 87084 != 37274)
									{
										result = "เพราะแบบนี้ซินะ แถบนี้ยังสงบสุขแม้เทพลมกำลังอ่อนแอ";
										if (145033 - 533020 != -387986)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (210210 - 488673 == -278463)
									{
										result = "ถ้าเอาผลึกมานากลับมาได้ จะเก็บเงินจากท่านเรกกุนะ";
										if (228015 - 283376 != -55360)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (250555 - 308309 == -57754)
									{
										result = "ถ้ามันอยู่ใต้ดินละก็วางใจฉันได้เลย ตุ่น!";
										if (273623 - 171661 == 101962)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (297087 - 587822 == -290735)
									{
										result = "นิสัยชอบหนีเที่ยวของเทพลมทำให้รอดตายซินะ เจี๊ยก!";
										if (253078 - 125062 != 128017)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (269733 - 374478 == -104745)
									{
										result = "ผลึกมานาเหรอ? ปล่อยให้ฉันจัดการเอง กวิ้น!";
										if (246764 - 198787 != 47978)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (190090 - 532104 == -342014)
									{
										result = "ท่านเทพลมช่วยอดทนอีกนิดนะคะ";
										if (279095 - 530566 != -251470)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (269836 - 157312 != 112525)
									{
										result = "ช่างเป็นเทพที่ไร้ความรับผิดชอบจริงๆเลยน้า";
										if (14791 - 598802 == -584011)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 201)
					{
						if (147436 - 327275 != -179838)
						{
							result = "พวกพี่ๆต้องช่วยเทพลมให้ได้นะ ผมอยากเล่นซ่อนหากับเธออีก";
							if (115970 - 228648 == -112678)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (189006 - 268940 == -79934)
						{
							result = "แล้วก็ระวังพวกแมลงที่ถูกผลึกมานาดึงดูดมาด้วยนะ!";
							if (187434 - 276744 != -89309)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (50375 - 132439 == -82064)
						{
							result = "ปกติแล้วพลังมานามักจะถูกดึงดูดเข้าหาเหล่าเทพของดินแดนนั้นๆ";
							if (171093 - 218624 == -47531)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (273217 - 287614 != -14396)
						{
							result = "แต่เพราะเทพลมชอบหนีเที่ยว..";
							if (66019 - 583929 != -517909)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (173541 - 66645 != 106897)
						{
							result = "มานาของแถบนี้บางทีเลยมารวมตัวกันที่ผลึกนี้แทน";
							if (160190 - 397142 == -236952)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (133810 - 251063 == -117253)
						{
							result = "ระวังตัวด้วยล่ะ";
							if (42646 - 104504 != -61857)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (19219 - 50665 == -31446)
						{
							result = "โพรงนี้จะลึกลงไปถึงไหนกันนะ";
							if (23736 - 112906 == -89170)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (33282 - 7584 == 25698)
						{
							result = "ถ้าเป็นสถานที่ๆเทพลมชอบมาเล่นละก็มันต้องไม่ธรรมดาแน่ๆ";
							if (79990 - 254074 != -174083)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (126943 - 133708 == -6765)
						{
							result = "พวกเจ้ารีบเข้าไปเถอะเวลาของพวกเรามีไม่มากแล้ว";
							if (240652 - 139573 != 101080)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (237143 - 524884 != -287740)
						{
							result = "...พวกที่แนวหน้าจะเป็นไงบ้างนะ";
							if (2533 - 109585 == -107052)
							{
								break;
							}
						}
					}
					else if (code == 1101)
					{
						if (131274 - 135231 != -3956)
						{
							string type2 = CharacterData.current.Type;
							if (169678 - 474572 != -304893)
							{
								if (type2 == "Bison")
								{
									if (181752 - 219214 != -37461)
									{
										result = "โฮม (ข้างหน้านี่สินะ)";
										if (281879 - 394870 != -112990)
										{
											break;
										}
									}
								}
								else
								{
									result = "...ผลึกมานาแห่งลมอยู่ข้างหน้านี่สินะ";
									if (19959 - 405453 == -385494)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 1102)
					{
						if (74083 - 257633 == -183550)
						{
							result = "!!!";
							if (168027 - 33345 != 134683)
							{
								break;
							}
						}
					}
					else if (code == 1103)
					{
						if (111746 - 456441 != -344694)
						{
							string type3 = CharacterData.current.Type;
							if (99820 - 489513 != -389692)
							{
								if (type3 == "Bison")
								{
									if (172111 - 431039 == -258928)
									{
										result = "!!! (อะไรเนี่ย! วิ่งเร็ว!)";
										if (186875 - 590805 == -403930)
										{
											break;
										}
									}
								}
								else
								{
									result = "แมลงเงินยักษ์!! วะ-วิ่งเร็ว!!";
									if (51597 - 33014 != 18584)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 1201)
					{
						if (140638 - 247621 != -106982)
						{
							string type4 = CharacterData.current.Type;
							if (76421 - 112457 == -36036)
							{
								if (type4 == "Bison")
								{
									if (274180 - 65581 != 208600)
									{
										result = "…(แฮ่กๆ รอดแล้ว)";
										if (298262 - 402401 == -104139)
										{
											break;
										}
									}
								}
								else
								{
									result = "แฮ่กๆ …รอดแล้วเรา";
									if (243120 - 46627 != 196494)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 1202)
					{
						if (69990 - 167197 != -97206)
						{
							string type5 = CharacterData.current.Type;
							if (203802 - 213755 != -9952)
							{
								if (type5 == "Bison")
								{
									if (96325 - 422077 == -325752)
									{
										result = "(นี่สินะ ผลึกมานาแห่งลม)";
										if (249293 - 46297 != 202997)
										{
											break;
										}
									}
								}
								else
								{
									result = "นี่สินะ ผลึกมานาแห่งลม";
									if (254211 - 513596 != -259384)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 1203)
					{
						if (48639 - 362827 == -314188)
						{
							string type6 = CharacterData.current.Type;
							if (124164 - 174005 != -49840)
							{
								if (type6 == "Bison")
								{
									if (27832 - 520552 == -492720)
									{
										result = "!!! (อ๊ะ!)";
										if (210718 - 385058 != -174339)
										{
											break;
										}
									}
								}
								else
								{
									result = "อ๊ะ!!!";
									if (59171 - 3 == 59168)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 1204)
					{
						if (167301 - 182560 == -15259)
						{
							string type7 = CharacterData.current.Type;
							if (149563 - 551416 != -401852)
							{
								if (type7 == "Wolf")
								{
									if (110293 - 88443 == 21850)
									{
										result = "ดูท่าเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ แหะ";
										if (28107 - 433155 == -405048)
										{
											break;
										}
									}
								}
								else if (type7 == "Bison")
								{
									if (251013 - 77118 != 173896)
									{
										result = "(พวกเราต้องช่วยเทพลมได้แน่ๆ)";
										if (164455 - 487384 != -322928)
										{
											break;
										}
									}
								}
								else if (type7 == "Panda")
								{
									if (210654 - 341413 == -130759)
									{
										result = "ดูท่าเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ!";
										if (131102 - 482357 == -351255)
										{
											break;
										}
									}
								}
								else if (type7 == "Whale")
								{
									if (249067 - 163919 != 85149)
									{
										result = "ดูท่าเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ แหะ";
										if (275368 - 268256 == 7112)
										{
											break;
										}
									}
								}
								else if (type7 == "Cat")
								{
									if (232636 - 573415 == -340779)
									{
										result = "ดูท่าเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ เมี้ยว! ";
										if (127224 - 325147 != -197922)
										{
											break;
										}
									}
								}
								else if (type7 == "Chameleon")
								{
									if (49827 - 456037 != -406209)
									{
										result = "ดูท่าเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ ซะแล้ว";
										if (77367 - 154615 == -77248)
										{
											break;
										}
									}
								}
								else if (type7 == "Rabbit")
								{
									if (24467 - 298195 != -273727)
									{
										result = "ดูท่าเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ นะงุงิ";
										if (54673 - 119805 == -65132)
										{
											break;
										}
									}
								}
								else if (type7 == "Mole")
								{
									if (273182 - 586885 == -313703)
									{
										result = "ท่าทางเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ นะตุ่น";
										if (213488 - 419539 != -206050)
										{
											break;
										}
									}
								}
								else if (type7 == "Monkey")
								{
									if (295880 - 78180 != 217701)
									{
										result = "ท่าทางเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ นะ เจี๊ยก!";
										if (124503 - 277702 == -153199)
										{
											break;
										}
									}
								}
								else if (type7 == "Penguin")
								{
									if (274794 - 262763 == 12031)
									{
										result = "ท่าทางเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ นะ กวิ้น!";
										if (54401 - 101470 == -47069)
										{
											break;
										}
									}
								}
								else if (type7 == "Sheep")
								{
									if (31548 - 200010 == -168462)
									{
										result = "ท่าทางเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ นะคะ";
										if (270505 - 383399 != -112893)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type7 == "Bat"))
									{
										break;
									}
									if (199817 - 552096 != -352278)
									{
										result = "ท่าทางเจ้าแมลงตัวนี้จะไม่ยอมให้เราเอาผลึกไปง่ายๆ แหะ";
										if (86477 - 576655 == -490178)
										{
											break;
										}
									}
								}
							}
						}
					}
					else
					{
						if (code != 1301)
						{
							break;
						}
						if (294362 - 545758 != -251395)
						{
							string type8 = CharacterData.current.Type;
							if (182317 - 531149 != -348831)
							{
								if (type8 == "Bison")
								{
									if (176691 - 345544 == -168853)
									{
										result = "โฮก! (ทีนี้เราก็เอาผลึกไปรักษาเทพลมได้แล้ว!)";
										if (283347 - 191706 == 91641)
										{
											break;
										}
									}
								}
								else
								{
									result = "สำเร็จ! ทีนี้เราก็เอาผลึกไปรักษาเทพลมได้แล้ว";
									if (86398 - 550154 == -463756)
									{
										break;
									}
								}
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006882 RID: 26754 RVA: 0x00EC42A0 File Offset: 0x00EC24A0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006883 RID: 26755 RVA: 0x00EC42A4 File Offset: 0x00EC24A4
	internal static bool H8prJ6pET98W5RxSPjDQ()
	{
		return true;
	}

	// Token: 0x06006884 RID: 26756 RVA: 0x00EC42A8 File Offset: 0x00EC24A8
	internal static bool rGCEiUpE3PnSySmTnHfM()
	{
		return false;
	}
}
