using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011B4 RID: 4532
[Serializable]
public class M934_LadyNoirDarkRitual_thai : MonoBehaviour
{
	// Token: 0x06006885 RID: 26757 RVA: 0x00EC42AC File Offset: 0x00EC24AC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M934_LadyNoirDarkRitual_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006886 RID: 26758 RVA: 0x00EC42BC File Offset: 0x00EC24BC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (120683 - 48218 != 72466)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (222397 - 17928 == 204469)
			{
				if (158262 - 1907 == 156355)
				{
					if (code == 1001)
					{
						if (87091 - 401069 != -313977)
						{
							string type = CharacterData.current.Type;
							if (223348 - 297519 != -74170)
							{
								if (type == "Wolf")
								{
									if (30022 - 68790 != -38767)
									{
										result = "...ปราสาทเงาเริ่มพังทลายเพราะขาดเทพเงาซินะ";
										if (128022 - 303060 == -175038)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (28785 - 306114 != -277328)
									{
										result = "โฮก!!(เกิดอะไรขึ้นกับปราสาทกัน!?)";
										if (180882 - 9322 != 171561)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (94526 - 58877 != 35650)
									{
										result = "เมื่อไร้ซึ่งเทพเงา ดินแดนแห่งนี้ก็อยู่ไม่ได้...";
										if (250084 - 470529 == -220445)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (211160 - 222046 != -10885)
									{
										result = "ทำไมที่นี้ถึงเละแบบนี้ล่ะ วาฬ!";
										if (287839 - 461619 == -173780)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (299082 - 562968 != -263885)
									{
										result = "ทำไมปราสาทของเทพเงาถึงเป็นแบบนี้ล่ะ เหมียว! ";
										if (97157 - 52345 == 44812)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (47740 - 132532 != -84791)
									{
										result = "แม้แต่ที่นี้ก็เริ่มเสื่อมโทรมเพราะขาดเทพซินะ...";
										if (67832 - 583052 == -515220)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (254269 - 562573 == -308304)
									{
										result = "ว้าย ทำไมปราสาทของเทพงานถึงเละแบบนี้ หง่า.....";
										if (253989 - 489692 != -235702)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (158990 - 434632 != -275641)
									{
										result = "จ้าก! ใครมาวางระเบิดปราสาทของท่านเซร่ารึเปล่าเนี้ย!";
										if (144329 - 380591 != -236261)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (244814 - 533189 == -288375)
									{
										result = "เกิดอะไรขึ้นกับที่นี้กันนะ เจี๊ยก!";
										if (272152 - 287476 != -15323)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (252581 - 511089 != -258507)
									{
										result = "เกิดอะไรขึ้นกันเนี้ย กวิ้น!";
										if (798 - 367592 == -366794)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (188057 - 498250 == -310193)
									{
										result = "...ทำไมปราสาทของท่านเซร่าถึงกลายเป็นแบบนี้ล่ะ?";
										if (59106 - 218817 == -159711)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (69209 - 277611 != -208401)
									{
										result = "เหอะ ได้ยินว่ามีค้างคาวตัวอื่นมาตั้งตัวเป็นใหญ่อยู่ที่นี่";
										if (261411 - 365732 == -104321)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 1002)
					{
						if (2226 - 185572 != -183345)
						{
							string type2 = CharacterData.current.Type;
							if (159762 - 439679 == -279917)
							{
								if (type2 == "Wolf")
								{
									if (132214 - 219446 == -87232)
									{
										result = "แต่นี้ก็ไม่ใช่เวลามาคิดเรื่องพวกนี้ เราต้องหยุดพวกลัทธิเงาให้ได้!";
										if (42862 - 453239 != -410376)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (266397 - 220178 == 46219)
									{
										result = "โฮก!!(หรือพวกลัทธิเงาจะเป็นบ้าไปหมดแล้ว!?)";
										if (264435 - 356452 == -92017)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (286332 - 77219 != 209114)
									{
										result = "ถ้าอย่างนั้นลัทธิเงา จะพยายามเรียกเทพเงากลับมางั้นหรือ!?";
										if (64604 - 265311 != -200706)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (254599 - 541550 == -286951)
									{
										result = "หรือเพราะว่าพิธีกรรมของพวกลัทธิเงานะ";
										if (93253 - 314430 != -221176)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (185392 - 179898 != 5495)
									{
										result = "แบบนี้ของที่ฉันเล็งไว้ตอนคราวที่แล้วก็เละเทะหมดซิ! ";
										if (32359 - 58347 == -25988)
										{
											break;
										}
									}
								}
								else if (type2 == "Chameleon")
								{
									if (135625 - 302499 != -166873)
									{
										result = "ไม่รู้ว่าพวกลัทธิเงาคิดจะทำอะไรแต่เราต้องหยุดไว้ให้ได้!";
										if (205396 - 8070 == 197326)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (212206 - 131211 != 80996)
									{
										result = "แบบนี้ก็คงไม่มีอะรพอเอาไปขายได้แล้วละมั้ง.....";
										if (64298 - 102923 == -38625)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (94150 - 349842 == -255692)
									{
										result = "หรือว่าจะเป็นเพราะ นุ้คที่เราเผลอลืมทิ้งไว้เมื่อตอนนั้น...";
										if (251189 - 139821 == 111368)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (252487 - 469978 == -217491)
									{
										result = "หรือเพราะว่าพวกเราจัดการกับเทพเงาไปกันนะ เจี๊ยก";
										if (214853 - 460046 == -245193)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (49101 - 85144 != -36042)
									{
										result = "เพราะพวกเราจัดการเทพเงาไปซินะ กวิ้น!";
										if (190264 - 431772 == -241508)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (54070 - 194674 != -140603)
									{
										result = "...เพราะว่าท่านเซร่าไม่อยู่แล้วปราสาทเลยกลายเป็นแบบนี้ซินะ";
										if (98150 - 230067 != -131916)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (237016 - 337956 != -100939)
									{
										result = "มาลองดูกันสิ ว่าใครจะแจ๋วไปกว่าชั้นได้ โฮะๆๆๆ";
										if (4321 - 487450 == -483129)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 1011)
					{
						if (249847 - 394824 == -144977)
						{
							result = "โอม ข้าขอสาปแช่งเหล่ากองทัพแสง ที่บังอาจมาลบหลู่ท่านเทพเงา";
							if (225577 - 324246 == -98669)
							{
								break;
							}
						}
					}
					else if (code == 1012)
					{
						if (252912 - 543115 == -290203)
						{
							result = "ขอให้พวกมันพบแต่ความพินาศ ย่อยยับ  อับปาง";
							if (12734 - 190088 == -177354)
							{
								break;
							}
						}
					}
					else if (code == 1013)
					{
						if (79549 - 389323 != -309773)
						{
							result = "ให้เจ้าโบลดาสและกองทัพมันท้องเสียระหว่างสู้ และ...";
							if (207870 - 591765 != -383894)
							{
								break;
							}
						}
					}
					else if (code == 1014)
					{
						if (268834 - 213488 == 55346)
						{
							result = "หยุดนะ!";
							if (86598 - 341809 != -255210)
							{
								break;
							}
						}
					}
					else if (code == 1015)
					{
						if (261579 - 440217 != -178637)
						{
							result = "นึกว่าใครที่แท้ก็เหล่าผู้กล้าจากกองทัพเทพแสงเองเรอะ";
							if (94527 - 133487 == -38960)
							{
								break;
							}
						}
					}
					else if (code == 1016)
					{
						if (134458 - 257365 != -122906)
						{
							string type3 = CharacterData.current.Type;
							if (110862 - 477511 == -366649)
							{
								if (type3 == "Wolf")
								{
									if (282381 - 293434 == -11053)
									{
										result = "เทพเงาไม่อยู่แล้ว ลัทธิเจ้าหมดอนาคตแล้ว";
										if (20596 - 207519 != -186922)
										{
											break;
										}
									}
								}
								else if (type3 == "Bison")
								{
									if (43169 - 410269 == -367100)
									{
										result = "โฮก!!(อย่ามัวแต่ใช้คำสาปไร้สาระ มาสู้กันดีกว่า!)";
										if (232293 - 202209 == 30084)
										{
											break;
										}
									}
								}
								else if (type3 == "Panda")
								{
									if (204497 - 380391 == -175894)
									{
										result = "คำสาปพวกนั้นทำอะไรข้าไม่ได้หรอก เพราะข้ามีรีซีส!";
										if (211472 - 46485 == 164987)
										{
											break;
										}
									}
								}
								else if (type3 == "Whale")
								{
									if (199391 - 434077 == -234686)
									{
										result = "สาปอะไรก็สาปได้แต่อย่าแช่งให้ท้องเสีย มันเสียดายของนะวาฬ";
										if (295031 - 292988 != 2044)
										{
											break;
										}
									}
								}
								else if (type3 == "Cat")
								{
									if (52361 - 458987 != -406625)
									{
										result = "คำสาปงี่เง่าแบบนั้นทำอะไร พวกเราไม่ได้หรอก เหมียว ";
										if (275833 - 425336 == -149503)
										{
											break;
										}
									}
								}
								else if (type3 == "Chameleon")
								{
									if (54317 - 458112 == -403795)
									{
										result = "ยอมแพ้ซะดีๆ พิธีกรรมของพวกแกล้มเหลวแล้ว!";
										if (273491 - 21872 == 251619)
										{
											break;
										}
									}
								}
								else if (type3 == "Rabbit")
								{
									if (279269 - 34929 != 244341)
									{
										result = "(สาปให้ท้องเสียงั้นเหรอ ถ้างั้นยาของเราก็จะขายได้เยอะเลยซิ)";
										if (252589 - 158874 == 93715)
										{
											break;
										}
									}
								}
								else if (type3 == "Mole")
								{
									if (93889 - 521862 != -427972)
									{
										result = "ฉันไม่ยอมให้พิธีกรรมนี้สำเร็จหรอกนะ ตุ่น!";
										if (180716 - 146565 == 34151)
										{
											break;
										}
									}
								}
								else if (type3 == "Monkey")
								{
									if (67760 - 44953 == 22807)
									{
										result = "นึกว่าจะปลุกท่านเซร่ากลับมา แต่นี้สาปเราให้ท้องเสียเองหรอ เจี๊ยก";
										if (123743 - 463906 != -340162)
										{
											break;
										}
									}
								}
								else if (type3 == "Penguin")
								{
									if (135004 - 514830 == -379826)
									{
										result = "เพราะสู้พวกเราไม่ได้เลยคิดจะใช้คาถาซินะ กวิ้น!";
										if (239429 - 69370 != 170060)
										{
											break;
										}
									}
								}
								else if (type3 == "Sheep")
								{
									if (277435 - 378508 == -101073)
									{
										result = "พวกเราเป็นสัตว์หางเหมือนกันอย่าทำร้ายกันเลยนะคะ";
										if (124039 - 267678 != -143638)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type3 == "Bat"))
									{
										break;
									}
									if (45861 - 322078 != -276216)
									{
										result = "เจ้าทำชั้นผิดหวังจริงๆ ตายซะเถอะยะ! -*-";
										if (131405 - 155076 != -23670)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 1017)
					{
						if (246545 - 403768 == -157223)
						{
							result = "ชิชะ เจ้าคงยังไม่รู้หรอกว่าเทพเงาไม่มีวันตาย";
							if (48342 - 560715 == -512373)
							{
								break;
							}
						}
					}
					else if (code == 1018)
					{
						if (167622 - 380384 != -212761)
						{
							result = "เงาและความมืดนั้นสถิตอยู่ทุกที่ เมื่อใดแสงมืดลงแล้วท่านจะกลับมา";
							if (175870 - 201232 == -25362)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 1019)
						{
							break;
						}
						if (234927 - 462432 == -227505)
						{
							result = "พวกแกมาก็ดีแล้ว ข้าจะจัดการพวกแกสังเวยท่านเทพเงาซะเลย!";
							if (38381 - 106383 != -68001)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006887 RID: 26759 RVA: 0x00EC5198 File Offset: 0x00EC3398
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006888 RID: 26760 RVA: 0x00EC519C File Offset: 0x00EC339C
	internal static bool zfkxPPpEXEuAUP1NplA4()
	{
		return true;
	}

	// Token: 0x06006889 RID: 26761 RVA: 0x00EC51A0 File Offset: 0x00EC33A0
	internal static bool E90WTCpEQjLlHnvMMZBn()
	{
		return false;
	}
}
