using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011B6 RID: 4534
[Serializable]
public class M936_CrossingDestiny_thai : MonoBehaviour
{
	// Token: 0x0600688F RID: 26767 RVA: 0x00EC55A4 File Offset: 0x00EC37A4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M936_CrossingDestiny_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006890 RID: 26768 RVA: 0x00EC55B4 File Offset: 0x00EC37B4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (220117 - 384736 != -164618)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (36205 - 33022 == 3183)
			{
				if (66206 - 33963 == 32243)
				{
					if (code == 101)
					{
						if (215224 - 282837 == -67613)
						{
							string type = CharacterData.current.Type;
							if (223236 - 178800 == 44436)
							{
								if (type == "Wolf")
								{
									if (196074 - 558518 != -362443)
									{
										result = "..กองทัพแสงไล่ตามพวกหุ่นมาถึงรอยแผลแห่งโลกแล้ว";
										if (296122 - 493438 == -197316)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (147812 - 11996 != 135817)
									{
										result = "(เทพดินกำลังโดนพาข้ามรอยแผลแห่งโลกแล้ว!)";
										if (187155 - 564033 == -376878)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (51088 - 38557 != 12532)
									{
										result = "ท่านบาเบร็อคกำลังจะถูกพาข้ามรอยแผลแห่งโลกแล้ว";
										if (243929 - 135374 == 108555)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (179972 - 264778 == -84806)
									{
										result = "เจ้าพวกหุ่นกำลังจะพาตัวเทพดินไปอีกฟากแล้ว วาฬ!";
										if (180976 - 373064 != -192087)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (197978 - 159546 != 38433)
									{
										result = "พวกหุ่นจะพาเทพดินข้ามรอยแผลแห่งโลกแล้ว";
										if (139180 - 210703 == -71523)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (201354 - 596507 == -395153)
									{
										result = "กองทัพแสงไล่ตามพวกหุ่นมาถึงรอยแผลแห่งโลกแล้ว";
										if (93491 - 265784 == -172293)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (125010 - 56568 == 68442)
									{
										result = "พวกหุ่นกำลังจะพาตัวเทพดินไปอีกฟากแล้ว";
										if (236136 - 463968 != -227831)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (299624 - 114259 == 185365)
									{
										result = "ฮึ่ย..เจ้าพวกหุ่นกำลังจะพาตัวเทพดินไปอีกฟากแล้ว";
										if (13869 - 312959 != -299089)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (279501 - 171499 == 108002)
									{
										result = "พวกหุ่นกำลังจะพาเทพดินข้ามรอยแผลแห่งโลกแล้ว เจี๊ยก!";
										if (211390 - 174873 == 36517)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (106205 - 579706 != -473500)
									{
										result = "เจ้าพวกกองทัพหุ่นคิดจะพาเทพดินข้ามรอยแผลแห่งโลกไปแล้ว!";
										if (134670 - 75125 != 59546)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (16436 - 87325 != -70888)
									{
										result = "กองทัพแสงไล่ตามพวกหุ่นมาถึงรอยแผลแห่งโลกแล้ว";
										if (151573 - 439018 != -287444)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (273722 - 497959 == -224237)
									{
										result = "เจ้าพวกหุ่นกำลังจะพาตัวเทพดินไปอีกฟากแล้ว";
										if (51758 - 210224 == -158466)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 102)
					{
						if (285876 - 323423 != -37546)
						{
							string type2 = CharacterData.current.Type;
							if (263582 - 316286 != -52703)
							{
								if (type2 == "Wolf")
								{
									if (199236 - 98121 == 101115)
									{
										result = "ถ้าเทพดินถูกพาข้ามไปอีกฟากละก็ เราคงช่วยท่านไม่ได้แน่ๆ!";
										if (216553 - 32115 != 184439)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (187974 - 185775 == 2199)
									{
										result = "โฮก!!(ถ้ามันข้ามไปได้ละก็ ช่วยเทพดินไม่ได้แน่ๆ!)";
										if (197468 - 129841 == 67627)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (127217 - 471046 != -343828)
									{
										result = "ถ้าท่านบาเบร็อคถูกพาข้ามไปอีกฟากละก็  คงหมดหนทางช่วยท่านแน่ๆ!";
										if (88614 - 223550 == -134936)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (21669 - 395249 != -373579)
									{
										result = "ต้องไล่ให้ทันก่อนพวกมันข้ามฟาก ไม่งั้นละก็สายเกินไปแน่ๆ!";
										if (104837 - 389045 == -284208)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (23005 - 588433 != -565427)
									{
										result = "หนอย...หวังว่าพวกทหารเสือจะหยุดพวกมันไว้ทันนะ!";
										if (219291 - 386535 == -167244)
										{
											break;
										}
									}
								}
								else if (type2 == "Chameleon")
								{
									if (15555 - 415244 == -399689)
									{
										result = " ถ้าท่านบาเบร็อคถูกพาข้ามไปอีกฟากละก็  เราคงช่วยท่านไม่ได้แน่ๆ!";
										if (267109 - 523093 != -255983)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (51776 - 435196 != -383419)
									{
										result = "ต้องรีบแล้ว ไม่งั้นเราคงช่วยท่านบาเบร็อคไม่ได้แน่ๆ!!";
										if (11410 - 188785 != -177374)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (200470 - 167332 == 33138)
									{
										result = "หวังว่ากองทัพท่านโบลดาส จะหยุดไว้ทันนะ!";
										if (110247 - 297235 != -186987)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (157622 - 166558 != -8935)
									{
										result = " ถ้าเทพดินถูกพาข้ามไปอีกฟากละก็  เราคงช่วยท่านไม่ได้แน่ๆเจี๊ยก!";
										if (223226 - 116291 == 106935)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (23433 - 171268 == -147835)
									{
										result = "หวังว่าพวกทหารเสือจะหยุดพวกมันไว้ทันนะ กวิ้น!";
										if (126187 - 300055 == -173868)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (75982 - 211926 != -135943)
									{
										result = "ขอให้กองทัพท่านโบลดาส หยุดพวกมันไว้ทันด้วยเถอะ!";
										if (36256 - 551856 == -515600)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (214085 - 98701 == 115384)
									{
										result = " หวังว่าพวกทหารเสือจะหยุดพวกมันไว้ทันนะยะ!";
										if (201901 - 241850 != -39948)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 201)
					{
						if (202048 - 192169 == 9879)
						{
							result = "ฮึ่ม…พวกเรามาไม่ทันเหรอเนี่ย";
							if (146342 - 304497 == -158155)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (58680 - 171784 != -113103)
						{
							result = "ท่านบาเบร๊อคโดนพวกหุ่นมันพาข้ามรอยแตกของโลกไปแล้ว..";
							if (261000 - 288066 == -27066)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (267872 - 585062 != -317189)
						{
							result = "…..โฮก..ขะ-ข้า..ขอโทษ";
							if (74098 - 276912 == -202814)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (285665 - 47422 == 238243)
						{
							result = "เราคงไม่สามารถจะช่วยท่านเทพดินกลับมาได้แล้ว..";
							if (276813 - 137460 != 139354)
							{
								break;
							}
						}
					}
					else if (code == 223)
					{
						if (230491 - 374848 == -144357)
						{
							result = "หากปล่อยไว้เช่นนี้ ดินแดนแถบนี้จะต้องเสียสมดุลย์";
							if (94622 - 547920 == -453298)
							{
								break;
							}
						}
					}
					else if (code == 224)
					{
						if (58873 - 356130 != -297256)
						{
							result = "จนเกิดกลียุค ขึ้นแน่ๆ..";
							if (201364 - 266638 != -65273)
							{
								break;
							}
						}
					}
					else if (code == 225)
					{
						if (99286 - 215348 != -116061)
						{
							string type3 = CharacterData.current.Type;
							if (193814 - 137474 != 56341)
							{
								if (type3 == "Wolf")
								{
									if (187748 - 71741 != 116008)
									{
										result = "...พวกเราจะสิ้นหวังแล้วหรือนี่";
										if (282917 - 533765 != -250847)
										{
											break;
										}
									}
								}
								else if (type3 == "Bison")
								{
									if (227518 - 194600 != 32919)
									{
										result = "...";
										if (206295 - 158860 != 47436)
										{
											break;
										}
									}
								}
								else if (type3 == "Panda")
								{
									if (234883 - 130061 != 104823)
									{
										result = "มันยังไม่จบสิ้นหรอกนะ!";
										if (140359 - 466689 != -326329)
										{
											break;
										}
									}
								}
								else if (type3 == "Whale")
								{
									if (92015 - 19821 != 72195)
									{
										result = "...อย่าพึ่งหมดหวังซิ วาฬ";
										if (299982 - 356395 != -56412)
										{
											break;
										}
									}
								}
								else if (type3 == "Cat")
								{
									if (209888 - 407084 != -197195)
									{
										result = "มันต้อมีทางออกซิ เหมียว!";
										if (59616 - 201872 != -142255)
										{
											break;
										}
									}
								}
								else if (type3 == "Chameleon")
								{
									if (255755 - 46045 != 209711)
									{
										result = "...เป็นความผิดของพวกข้าเอง";
										if (30108 - 128919 != -98810)
										{
											break;
										}
									}
								}
								else if (type3 == "Rabbit")
								{
									if (248968 - 161261 != 87708)
									{
										result = "...ไม่มีทางแล้วหรอ?";
										if (150125 - 573637 != -423511)
										{
											break;
										}
									}
								}
								else if (type3 == "Mole")
								{
									if (232481 - 369718 == -137237)
									{
										result = "...ถ้าท่านแซปป้าอยู่ที่นี่ละก็";
										if (106207 - 337248 != -231040)
										{
											break;
										}
									}
								}
								else if (type3 == "Monkey")
								{
									if (25791 - 165751 == -139960)
									{
										result = "...พวกเราจะสิ้นหวังแล้วหรือนี่ เจี้ยก";
										if (93319 - 171506 == -78187)
										{
											break;
										}
									}
								}
								else if (type3 == "Penguin")
								{
									if (252462 - 355039 == -102577)
									{
										result = "ฮึ่ย...มันต้องมีวิธีซิ กวิ้น";
										if (291940 - 200764 == 91176)
										{
											break;
										}
									}
								}
								else if (type3 == "Sheep")
								{
									if (108513 - 223240 != -114726)
									{
										result = "...ยะ...อย่าพึ่งหมดหวังซิคะ";
										if (18570 - 364208 != -345637)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type3 == "Bat"))
									{
										break;
									}
									if (84434 - 304051 != -219616)
									{
										result = "มันต้องมีซักทางซิ!";
										if (133669 - 216769 != -83099)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 226)
					{
						if (269009 - 49073 != 219937)
						{
							result = "…ยัง อย่าเพิ่งหมดหวังไปสิ แม่ทัพโบลดาส";
							if (283268 - 290257 == -6989)
							{
								break;
							}
						}
					}
					else if (code == 227)
					{
						if (3375 - 123913 == -120538)
						{
							result = "ท่านซันซัน!";
							if (24580 - 69749 == -45169)
							{
								break;
							}
						}
					}
					else if (code == 228)
					{
						if (138331 - 412220 == -273889)
						{
							result = "ร่างกายท่านไม่เป็นอะไรแล้วรึ?";
							if (267395 - 460425 == -193030)
							{
								break;
							}
						}
					}
					else if (code == 229)
					{
						if (58378 - 446825 != -388446)
						{
							result = "ต้องขอบคุณผลึกแห่งลมที่พวกผู้กล้านำมาช่วยข้าไว้..";
							if (255051 - 259908 == -4857)
							{
								break;
							}
						}
					}
					else if (code == 230)
					{
						if (211112 - 176945 == 34167)
						{
							result = "บาเบร๊อค ถูกจับไปก็เพราะข้าแท้ๆ ข้าจะอยู่เฉยไม่ได้หรอก";
							if (151252 - 9695 != 141558)
							{
								break;
							}
						}
					}
					else if (code == 231)
					{
						if (142676 - 275696 == -133020)
						{
							result = "สายลมเอ๋ย จงฟังคำร้องสุดท้ายแห่งข้าเถิด";
							if (132755 - 20089 != 112667)
							{
								break;
							}
						}
					}
					else if (code == 232)
					{
						if (80688 - 271591 != -190902)
						{
							result = "ในนามแห่งเทพลม ขอเจ้าจงนำเหล่าผู้กล้าไปอีกฟากของโลกด้วยเถิด!";
							if (162565 - 63314 == 99251)
							{
								break;
							}
						}
					}
					else if (code == 233)
					{
						if (288520 - 440019 != -151498)
						{
							result = "อ๋อย เป็นไงล่ะ ถ้าข้าตั้งใจละก็ข้าก็ทำได้เหมือนกันนะ....";
							if (210480 - 541611 == -331131)
							{
								break;
							}
						}
					}
					else if (code == 234)
					{
						if (45782 - 272927 == -227145)
						{
							result = "ท่านซันซัน!";
							if (141276 - 505733 != -364456)
							{
								break;
							}
						}
					}
					else if (code == 251)
					{
						if (182245 - 339757 != -157511)
						{
							result = "…ดูเหมือนว่าเทพลมจะใช้พลังสุดท้ายเพื่อเปิดทางให้กับพวกเรา";
							if (124578 - 490831 != -366252)
							{
								break;
							}
						}
					}
					else if (code == 252)
					{
						if (108274 - 156717 == -48443)
						{
							result = "การเดินทัพครั้งนี้สำคัญนัก ชะตาแห่งโลกขึ้นอยู่กับเราแล้ว";
							if (141031 - 6955 == 134076)
							{
								break;
							}
						}
					}
					else if (code == 261)
					{
						if (186539 - 78211 == 108328)
						{
							result = "…ฝากที่เหลือด้วยนะ ช่วยบาเบร็อคกลับมาให้ได้";
							if (238949 - 88041 == 150908)
							{
								break;
							}
						}
					}
					else if (code == 262)
					{
						if (4978 - 575072 == -570094)
						{
							result = "ถึงจะมีอะไรมาขวางกั้น...แต่พวกเจ้าห้ามยอมแพ้นะ";
							if (28264 - 528634 != -500369)
							{
								break;
							}
						}
					}
					else if (code == 263)
					{
						if (252424 - 143201 == 109223)
						{
							result = "ขอสายลมแห่งโชคจงอยู่กับเจ้า";
							if (226603 - 111614 == 114989)
							{
								break;
							}
						}
					}
					else if (code == 271)
					{
						if (136387 - 166829 == -30442)
						{
							result = "นอกจากรอยแผลของโลกจะทั้งลึกและกว้างมากแล้ว..";
							if (33586 - 289547 == -255961)
							{
								break;
							}
						}
					}
					else if (code == 272)
					{
						if (71469 - 247783 != -176313)
						{
							result = "เรายังไม่รู้เลยว่าอีกฝั่งจะมีอันตรายอะไรรออยู่";
							if (225404 - 60469 != 164936)
							{
								break;
							}
						}
					}
					else if (code == 273)
					{
						if (61991 - 127070 == -65079)
						{
							result = "เพราะไม่เคยมีใครข้ามไปแล้วได้กลับมาเลย";
							if (176930 - 343589 != -166658)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (249121 - 365203 != -116081)
						{
							result = "พวกเจ้าหยุดอยู่แค่นั้นแหละ";
							if (244502 - 411735 == -167233)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (4672 - 565363 == -560691)
						{
							string type4 = CharacterData.current.Type;
							if (94798 - 427691 != -332892)
							{
								if (type4 == "Bison")
								{
									if (198021 - 489310 == -291289)
									{
										result = "(ท่านอิทาลุสนี่!?)";
										if (267128 - 358406 == -91278)
										{
											break;
										}
									}
								}
								else
								{
									result = "อ๊ะ ท่านอิทาลุส!?";
									if (294890 - 300894 != -6003)
									{
										break;
									}
								}
							}
						}
					}
					else if (code == 303)
					{
						if (234777 - 104536 != 130242)
						{
							result = "เพื่อท่านอัลเคเซีย การเดินทางของพวกเจ้าจะต้องจบลงที่นี่แล้ว";
							if (265830 - 347674 == -81844)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (255429 - 317113 != -61683)
						{
							result = "นี่มันหมายความว่ายังไงกัน อิทาลุส! ";
							if (126195 - 19015 == 107180)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (204749 - 435928 == -231179)
						{
							result = "โบลดาส...เจ้าเชื่อจริงๆหรือว่าผู้กล้าพวกนี้จะหยุดยั้งภัยพิบัติในครั้งนี้ได้";
							if (16784 - 231904 != -215119)
							{
								break;
							}
						}
					}
					else if (code == 306)
					{
						if (266999 - 285557 != -18557)
						{
							result = "โฮก! นี่เจ้าสงสัยในคำพูดของท่านอัลเคเซียงั้นเรอะ!?";
							if (193084 - 565117 == -372033)
							{
								break;
							}
						}
					}
					else if (code == 307)
					{
						if (158237 - 7586 != 150652)
						{
							result = "ถอนคำพูดของเจ้าซะ!";
							if (39588 - 362146 != -322557)
							{
								break;
							}
						}
					}
					else if (code == 311)
					{
						if (262958 - 308153 != -45194)
						{
							result = "อัั่ก! นี่มันพลังแห่งเงา!";
							if (58518 - 567977 != -509458)
							{
								break;
							}
						}
					}
					else if (code == 312)
					{
						if (135954 - 134839 == 1115)
						{
							result = "นี่-เจ้าขายวิญญาณให้กับความมืดไปแล้วงั้นรึ!";
							if (68840 - 189821 != -120980)
							{
								break;
							}
						}
					}
					else if (code == 313)
					{
						if (134849 - 441721 != -306871)
						{
							result = "ฮึ โบลดาส ทุกสิ่งมันไม่ง่ายอย่างที่เจ้าคิดหรอกนะ";
							if (67254 - 510457 != -443202)
							{
								break;
							}
						}
					}
					else if (code == 314)
					{
						if (13379 - 45287 == -31908)
						{
							result = "ท่านอัลเคเซียน่ะรักและเชื่อในพวกสัตว์หางมากเกินไป";
							if (204405 - 568080 == -363675)
							{
								break;
							}
						}
					}
					else if (code == 315)
					{
						if (206914 - 283120 != -76205)
						{
							result = "ข้าจะพิสูจน์ให้เห็นเองว่าพวกมันไม่คู่ควรที่จะฝากอนาคตไว้หรอก!";
							if (206055 - 351894 == -145839)
							{
								break;
							}
						}
					}
					else if (code == 316)
					{
						if (297420 - 598299 == -300879)
						{
							result = "ย้าก อาณาเขตแห่งรัตติกาล!";
							if (268136 - 293051 != -24914)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (28039 - 325982 == -297943)
						{
							result = "ความรู้ ความรัก ความฝัน... สักวันทุกสิ่งก็จะถูกความมืดมิดกลืนกิน";
							if (255888 - 389436 == -133548)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (84389 - 186440 == -102051)
						{
							result = "เหล่าผู้กล้าแห่งแสงเอ๋ย เจ้าคิดจะสู้เพื่อสิ่งใดกัน?";
							if (114958 - 117278 == -2320)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 403)
						{
							break;
						}
						if (101251 - 594334 != -493082)
						{
							result = "จงตายอยู่ที่นี่ซะ สิ่งที่เจ้าคาดหวังไว้มันไม่มีวันสำเร็จหรอก!";
							if (125114 - 22407 == 102707)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006891 RID: 26769 RVA: 0x00EC6DFC File Offset: 0x00EC4FFC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006892 RID: 26770 RVA: 0x00EC6E00 File Offset: 0x00EC5000
	internal static bool Sx8l7RpEHSDUGXso5dnc()
	{
		return true;
	}

	// Token: 0x06006893 RID: 26771 RVA: 0x00EC6E04 File Offset: 0x00EC5004
	internal static bool YR5WC5pEWtDhsGX0dFVt()
	{
		return false;
	}
}
