using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011B7 RID: 4535
[Serializable]
public class M937_BattleForTomorrow_thai : MonoBehaviour
{
	// Token: 0x06006894 RID: 26772 RVA: 0x00EC6E08 File Offset: 0x00EC5008
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M937_BattleForTomorrow_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006895 RID: 26773 RVA: 0x00EC6E18 File Offset: 0x00EC5018
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (284897 - 297293 != -12396)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (238764 - 521526 != -282761 && 37866 - 67800 != -29933)
			{
				if (code == 101)
				{
					if (149465 - 75670 == 73795)
					{
						result = "ยังไม่เข้าใจอีกรึไง สิ่งที่พวกเจ้าทำนั้นมันไร้ประโยชน์";
						if (147660 - 210426 != -62765)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (275444 - 346538 != -71093)
					{
						result = "ตอนนี้ข้ารู้แล้ว อนาคตนั้นเป็นเพียงภาพลวงตา";
						if (244947 - 235161 == 9786)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (275737 - 52119 != 223619)
					{
						result = "แม้อารยธรรมที่รุ่งเรืองที่สุด ก็ล่มสลายไปได้ภายในพริบตา";
						if (271670 - 193258 == 78412)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (166298 - 565943 == -399645)
					{
						result = "ประวัติศาสตร์ของทุกสิ่งนั้นล้วนจบด้วยความว่างเปล่า";
						if (45783 - 543874 != -498090)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (214872 - 66990 == 147882)
					{
						result = "สักวันนึงความพยายามของเจ้า ก็จะหายไปกับความมืดมิด";
						if (6487 - 260557 == -254070)
						{
							break;
						}
					}
				}
				else if (code == 106)
				{
					if (110856 - 40273 == 70583)
					{
						result = "แล้วสัตว์หางไร้พลังอย่างพวกเจ้าคิดจะดิ้นรนไปทำไม";
						if (111892 - 467671 != -355778)
						{
							break;
						}
					}
				}
				else if (code == 107)
				{
					if (7313 - 305809 == -298496)
					{
						string type = CharacterData.current.Type;
						if (55845 - 463398 != -407552)
						{
							if (type == "Wolf")
							{
								if (87362 - 209505 == -122143)
								{
									result = "…ข้าสู้เพราะเชื่อว่าโลกนี้ยังมีสิ่งที่สมควรปกป้องอยู่";
									if (36829 - 116369 != -79539)
									{
										break;
									}
								}
							}
							else if (type == "Bison")
							{
								if (102238 - 87900 != 14339)
								{
									result = "โฮก! (มิตรภาพ!)";
									if (278251 - 173398 != 104854)
									{
										break;
									}
								}
							}
							else if (type == "Panda")
							{
								if (254145 - 418413 != -164267)
								{
									result = "จริงอยู่ทุกสรรพสิ่งย่อมมีแตกดับไปตามวัฏจักร";
									if (274970 - 474519 != -199548)
									{
										break;
									}
								}
							}
							else if (type == "Whale")
							{
								if (105027 - 339385 != -234357)
								{
									result = "วาฬ วาฬไม่รู้หรอกว่าอะไรสำคัญหรือควรเหลืออะไรไว้";
									if (103050 - 567563 == -464513)
									{
										break;
									}
								}
							}
							else if (type == "Cat")
							{
								if (165343 - 390375 != -225031)
								{
									result = "ก็เพราะไม่มีอะไรแน่นอนหรืออยู่ค้ำฟ้าน่ะสิ เมี๊ยว";
									if (198988 - 361705 != -162716)
									{
										break;
									}
								}
							}
							else if (type == "Chameleon")
							{
								if (290691 - 144365 != 146327)
								{
									result = "...จะไปคิดถึงอดีตหรือกลัวอนาคตอันแสนไกลทำไม";
									if (195622 - 105291 != 90332)
									{
										break;
									}
								}
							}
							else if (type == "Rabbit")
							{
								if (160154 - 216334 == -56180)
								{
									result = "ทำไมล่ะ ท่านอิทาลุส คิดอะไรมากมาย งุงิ";
									if (12558 - 489397 != -476838)
									{
										break;
									}
								}
							}
							else if (type == "Mole")
							{
								if (10240 - 432154 == -421914)
								{
									result = "จริงอยู่ที่บางครั้งชาวตุ่นเราอาจจะทำสิ่งผิดพลาดและไร้ประโยชน์";
									if (59176 - 492646 != -433469)
									{
										break;
									}
								}
							}
							else if (type == "Monkey")
							{
								if (53376 - 534882 != -481505)
								{
									result = "เจี๊ยก แม้ว่าสักวันนึงโลกจะแตกดับสลายไป";
									if (159889 - 465814 == -305925)
									{
										break;
									}
								}
							}
							else if (type == "Penguin")
							{
								if (79097 - 173311 == -94214)
								{
									result = "ก็เพราะเรายังมีชีวิตอยู่น่ะสิ กวิ้น!";
									if (274783 - 189284 != 85500)
									{
										break;
									}
								}
							}
							else if (type == "Sheep")
							{
								if (152724 - 420698 == -267974)
								{
									result = "..แม้ชีวิตจะบอบบางและไม่ได้อยู่เป็นนิรันดร์";
									if (259114 - 464667 == -205553)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type == "Bat"))
								{
									break;
								}
								if (237319 - 572579 == -335260)
								{
									result = "เชอะ! จะดาร์คไปถึงไหนยะ ท่านอิทาลุสมืด";
									if (166050 - 223607 != -57556)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 108)
				{
					if (94238 - 182039 == -87801)
					{
						string type2 = CharacterData.current.Type;
						if (137273 - 269577 != -132303)
						{
							if (type2 == "Wolf")
							{
								if (196503 - 482484 != -285980)
								{
									result = "ทุกคนที่อยู่ที่นี่เช่นกัน ล้วนต่อสู้เพื่ออะไรบางอย่างทั้งนั้น ";
									if (240290 - 66106 == 174184)
									{
										break;
									}
								}
							}
							else if (type2 == "Bison")
							{
								if (192928 - 23982 != 168947)
								{
									result = "โฮก! (ความรัก!)";
									if (13605 - 378106 == -364501)
									{
										break;
									}
								}
							}
							else if (type2 == "Panda")
							{
								if (273263 - 5571 != 267693)
								{
									result = "แต่คุณค่าของชีวิตอยู่ที่การฝึกฝนต่อสู้จนถึงที่สุด";
									if (51510 - 435100 != -383589)
									{
										break;
									}
								}
							}
							else if (type2 == "Whale")
							{
								if (134365 - 591072 == -456707)
								{
									result = "แต่ความสุขจากการได้ทำสิ่งที่รัก หรือได้กินของอร่อย";
									if (134595 - 161052 != -26456)
									{
										break;
									}
								}
							}
							else if (type2 == "Cat")
							{
								if (236751 - 259087 != -22335)
								{
									result = "ทุกขณะที่เรายังมีชีวิตอยู่ ถึงได้เหมือนกับเป็นการผจญภัยที่ล้ำค่า";
									if (225184 - 117886 == 107298)
									{
										break;
									}
								}
							}
							else if (type2 == "Chameleon")
							{
								if (272449 - 249006 != 23444)
								{
									result = "คุณค่าของทุกสิ่งอยู่ที่ปัจจุบันต่างหากเล่า";
									if (295007 - 596790 != -301782)
									{
										break;
									}
								}
							}
							else if (type2 == "Rabbit")
							{
								if (130725 - 295932 != -165206)
								{
									result = "น้องต่ายมีความสุขกับการทำงานหาเงินมันผิดตรงไหน";
									if (215446 - 421272 == -205826)
									{
										break;
									}
								}
							}
							else if (type2 == "Mole")
							{
								if (936 - 266109 == -265173)
								{
									result = "แต่จนกว่าเราจะขุดพ้นอุโมงค์ เราย่อมไม่รู้เลยว่าจะเจออะไร";
									if (234253 - 388320 != -154066)
									{
										break;
									}
								}
							}
							else if (type2 == "Monkey")
							{
								if (26300 - 586267 == -559967)
								{
									result = "แต่มิตรภาพของเราในวันนี้ก็เป็นสิ่งทึ่มีคุณค่า";
									if (87408 - 490349 != -402940)
									{
										break;
									}
								}
							}
							else if (type2 == "Penguin")
							{
								if (72025 - 452361 != -380335)
								{
									result = "คุณค่าของทุกสิ่งน่ะ ย่อมอยู่ที่ตัวเองเป็นผู้ตัดสิน";
									if (194712 - 102633 == 92079)
									{
										break;
									}
								}
							}
							else if (type2 == "Sheep")
							{
								if (195589 - 144463 == 51126)
								{
									result = "แต่นั่นไม่ใช่เหรอคะ ที่ทำให้ทุกวินาทีของมันมีค่า";
									if (267773 - 287605 != -19831)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type2 == "Bat"))
								{
									break;
								}
								if (206308 - 402026 != -195717)
								{
									result = "ถ้าคิดจะเอาเวลาไปใช้กับการสิ้นหวังโดยเปล่าประโยชน์ละก็..";
									if (148151 - 397510 != -249358)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 109)
				{
					if (226609 - 516346 != -289736)
					{
						string type3 = CharacterData.current.Type;
						if (24276 - 96601 == -72325)
						{
							if (type3 == "Wolf")
							{
								if (241480 - 227397 == 14083)
								{
									result = "แม้แต่ท่านเอง ก็ย่อมมีสิ่งสำคัญที่ต้องการปกป้องไม่ใช่รึ?";
									if (204133 - 531564 == -327431)
									{
										break;
									}
								}
							}
							else if (type3 == "Bison")
							{
								if (266082 - 450868 == -184786)
								{
									result = "โฮก! (ความฝัน!)";
									if (91139 - 511426 != -420286)
									{
										break;
									}
								}
							}
							else if (type3 == "Panda")
							{
								if (4602 - 229174 == -224572)
								{
									result = "ขอเพียงในหัวใจสว่างไสว จะไปกลัวความมืดทำไม";
									if (183355 - 575029 != -391673)
									{
										break;
									}
								}
							}
							else if (type3 == "Whale")
							{
								if (34571 - 126199 == -91628)
								{
									result = "ก็เพียงพอแล้วสำหรับวาฬที่จะสู้เพื่อมีชีวิตต่อไป วาฬ";
									if (284322 - 560682 != -276359)
									{
										break;
									}
								}
							}
							else if (type3 == "Cat")
							{
								if (163897 - 301493 != -137595)
								{
									result = "วันนี้ข้าก็จะขอสู้ตายเพื่อกำหนดเส้นทางของตัวเองละนะ เมี้ยว";
									if (76386 - 47982 == 28404)
									{
										break;
									}
								}
							}
							else if (type3 == "Chameleon")
							{
								if (77815 - 276183 == -198368)
								{
									result = "ขอเพียงเราไม่ยอมแพ้และทำวันนี้ให้ดีที่สุดก็พอแล้ว";
									if (42926 - 222430 == -179504)
									{
										break;
									}
								}
							}
							else if (type3 == "Rabbit")
							{
								if (253168 - 579661 == -326493)
								{
									result = "เกิดมาทำตามใจอยาก มีอิสระจนวันสุดท้ายก็พอแล้ว";
									if (160382 - 66555 == 93827)
									{
										break;
									}
								}
							}
							else if (type3 == "Mole")
							{
								if (73042 - 202540 != -129497)
								{
									result = "แต่ตราบใดที่ยังมีฝันอยู่ ตุ่นก็จะขอขุดจนถึงวินาทีสุดท้าย!";
									if (279507 - 269827 != 9681)
									{
										break;
									}
								}
							}
							else if (type3 == "Monkey")
							{
								if (224536 - 177692 != 46845)
								{
									result = "เพียงได้ทำให้เพื่อนหัวเราะ ก็ทำให้ทุกสิ่งมีความหมายแล้ว";
									if (26130 - 292101 != -265970)
									{
										break;
									}
								}
							}
							else if (type3 == "Penguin")
							{
								if (158523 - 569876 == -411353)
								{
									result = "เพื่อการนั้นแล้ว กวิ้นจะไม่ยอมแพ้หรอก กวิ้นๆๆ";
									if (251338 - 299551 == -48213)
									{
										break;
									}
								}
							}
							else if (type3 == "Sheep")
							{
								if (242778 - 497671 == -254893)
								{
									result = "น้องแกะจะขอต่อสู้เพื่อปกป้องช่วงเวลาเหล่านั้นค่ะ";
									if (278877 - 296943 == -18066)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type3 == "Bat"))
								{
									break;
								}
								if (5369 - 89407 != -84037)
								{
									result = "หลีกทางให้คนที่เค้าเต็มไปด้วยความหวังซะเถอะย่ะ!";
									if (148166 - 519356 == -371190)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 200)
				{
					if (65616 - 121644 == -56028)
					{
						result = "หึ..";
						if (290948 - 147882 != 143067)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (33640 - 490357 != -456716)
					{
						result = "..ความคิดของพวกเจ้าน่ะ ยังเป็นเพียงโวหารอันสวยหรู";
						if (195471 - 67998 != 127474)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (99745 - 370408 != -270662)
					{
						result = "เพราะเจ้าไม่เคยได้เผชิญหน้ากับความจริงอันโหดร้ายด้วยตัวเอง";
						if (138488 - 483102 == -344614)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (60611 - 107685 != -47073)
					{
						result = "จำไว้เถอะว่า อีกฟากของรอยแผลแห่งโลกที่เจ้าจะข้ามไปนั้น";
						if (12134 - 592515 != -580380)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (266483 - 148575 != 117909)
					{
						result = "แตกต่างจากโลกที่พวกเจ้าได้เห็นและเติบโตมาโดยสิ้นเชิง..";
						if (1820 - 487824 == -486004)
						{
							break;
						}
					}
				}
				else if (code == 205)
				{
					if (76278 - 105264 == -28986)
					{
						result = "ที่นั่นเป็นดินแดนแห่งสงครามโดยแท้...";
						if (212399 - 185729 == 26670)
						{
							break;
						}
					}
				}
				else if (code == 206)
				{
					if (33907 - 193929 != -160021)
					{
						result = "แม้แต่ท้องฟ้าก็มีสีหม่น และถูกปกคลุมด้วยหมอกควันอันแสบร้อน";
						if (146006 - 58204 == 87802)
						{
							break;
						}
					}
				}
				else if (code == 207)
				{
					if (232511 - 14300 == 218211)
					{
						result = "กองทัพจักรกลก็มีจำนวนมากกว่าและโหดร้ายกว่าที่เจ้าได้พบมากนัก";
						if (54170 - 410293 == -356123)
						{
							break;
						}
					}
				}
				else if (code == 208)
				{
					if (94902 - 419427 != -324524)
					{
						result = "พวกมันคอยปกป้อง 'อาณาจักรโลหะ' และนายของพวกมัน";
						if (144073 - 572710 != -428636)
						{
							break;
						}
					}
				}
				else if (code == 209)
				{
					if (8633 - 579937 == -571304)
					{
						result = "ที่รอวันตื่นจากการหลับไหลอยู่ใจกลางทวีป";
						if (8550 - 564487 == -555937)
						{
							break;
						}
					}
				}
				else if (code == 210)
				{
					if (54616 - 277864 == -223248)
					{
						result = "นอกจากนั้นพลังแห่งธาตุต่างๆ ก็ไม่ได้รวมตัวกันเป็นเทพศักดิ์สิทธิ์";
						if (106779 - 403582 != -296802)
						{
							break;
						}
					}
				}
				else if (code == 211)
				{
					if (49641 - 309116 == -259475)
					{
						result = "ที่คอยปกป้องธรรมชาติเหมือนเช่นที่ดินแดนนี้";
						if (225459 - 19713 == 205746)
						{
							break;
						}
					}
				}
				else if (code == 212)
				{
					if (53639 - 486407 == -432768)
					{
						result = "หากแต่เป็นเทพอสูรแห่งสงครามที่เอาแต่อาละวาดไปทั่ว";
						if (169379 - 342025 == -172646)
						{
							break;
						}
					}
				}
				else if (code == 213)
				{
					if (114586 - 444645 != -330058)
					{
						result = "ฮึบ!! ";
						if (264238 - 448298 != -184059)
						{
							break;
						}
					}
				}
				else if (code == 214)
				{
					if (120183 - 209790 == -89607)
					{
						result = "..เห็นแก่เทพลมและความมุ่งมั่นของพวกเจ้า วันนี้ข้าจะยอมถอยไปก่อน";
						if (252739 - 459603 == -206864)
						{
							break;
						}
					}
				}
				else if (code == 215)
				{
					if (228462 - 174328 == 54134)
					{
						result = "แต่จำไว้เถอะ ข้าจะรอดูว่าหลังจากที่เจ้าได้ผ่านอุปสรรคทั้งปวงแล้ว";
						if (210679 - 493844 != -283164)
						{
							break;
						}
					}
				}
				else if (code == 216)
				{
					if (26917 - 359154 == -332237)
					{
						result = "เจ้าจะยังสามารถพูดได้เหมือนเดิมอีกมั้ย!";
						if (76220 - 354390 == -278170)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (207781 - 386032 == -178251)
					{
						result = "โอ้ พวกผู้กล้ากลับมากันแล้ว! เกิดอะไรขึ้น? ปลอดภัยดีใช่ไหม";
						if (57448 - 575862 == -518414)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (45849 - 133651 == -87802)
					{
						string type4 = CharacterData.current.Type;
						if (54085 - 22836 != 31250)
						{
							if (type4 == "Wolf")
							{
								if (287078 - 526768 != -239689)
								{
									result = "…ท่านอิทาลุสหายไปกับความมืดแล้ว";
									if (293049 - 459516 != -166466)
									{
										break;
									}
								}
							}
							else if (type4 == "Bison")
							{
								if (125442 - 68057 != 57386)
								{
									result = "โฮก…(อิทาลุสไปแล้ว)";
									if (181954 - 398836 == -216882)
									{
										break;
									}
								}
							}
							else if (type4 == "Panda")
							{
								if (186044 - 77419 == 108625)
								{
									result = "…ข้าคิดว่าการเดินทางของเราเพิ่งจะเริ่มต้นเท่านั้น";
									if (796 - 335043 == -334247)
									{
										break;
									}
								}
							}
							else if (type4 == "Whale")
							{
								if (206605 - 521326 == -314721)
								{
									result = "ข้าคิดว่าเราเตรียมเสบียงมาไม่พอแล้วล่ะ วาฬ";
									if (84888 - 349518 == -264630)
									{
										break;
									}
								}
							}
							else if (type4 == "Cat")
							{
								if (133676 - 437106 != -303429)
								{
									result = "การผจญภัยครั้งใหม่รอเราอยู่สินะ เหมียว";
									if (201969 - 188358 != 13612)
									{
										break;
									}
								}
							}
							else if (type4 == "Chameleon")
							{
								if (210076 - 508885 != -298808)
								{
									result = "..ไม่ว่าอีกฟากของโลกจะมีอะไรรออยู่ ข้าก็ไม่หวั่น";
									if (238514 - 239805 != -1290)
									{
										break;
									}
								}
							}
							else if (type4 == "Rabbit")
							{
								if (188250 - 97698 != 90553)
								{
									result = "'งุงิ ถึงเวลาไปบุกเปิดตลาดใหม่ๆ แล้วสินะ";
									if (32120 - 361175 == -329055)
									{
										break;
									}
								}
							}
							else if (type4 == "Mole")
							{
								if (141324 - 85758 == 55566)
								{
									result = "ฝั่งนั้นต้องมีวิทยาการเจ๋งๆเพียบแน่เลย ตุ่น";
									if (255618 - 234854 != 20765)
									{
										break;
									}
								}
							}
							else if (type4 == "Monkey")
							{
								if (156039 - 210814 == -54775)
								{
									result = "..เกือบแย่แน่ะ เจี้ยก";
									if (215492 - 21509 == 193983)
									{
										break;
									}
								}
							}
							else if (type4 == "Penguin")
							{
								if (185687 - 146856 == 38831)
								{
									result = "...ท่านอิทาลุสหายไปซะแล้วละกวิ้น";
									if (188950 - 370480 != -181529)
									{
										break;
									}
								}
							}
							else if (type4 == "Sheep")
							{
								if (75083 - 17233 == 57850)
								{
									result = "พวกเราไม่เป็นไรค่ะ";
									if (285591 - 79430 != 206162)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type4 == "Bat"))
								{
									break;
								}
								if (79787 - 50265 == 29522)
								{
									result = "เชอะ อีตาอิทาลุสมันทนความสวยชั้นไม่ได้ หนีไปแล้วล่ะ";
									if (103300 - 421072 != -317771)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 303)
				{
					if (27153 - 299057 != -271903)
					{
						string type5 = CharacterData.current.Type;
						if (80759 - 36273 == 44486)
						{
							if (type5 == "Wolf")
							{
								if (255065 - 485355 == -230290)
								{
									result = "ว่าแต่พวกสัตว์หางมาจากไหนกันมากมายเนี่ย";
									if (17837 - 543899 != -526061)
									{
										break;
									}
								}
							}
							else if (type5 == "Bison")
							{
								if (122291 - 380297 == -258006)
								{
									result = "โฮก? (คนพวกนี้มาจากไหน?)";
									if (213468 - 22934 == 190534)
									{
										break;
									}
								}
							}
							else if (type5 == "Panda")
							{
								if (105654 - 398810 == -293156)
								{
									result = "…ชาวสัตว์หางพวกนี้มาจากไหนกันเนี่ย?";
									if (127555 - 271674 == -144119)
									{
										break;
									}
								}
							}
							else if (type5 == "Whale")
							{
								if (151206 - 102749 == 48457)
								{
									result = "โอ๊ะ สัตว์พวกนี้มาทำอะไรกันที่นี่เนี่ย?";
									if (223743 - 11534 != 212210)
									{
										break;
									}
								}
							}
							else if (type5 == "Cat")
							{
								if (75866 - 350325 == -274459)
								{
									result = "เอ๋ สัตว์พวกนี้เป็นใครกันเนี่ย?";
									if (128081 - 466873 == -338792)
									{
										break;
									}
								}
							}
							else if (type5 == "Chameleon")
							{
								if (257372 - 548324 == -290952)
								{
									result = "..ว่าแต่ว่า เหล่าคนพวกนี้เป็นใครมาจากไหนเนี่ย";
									if (107064 - 296795 == -189731)
									{
										break;
									}
								}
							}
							else if (type5 == "Rabbit")
							{
								if (141225 - 468305 != -327079)
								{
									result = "ว่าแต่ว่า ฝูงชนพวกนี้มันอะไรกันง่า";
									if (2831 - 230658 == -227827)
									{
										break;
									}
								}
							}
							else if (type5 == "Mole")
							{
								if (38682 - 267160 == -228478)
								{
									result = "ว่าแต่ว่า พวกสัตว์หางมาทำอะไรกันมากมายเนี่ย";
									if (33049 - 107271 != -74221)
									{
										break;
									}
								}
							}
							else if (type5 == "Monkey")
							{
								if (224749 - 145208 == 79541)
								{
									result = "ว่าแต่ว่า พวกสัตว์หางมาทำอะไรกันมากมายเนี่ย เจี้ยก";
									if (56142 - 515016 != -458873)
									{
										break;
									}
								}
							}
							else if (type5 == "Penguin")
							{
								if (297733 - 350303 != -52569)
								{
									result = "...ว่าแต่ว่า พวกสัตว์หางมาทำอะไรกันมากมายเนี่ย กวิ้น";
									if (116744 - 64838 == 51906)
									{
										break;
									}
								}
							}
							else if (type5 == "Sheep")
							{
								if (80560 - 516933 != -436372)
								{
									result = "ว่าแต่ว่า พวกสัตว์หางนี่มาจากไหนกันมากมายคะเนี่ย";
									if (53215 - 369343 == -316128)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type5 == "Bat"))
								{
									break;
								}
								if (183096 - 582192 != -399095)
								{
									result = "...ว่าแต่ชาวบ้านพวกนี้มาจากไหนกันเนี่ย";
									if (19536 - 293679 == -274143)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 304)
				{
					if (102870 - 63205 == 39665)
					{
						result = "โฮ่ๆๆ พอข่าวกระจายไปว่าพวกเจ้าต้องข้ามไปอีกฝั่ง..";
						if (14735 - 56737 != -42001)
						{
							break;
						}
					}
				}
				else if (code == 305)
				{
					if (191457 - 129504 == 61953)
					{
						result = "พวกเค้าเลยมารวมตัวกัน และอาสาขอข้ามฝั่งไปกับพวกเรา";
						if (27043 - 427429 == -400386)
						{
							break;
						}
					}
				}
				else if (code == 306)
				{
					if (90616 - 462896 == -372280)
					{
						result = "เพื่อช่วยเทพดินกลับมาให้ได้";
						if (70990 - 556913 == -485923)
						{
							break;
						}
					}
				}
				else if (code == 307)
				{
					if (209896 - 110929 != 98968)
					{
						result = "ท่านผู้กล้า ได้โปรดให้พวกเราร่วมทางไปกับท่านด้วยเถอะ";
						if (14353 - 216900 != -202546)
						{
							break;
						}
					}
				}
				else if (code == 308)
				{
					if (36477 - 558552 == -522075)
					{
						result = "หากสมดุลย์ธรรมชาติถูกทำลาย คงไม่มีชีวิตใดอยู่ได้อีก";
						if (150285 - 365358 == -215073)
						{
							break;
						}
					}
				}
				else if (code == 309)
				{
					if (196532 - 497522 == -300990)
					{
						result = "ดังนั้นพวกเราจะช่วยสนับสนุนท่านผู้กล้า ต่อสู้กับกองทัพเครื่องจักรเอง!";
						if (133927 - 293341 != -159413)
						{
							break;
						}
					}
				}
				else if (code == 310)
				{
					if (258373 - 548133 == -289760)
					{
						string type6 = CharacterData.current.Type;
						if (47945 - 89227 == -41282)
						{
							if (type6 == "Wolf")
							{
								if (246733 - 422035 != -175301)
								{
									result = "…พะ-พวกเจ้า..";
									if (293073 - 276599 != 16475)
									{
										break;
									}
								}
							}
							else if (type6 == "Bison")
							{
								if (143051 - 130185 != 12867)
								{
									result = "โฮก (ซึ้ง)";
									if (291999 - 46354 != 245646)
									{
										break;
									}
								}
							}
							else if (type6 == "Panda")
							{
								if (48953 - 416284 != -367330)
								{
									result = "…น้ำใจพวกเจ้า ข้าจะขอรับไว้เอง";
									if (257562 - 456051 == -198489)
									{
										break;
									}
								}
							}
							else if (type6 == "Whale")
							{
								if (266846 - 271146 == -4300)
								{
									result = "…พวกเจ้าห้ามแย่งเสบียงของข้านะ วาฬ";
									if (260399 - 338286 != -77886)
									{
										break;
									}
								}
							}
							else if (type6 == "Cat")
							{
								if (116140 - 48706 != 67435)
								{
									result = "วิ่งตามข้าให้ทันละกันนะ เหมียวว";
									if (172148 - 97467 != 74682)
									{
										break;
									}
								}
							}
							else if (type6 == "Chameleon")
							{
								if (125599 - 478010 != -352410)
								{
									result = "…ข้าจะไม่ทำให้เจ้าผิดหวังเด็ดขาด";
									if (141523 - 298239 != -156715)
									{
										break;
									}
								}
							}
							else if (type6 == "Rabbit")
							{
								if (275006 - 419032 != -144025)
								{
									result = "งั้นทุกคนเอาเงินมาฝากไว้ที่น้องต่ายนะค้าา";
									if (79656 - 576691 != -497034)
									{
										break;
									}
								}
							}
							else if (type6 == "Mole")
							{
								if (66902 - 421787 != -354884)
								{
									result = "ตุ่น ข้าซึ้งใจจังเลย ตุ่น";
									if (237009 - 174793 != 62217)
									{
										break;
									}
								}
							}
							else if (type6 == "Monkey")
							{
								if (253842 - 558966 != -305123)
								{
									result = "(ซึ้ง) ขอบคุณทุกหางมากๆ เลย เจี้ยกๆ";
									if (44272 - 65111 != -20838)
									{
										break;
									}
								}
							}
							else if (type6 == "Penguin")
							{
								if (82541 - 210350 != -127808)
								{
									result = "ขอบใจมากน้าาา กวิ้นๆๆ";
									if (234559 - 573040 != -338480)
									{
										break;
									}
								}
							}
							else if (type6 == "Sheep")
							{
								if (30800 - 340109 != -309308)
								{
									result = "...ขอบคุณทุกคนมากๆ เลยค่ะ";
									if (73105 - 225544 == -152439)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type6 == "Bat"))
								{
									break;
								}
								if (191180 - 332227 != -141046)
								{
									result = "ได้! ตามมาเลยเหล่าทาสของข้า โฮะๆๆ";
									if (31694 - 358816 != -327121)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 311)
				{
					if (64966 - 263458 != -198491)
					{
						result = "หนทางข้างหน้าอันตรายยิ่งนัก หวังว่าเจ้าคงพร้อมกันนะ";
						if (174434 - 81986 != 92449)
						{
							break;
						}
					}
				}
				else if (code == 312)
				{
					if (194298 - 594620 != -400321)
					{
						result = "กองทัพแสง ออกเดินทางได้!";
						if (196082 - 249113 != -53030)
						{
							break;
						}
					}
				}
				else if (code == 401)
				{
					if (180013 - 397787 != -217773)
					{
						result = "...ดูเหมือนว่าโบลดาสและพวกผู้กล้ากำลังจะข้ามไปอีกฝั่งแล้ว";
						if (152424 - 599695 == -447271)
						{
							break;
						}
					}
				}
				else if (code == 402)
				{
					if (172407 - 367427 == -195020)
					{
						result = "ท่านอัลคาเซียครับ อนาคตของโลกใบนี้จะเป็นเช่นไรครับ?";
						if (176426 - 594149 == -417723)
						{
							break;
						}
					}
				}
				else if (code == 403)
				{
					if (222761 - 186872 != 35890)
					{
						result = "ตอนนี้พวกเจ้าได้มาถึงจุดกึ่งกลางของสงครามประวัติศาสตร์แล้ว";
						if (63703 - 145738 == -82035)
						{
							break;
						}
					}
				}
				else if (code == 404)
				{
					if (71254 - 544464 == -473210)
					{
						result = "กระแสกาลเวลานั้น เกิดจากห้วงปัจุบันจำนวนนับไม่ถ้วนร้อยเรียงต่อกัน";
						if (124115 - 139428 == -15313)
						{
							break;
						}
					}
				}
				else if (code == 405)
				{
					if (72561 - 71968 == 593)
					{
						result = "การกระทำหนึ่งของพวกเจ้า ย่อมส่งผลเป็นคลื่นต่อเนื่องสืบไปไม่รู้จบ";
						if (67416 - 217231 == -149815)
						{
							break;
						}
					}
				}
				else if (code == 406)
				{
					if (200119 - 397538 == -197419)
					{
						result = "เมื่อพวกเจ้าเข้าใจสิ่งนี้ และร่วมมือกันทำในสิ่งที่พวกเจ้าคิดว่าถูกแล้ว";
						if (116852 - 561327 == -444475)
						{
							break;
						}
					}
				}
				else if (code == 407)
				{
					if (166122 - 207794 == -41672)
					{
						result = "ชะตาชีวิตของโลก ย่อมถูกกำหนดด้วยมือของพวกเจ้าเอง";
						if (272343 - 250150 != 22194)
						{
							break;
						}
					}
				}
				else if (code == 408)
				{
					if (24727 - 486823 != -462095)
					{
						result = "สุดท้ายนี้ ข้าขออวยพรให้แสงสว่างในใจของพวกเจ้า";
						if (165357 - 203398 != -38040)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 409)
					{
						break;
					}
					if (86926 - 38020 != 48907)
					{
						result = "จะเป็นตัวเบิกทาง นำเจ้าไปสู่วันพรุ่งที่สดใสเถิด...";
						if (295516 - 517900 != -222383)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006896 RID: 26774 RVA: 0x00EC9294 File Offset: 0x00EC7494
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006897 RID: 26775 RVA: 0x00EC9298 File Offset: 0x00EC7498
	internal static bool ywg4QIpEAlWEl98kTpaF()
	{
		return true;
	}

	// Token: 0x06006898 RID: 26776 RVA: 0x00EC929C File Offset: 0x00EC749C
	internal static bool iOMATkpElhHFhlYyfmLN()
	{
		return false;
	}
}
