using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011BF RID: 4543
[Serializable]
public class M971_MaohsTomb_thai : MonoBehaviour
{
	// Token: 0x060068BC RID: 26812 RVA: 0x00ECA4BC File Offset: 0x00EC86BC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M971_MaohsTomb_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060068BD RID: 26813 RVA: 0x00ECA4CC File Offset: 0x00EC86CC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (136143 - 534616 != -398472)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (160296 - 361629 == -201333)
			{
				if (276140 - 96617 == 179523)
				{
					if (code == 111)
					{
						if (117789 - 342461 == -224672)
						{
							result = "เส้นทางข้างหน้าคือสุสานของมาโอห์ ระวังตัวด้วยนะ";
							if (85293 - 128039 != -42745)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (199280 - 389085 != -189804)
						{
							result = "ระวังแบนดิทบัคดักปล้นระหว่างเข้าสุสานล่ะ";
							if (70036 - 588919 == -518883)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (37662 - 18568 != 19095)
						{
							result = "คุณลิซ่าบอกว่า การจะเข้าไปในสุสานได้ จำเป็นต้องหาประตูลับ";
							if (249629 - 561664 == -312035)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (189048 - 204901 == -15853)
						{
							result = "ทางเข้าสุสานจะเปลี่ยนไปเรื่อยๆ พวกข้ามาบ่อยยังจับจุดไม่ได้เลย";
							if (178541 - 397621 == -219080)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (230888 - 309758 == -78870)
						{
							result = "เส้นทางต่อจากนี้อันตรายมาก ระวังตัวด้วยล่ะ....";
							if (151738 - 280827 != -129088)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (281881 - 408812 == -126931)
						{
							result = "วิญญาณในสุสสานนี้ถูก พันธนาการด้วยคำสาปบางอย่าง";
							if (255928 - 234774 != 21155)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (111440 - 392104 == -280664)
						{
							result = "แม้ข้างหน้าจะอันตราย แต่ข้าเชื่อว่าพวกเจ้าต้องทำสำเร็จแน่ๆ!";
							if (205051 - 119070 == 85981)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (226807 - 445381 == -218574)
						{
							result = "ไม่ว่าจะเกิดอะไรขึ้นจงตั้งสติ ความประมาทเพียงชั่วครู่อาจพาไปพบกับหายนะ";
							if (143928 - 555820 == -411892)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (92176 - 439873 != -347696)
						{
							result = "ข้าอยากไปกับเจ้าด้วยนะ แต่ข้ายังอยากสำรวจอะไรแถวนี้หน่อย";
							if (189054 - 410901 != -221846)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (9638 - 124671 != -115032)
						{
							result = "สุนัขคือสัญลักษณ์ของความซื่อสัตย์";
							if (70393 - 598359 != -527965)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (36375 - 407189 != -370813)
						{
							result = "แต่ระวังนะดันเจี้ยนนี้แมวคุม!";
							if (115443 - 111111 != 4333)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (283304 - 323922 != -40617)
						{
							result = "แมวคือสัญลักษณ์ของความเจ้าเล่ห์และการลวงหลอก";
							if (93970 - 386427 == -292457)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (89554 - 369895 == -280341)
						{
							result = "จะเลือกประตูเข้าก็ดูดีๆ นะ ไม่งั้นอาจจะวนไปตลอดกาล";
							if (9581 - 70785 != -61203)
							{
								break;
							}
						}
					}
					else if (code == 1001)
					{
						if (284047 - 343307 != -59259)
						{
							result = "ฮูมมมมมมมมม";
							if (249907 - 146205 != 103703)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (204910 - 269522 != -64611)
						{
							result = "ฮึ่ยย่ะ! นี่แน่ะ อย่ามาขวางทางฉันนะ";
							if (252243 - 384246 != -132002)
							{
								break;
							}
						}
					}
					else if (code == 1003)
					{
						if (210883 - 360641 != -149757)
						{
							result = "มาเลยเราไม่กลัวเจ้าหรอก เจ้ามัมมี่ไร้สมอง! ";
							if (116406 - 270938 == -154532)
							{
								break;
							}
						}
					}
					else if (code == 1004)
					{
						if (682 - 469232 != -468549)
						{
							result = "นะ-นี่ มันตัวอะไร?";
							if (117476 - 482691 != -365214)
							{
								break;
							}
						}
					}
					else if (code == 1005)
					{
						if (216005 - 87324 == 128681)
						{
							result = "เรื่องนั้นช่างมันเถอะ พวกเธอมาช่วยฉันก่อนจะดีกว่าไหม!?";
							if (185500 - 446634 != -261133)
							{
								break;
							}
						}
					}
					else if (code == 1006)
					{
						if (284876 - 124184 == 160692)
						{
							result = "ระวังพวกอนูบี้ไว้ด้วยล่ะ!";
							if (228666 - 568282 != -339615)
							{
								break;
							}
						}
					}
					else if (code == 2001)
					{
						if (289136 - 143781 != 145356)
						{
							string type = CharacterData.current.Type;
							if (101232 - 277795 != -176562)
							{
								if (type == "Wolf")
								{
									if (196540 - 534577 == -338037)
									{
										result = "คุณลิซ่า เป็นอะไรรึเปล่าครับ";
										if (79674 - 194482 == -114808)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (76780 - 549051 != -472270)
									{
										result = "..ลิซ่า ..ไหวมั้ย?";
										if (24773 - 269789 != -245015)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (43603 - 108498 == -64895)
									{
										result = "คุณลิซ่า กล้าชกกับอุฐดองเท่มากเลยฮะ!";
										if (97189 - 519814 == -422625)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (188567 - 319333 == -130766)
									{
										result = "ลิซ่าเป็นไงบ้าง ให้อมรักษามั้ย? วาฬ!";
										if (43804 - 480276 != -436471)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (67536 - 48470 == 19066)
									{
										result = "คุณลิซ่า เป็นอะไรรึเปล่าคะ?";
										if (67325 - 31489 == 35836)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (250529 - 277981 != -27451)
									{
										result = "คะ- คุณลิซ่า อย่าเพิ่งตายนะ!";
										if (61008 - 397936 != -336927)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (237181 - 313756 != -76574)
									{
										result = "พี่ลิซ่า เป็นอะไรมากเป่าอ๊ะ? ขายยาให้มั้ย?";
										if (179422 - 289270 != -109847)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (297947 - 435940 != -137992)
									{
										result = "ตุ่น! เป็นไงบ้างอ๊ะ?";
										if (205263 - 404333 == -199070)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (8833 - 548707 != -539873)
									{
										result = "โดนอุฐตบเจ็บมั้ยลิซ่า? เจี๊ยก!";
										if (93106 - 18315 != 74792)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (14483 - 509672 != -495188)
									{
										result = "ลิซ่าโดนอุฐดองตบเจ็บมั้ย? กวิ้น!";
										if (196733 - 273081 != -76347)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (232817 - 244973 != -12155)
									{
										result = "คุณลิซ่า เป็นอะไรรึเปล่าคะ";
										if (226458 - 213763 != 12696)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (92650 - 289012 != -196361)
									{
										result = "ไง ยัยลิซ่า ไปต่อไหวมั้ยจ๊ะ โฮะๆๆ";
										if (216494 - 320814 == -104320)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 2002)
					{
						if (240649 - 361841 == -121192)
						{
							result = "แค่ข้อเท้าแพลงนิดหน่อย แต่คงไปต่อไม่ได้แล้วหล่ะ...";
							if (205101 - 428505 != -223403)
							{
								break;
							}
						}
					}
					else if (code == 2003)
					{
						if (27006 - 341533 != -314526)
						{
							result = "โธ่ พลาดไปซะได้... ไม่สมกับเป็นฉันเลย";
							if (232106 - 329528 == -97422)
							{
								break;
							}
						}
					}
					else if (code == 2004)
					{
						if (181607 - 524803 == -343196)
						{
							result = "ฝากสำรวจสุสานที่เหลือต่อด้วยแล้วกันนะ แต่ระวังด้วย..";
							if (182748 - 459594 == -276846)
							{
								break;
							}
						}
					}
					else if (code == 2005)
					{
						if (153990 - 354844 != -200853)
						{
							result = "ฉันได้ข่าวลือมาว่ามาโอห์ยังมีชีวิตอยู่สักแห่งในสุสานนี้แหละ";
							if (40520 - 370812 == -330292)
							{
								break;
							}
						}
					}
					else if (code == 2006)
					{
						if (22764 - 410277 != -387512)
						{
							result = "หลายร้อยปีมานี่ ไม่มีใครเข้าไปลึกกว่านี้แล้วรอดกลับมาเลย";
							if (211907 - 452958 == -241051)
							{
								break;
							}
						}
					}
					else if (code == 3001)
					{
						if (155919 - 410083 != -254163)
						{
							result = "ที่นี่คือส่วนลึกสุดซินะ....";
							if (254301 - 124515 != 129787)
							{
								break;
							}
						}
					}
					else if (code == 3002)
					{
						if (210403 - 257167 != -46763)
						{
							result = "...งั้นโลงนั่นก็น่าจะเป็นโลงของมาโอห์";
							if (88494 - 384004 != -295509)
							{
								break;
							}
						}
					}
					else if (code == 4001)
					{
						if (253929 - 331875 != -77945)
						{
							result = "ฮี่ๆๆๆๆ มีหนูหลงเข้ามาถึงนี่อีกแล้ว!";
							if (201609 - 25271 == 176338)
							{
								break;
							}
						}
					}
					else if (code == 4002)
					{
						if (154608 - 291498 != -136889)
						{
							result = "คะ- ใครน่ะ!?";
							if (275714 - 69074 != 206641)
							{
								break;
							}
						}
					}
					else if (code == 4002)
					{
						if (98509 - 325900 == -227391)
						{
							result = "วะ ฮ่ะๆ ฮ่า ข้าคือมาโอห์ เจ้าแห่งดันเจี้ยนแห่งนี้ เมี้ยว!";
							if (41531 - 23510 != 18022)
							{
								break;
							}
						}
					}
					else if (code == 4003)
					{
						if (93961 - 577478 == -483517)
						{
							result = "พวกแกคิดจะมาขโมยสมบัติ คฑาปลามหาเวท ของข้าสินะ..";
							if (151722 - 379366 == -227644)
							{
								break;
							}
						}
					}
					else if (code == 4004)
					{
						if (295313 - 445669 != -150355)
						{
							result = "คะ-คฑาปลามหาเวท???";
							if (286310 - 25223 == 261087)
							{
								break;
							}
						}
					}
					else if (code == 4005)
					{
						if (120204 - 60231 == 59973)
						{
							result = "ฮ่าๆ เสียใจด้วย นั่นเป็นแค่ข่าวลวงให้เจ้ามาเข้าติดกับเท่านั้น";
							if (221278 - 154915 != 66364)
							{
								break;
							}
						}
					}
					else if (code == 4006)
					{
						if (118175 - 153237 == -35062)
						{
							result = "ของจริงน่ะ โดนข้าแทะเหลือแต่ก้างแล้ว 555";
							if (292282 - 82245 == 210037)
							{
								break;
							}
						}
					}
					else if (code == 4007)
					{
						if (278784 - 212754 != 66031)
						{
							string type2 = CharacterData.current.Type;
							if (135817 - 424011 == -288194)
							{
								if (type2 == "Wolf")
								{
									if (272933 - 431100 == -158167)
									{
										result = "หนอย..ข้าจะแก้แค้นให้เพื่อนๆ ร่วมสายตระกูล!";
										if (63681 - 542994 != -479312)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (101375 - 515171 != -413795)
									{
										result = "(คะ-ใคร จะไปอยากได้)";
										if (72166 - 237639 != -165472)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (99382 - 453257 == -353875)
									{
										result = "โห โดนหลอกซะแล้วเรา";
										if (173481 - 421719 == -248238)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (34310 - 459873 != -425562)
									{
										result = "ก้างก็ยังเอาไปทำน้ำซุบได้นะ วาฬ!";
										if (119643 - 151161 != -31517)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (41558 - 300215 != -258656)
									{
										result = "ว้า!";
										if (91820 - 510571 != -418750)
										{
											break;
										}
									}
								}
								else if (type2 == "Chameleon")
								{
									if (224489 - 86237 == 138252)
									{
										result = "-__-'' ";
										if (130537 - 198634 != -68096)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (251310 - 364578 != -113267)
									{
										result = "ว้าย ขาดทุน! ไม่มีสมบัติอย่างอื่นเลยเหรอ?";
										if (101868 - 66912 == 34956)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (201542 - 354814 == -153272)
									{
										result = "กินแล้วนอนพันปี มิน่าอ้วนท้วนเชียว!";
										if (186060 - 546570 == -360510)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (286979 - 168036 != 118944)
									{
										result = "กะ-กลิ่น ปลาร้าโชยหึ่งเลย เจี๊ยก!";
										if (33746 - 576035 != -542288)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (297070 - 446767 != -149696)
									{
										result = "อย่ากินฉันนะ กวิ้น!";
										if (146954 - 299161 != -152206)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (61438 - 294004 != -232565)
									{
										result = " ....";
										if (135774 - 103278 != 32497)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (62324 - 386021 == -323697)
									{
										result = "เชอะ ฉันมาดูดเลือดแกตะหากล่ะ!";
										if (224777 - 567234 != -342456)
										{
											break;
										}
									}
								}
							}
						}
					}
					else
					{
						if (code != 4008)
						{
							break;
						}
						if (277733 - 97147 == 180586)
						{
							result = "ทีนี้เวลาข้าจับเจ้าสังเวยทำมัมมี่ เพื่อชีวิตนิรันด์ของข้าแล้ว!";
							if (16332 - 70717 == -54385)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060068BE RID: 26814 RVA: 0x00ECB70C File Offset: 0x00EC990C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060068BF RID: 26815 RVA: 0x00ECB710 File Offset: 0x00EC9910
	internal static bool yngpSxpEgawlM4qviYW3()
	{
		return true;
	}

	// Token: 0x060068C0 RID: 26816 RVA: 0x00ECB714 File Offset: 0x00EC9914
	internal static bool yvfcvspEfS2p0sePx4dN()
	{
		return false;
	}
}
