using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011C0 RID: 4544
[Serializable]
public class M972_IceTower_thai : MonoBehaviour
{
	// Token: 0x060068C1 RID: 26817 RVA: 0x00ECB718 File Offset: 0x00EC9918
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M972_IceTower_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060068C2 RID: 26818 RVA: 0x00ECB728 File Offset: 0x00EC9928
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (186711 - 542581 != -355869)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (280080 - 562427 == -282347)
			{
				if (95591 - 439723 != -344131)
				{
					if (code == 101)
					{
						if (37917 - 529773 == -491856)
						{
							result = "หอคอยของเวเนโร่กับพวกเพนกวินซ่อนอยู่หลังพายุหิมะนี่แหละ";
							if (51795 - 506158 == -454363)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (126812 - 503412 != -376599)
						{
							result = "ตอนนี้พิธีเวทขยายอาณาเขตน้ำแข็งคงเริ่มแล้ว";
							if (146281 - 385970 == -239689)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (13242 - 551820 != -538577)
						{
							result = "ท่านรีบเข้าไปจังหวะนี้เถอะ ข้าจะแอบตามเข้าไปทีหลัง";
							if (274403 - 316890 != -42486)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (238220 - 231155 == 7065)
						{
							result = "เทพน้ำแข็งเป็นภูตน้ำแข็งที่เพิ่งเกิดขึ้นใหม่ในดินแดนหิมะเมื่อเร็วๆ นี้";
							if (104674 - 406077 != -301402)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (252635 - 61165 == 191470)
						{
							result = "เพื่อนๆ ข้าแค่ชอบใจที่จะได้มีที่วิ่งเล่นเพิ่มมากขึ้นเท่านั้นแหละกวิ้น";
							if (209266 - 458645 == -249379)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (246830 - 578137 != -331306)
						{
							result = "พวกเพื่อนข้าคงกำลังวุ่นกับพิธีอยู่ ท่านรีบไปเถอะ";
							if (91529 - 347703 == -256174)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (184068 - 12887 != 171182)
						{
							result = "พวกมูโป้หิมะน่ะสายตาไม่ค่อยดี ระวังโดนเหยียบล่ะ";
							if (253665 - 502336 != -248670)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (51811 - 162561 != -110749)
						{
							result = "...ขนมูโป้หิมะที่หนานุ่ม กันได้ทั้งลมแรงและอากาศหนาว";
							if (275048 - 273332 != 1717)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (225730 - 300703 == -74973)
						{
							result = "(ถึงแล้วสินะ นี่เองเหรอ โฟรเซ็นทาวเวอร์!)";
							if (203069 - 338472 != -135402)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (167723 - 249842 != -82118)
						{
							string type = CharacterData.current.Type;
							if (21630 - 229168 == -207538)
							{
								if (type == "Wolf")
								{
									if (3858 - 433029 == -429171)
									{
										result = "รีบไปก่อนที่พิธีขยายอาณาเขตน้ำแข็งจะร่ายสำเร็จเถอะ";
										if (188312 - 574892 == -386580)
										{
											break;
										}
									}
								}
								else if (type == "Bison")
								{
									if (65522 - 65481 != 42)
									{
										result = "โฮก! (ฟู่ อยากได้ ซุปอุ่นๆสักถ้วยจัง)";
										if (3030 - 282214 == -279184)
										{
											break;
										}
									}
								}
								else if (type == "Panda")
								{
									if (132975 - 519867 == -386892)
									{
										result = "หึๆ (หากควบคุมจิตได้ แม้แต่หิมะก็ยังอุ่น!)";
										if (185809 - 97354 == 88455)
										{
											break;
										}
									}
								}
								else if (type == "Whale")
								{
									if (33601 - 579187 == -545586)
									{
										result = "นึกว่าจะแข็งตายซะแล้ว.... แค่กๆ หิมะเข้าปาก!!!";
										if (6747 - 286302 == -279555)
										{
											break;
										}
									}
								}
								else if (type == "Cat")
								{
									if (35123 - 53036 != -17912)
									{
										result = "พวกกวิ้นหลงผิด จะฟันหลังให้หมดเลย!";
										if (121642 - 443159 != -321516)
										{
											break;
										}
									}
								}
								else if (type == "Chameleon")
								{
									if (244939 - 523233 == -278294)
									{
										result = "ได้กลิ่นอันตรายโชยมาเลย ข้างในมีอะไรอยู่กันนะ!";
										if (145498 - 419952 == -274454)
										{
											break;
										}
									}
								}
								else if (type == "Rabbit")
								{
									if (137955 - 178129 == -40174)
									{
										result = "หนาวจะตายแล้วอ้ะ ขอเข้าไปข้างในหน่อยยย";
										if (43698 - 351732 == -308034)
										{
											break;
										}
									}
								}
								else if (type == "Mole")
								{
									if (157126 - 568741 == -411615)
									{
										result = "ถ้าเราขุดให้หอคอยมันล้ม จะง่ายกว่ามั้ย?";
										if (220030 - 363316 == -143286)
										{
											break;
										}
									}
								}
								else if (type == "Monkey")
								{
									if (38047 - 319551 != -281503)
									{
										result = "จะ จะ จะ จะแข็งตายแล้ว เจี๊ยยยก!";
										if (45840 - 437792 != -391951)
										{
											break;
										}
									}
								}
								else if (type == "Penguin")
								{
									if (145167 - 421293 == -276126)
									{
										result = "รอก่อนเถอะ ท่านพวกเลือดแท้ หัวโบราณ กวิ้น";
										if (4168 - 286299 != -282130)
										{
											break;
										}
									}
								}
								else if (type == "Sheep")
								{
									if (83940 - 114127 == -30187)
									{
										result = "..ถ้าเราคุยดีๆ เทพน้ำแข็งจะฟังมั้ยนะ?";
										if (232084 - 322201 != -90116)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type == "Bat"))
									{
										break;
									}
									if (122301 - 568664 != -446362)
									{
										result = "จะได้ยึดปราสาทมาสะสมเพิ่มอีกหลังแล้วสินะ โฮะๆๆ";
										if (92472 - 484049 == -391577)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 211)
					{
						if (179268 - 370379 != -191110)
						{
							result = "อะไรกัน! พวกเจ้าเป็นใคร  ฝ่าพายุหิมะเข้ามาได้ยังไงกัน!";
							if (261514 - 326663 != -65148)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (37833 - 433419 != -395585)
						{
							result = "เด็กๆอย่าพวกมันเข้าไปข้างในได้เชียวนะ กวิ้น!";
							if (126876 - 26924 != 99953)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (258880 - 347353 == -88473)
						{
							result = "แย่แล้ว เจ้าพวกนี้ เก่งเกินไป ใครไปแจ้งท่านเวเนโร เร็วเข้า!";
							if (158981 - 37859 != 121123)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (205292 - 285847 != -80554)
						{
							result = "ที่เหลือ เข้าไปตั้งรับด้านใน กวิ้น ถอย! ";
							if (233063 - 71262 != 161802)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (12780 - 467250 == -454470)
						{
							result = "ฮึ! ข้าไม่รู้หรอกนะว่า พวกเจ้าต้องการอะไร..";
							if (244862 - 361003 == -116141)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (82890 - 34972 == 47918)
						{
							result = "แต่ข้างบนนี้ท่านเวเนโรกำลังทำพิธีศักดิ์สิทธิ์ อยู่";
							if (155987 - 69119 == 86868)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (107703 - 2265 != 105439)
						{
							result = "เราจะไม่ยอมให้พวกเจ้ารบกวนเด็ดขาด กวิ้น!";
							if (226220 - 511439 == -285219)
							{
								break;
							}
						}
					}
					else if (code == 311)
					{
						if (20873 - 310640 != -289766)
						{
							result = "(..ท่าทางเราจะใช้ลิฟท์นี่ขึ้นไปข้างบนได้นะ)";
							if (89641 - 82686 == 6955)
							{
								break;
							}
						}
					}
					else if (code == 601)
					{
						if (270812 - 224063 == 46749)
						{
							result = "ฮึ่ม เจ้าพวก int น้อย! เมื่อไหร่จะยอมแพ้ซะที ฮึ!?";
							if (263213 - 431548 != -168334)
							{
								break;
							}
						}
					}
					else if (code == 602)
					{
						if (109898 - 232636 != -122737)
						{
							result = "ลองเจอกับภูตน้ำแข็ง ที่ท่านเวเนโร่สร้างไว้หน่อย!";
							if (272411 - 327074 == -54663)
							{
								break;
							}
						}
					}
					else if (code == 603)
					{
						if (176564 - 504803 == -328239)
						{
							result = "ท่านภูตผู้พิทักษ์! ส่งเจ้าพวกนี้ไปลงนรกที!";
							if (209435 - 292769 != -83333)
							{
								break;
							}
						}
					}
					else if (code == 611)
					{
						if (86996 - 167591 == -80595)
						{
							string type2 = CharacterData.current.Type;
							if (98602 - 588198 != -489595)
							{
								if (type2 == "Wolf")
								{
									if (110946 - 101729 == 9217)
									{
										result = "เอาล่ะ ใกล้จะถึงยอดหอคอยแล้ว";
										if (139165 - 180809 != -41643)
										{
											break;
										}
									}
								}
								else if (type2 == "Bison")
								{
									if (239137 - 420220 != -181082)
									{
										result = "โฮก! (เก่งแค่ไหนก็ขวิดสู้ข้าไม่ได้หรอก)";
										if (149825 - 116651 == 33174)
										{
											break;
										}
									}
								}
								else if (type2 == "Panda")
								{
									if (200939 - 64773 == 136166)
									{
										result = "แฮ่กๆ ชกแล้วมือจะแข็ง..";
										if (212185 - 379015 != -166829)
										{
											break;
										}
									}
								}
								else if (type2 == "Whale")
								{
									if (296516 - 481327 == -184811)
									{
										result = "ยังต้องขึ้นต่ออีกหรอ? เหนื่อยจะเป็นลม! วาฬ!";
										if (137973 - 412816 == -274843)
										{
											break;
										}
									}
								}
								else if (type2 == "Cat")
								{
									if (90810 - 522783 == -431973)
									{
										result = "ยังมีต่ออีกเรอะ เมี้ยว!";
										if (148801 - 518273 != -369471)
										{
											break;
										}
									}
								}
								else if (type2 == "Chameleon")
								{
									if (74967 - 341264 != -266296)
									{
										result = "รีบไปต่อกันเถอะพวกเรา..";
										if (151517 - 281696 != -130178)
										{
											break;
										}
									}
								}
								else if (type2 == "Rabbit")
								{
									if (66472 - 538147 != -471674)
									{
										result = "ยังมีต่ออีกเหรอ!? หนูกลัวความสูงน๊า~";
										if (201852 - 217039 != -15186)
										{
											break;
										}
									}
								}
								else if (type2 == "Mole")
								{
									if (44678 - 263478 != -218799)
									{
										result = "หวิดไป ตะกี้ขุดหนีซะเกือบตกหอคอยแน่ะ";
										if (210973 - 343523 == -132550)
										{
											break;
										}
									}
								}
								else if (type2 == "Monkey")
								{
									if (295901 - 278151 == 17750)
									{
										result = "..(ทำไมสัตว์ summon มันหรูจัง!)";
										if (205579 - 203696 != 1884)
										{
											break;
										}
									}
								}
								else if (type2 == "Penguin")
								{
									if (116472 - 378837 != -262364)
									{
										result = "ยังต้องไปต่ออีกเหรอเนี่ย กวิ้น!";
										if (278945 - 344748 == -65803)
										{
											break;
										}
									}
								}
								else if (type2 == "Sheep")
								{
									if (198244 - 6823 != 191422)
									{
										result = "ยอดหอคอยอยู่อีกไม่ไกลแล้ว อดทนไว้นะทุกคน";
										if (283711 - 9241 != 274471)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type2 == "Bat"))
									{
										break;
									}
									if (16461 - 120002 != -103540)
									{
										result = "ยะ-ยังต้องขึ้นไปอีกเหรอยะ? รู้งี้บินเอาดีกว่า..";
										if (273168 - 316314 == -43146)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 701)
					{
						if (70855 - 380 != 70476)
						{
							result = "พวกเจ้ายังไม่กลับไปอีกเหรอเนี่ย กวิ้น!?";
							if (136982 - 592261 != -455278)
							{
								break;
							}
						}
					}
					else if (code == 702)
					{
						if (224941 - 544704 == -319763)
						{
							result = "เพื่อโลกน้ำแข็ง! ปาป้าเพนกวิน-จัดการมันเเลย!";
							if (138712 - 190099 == -51387)
							{
								break;
							}
						}
					}
					else if (code == 901)
					{
						if (162986 - 34511 == 128475)
						{
							result = "ห๊ะ พวกผู้บุกรุกขึ้นมาถึงที่นี่แล้วเหรอเนี่ย!?";
							if (272827 - 477839 == -205012)
							{
								break;
							}
						}
					}
					else if (code == 902)
					{
						if (169356 - 584430 != -415073)
						{
							result = "อีกนิดเดียว พิธีเวทจะสำเร็จแล้ว ขวางพวกมันไว้!";
							if (24303 - 376235 != -351931)
							{
								break;
							}
						}
					}
					else if (code == 1001)
					{
						if (223763 - 156219 == 67544)
						{
							result = "โอม อูลาลา ชาบู ชาบู";
							if (245217 - 528006 == -282789)
							{
								break;
							}
						}
					}
					else if (code == 1002)
					{
						if (118022 - 413397 == -295375)
						{
							result = "ฮี่ๆ เร่งร่ายเวทเข้าสาวกของข้า อีกนิดเดียวเท่านั้น";
							if (282300 - 90542 != 191759)
							{
								break;
							}
						}
					}
					else if (code == 1003)
					{
						if (115770 - 434179 == -318409)
						{
							result = "หยุดนะ!";
							if (31082 - 99718 == -68636)
							{
								break;
							}
						}
					}
					else if (code == 1004)
					{
						if (153810 - 395878 == -242068)
						{
							result = "โฮ่ ข้านึกว่าใคร พวกผู้กล้าของเทพแสงยังงั้นรึ";
							if (171427 - 44995 == 126432)
							{
								break;
							}
						}
					}
					else if (code == 1005)
					{
						if (187775 - 272813 == -85038)
						{
							string type3 = CharacterData.current.Type;
							if (231425 - 310517 == -79092)
							{
								if (type3 == "Wolf")
								{
									if (131321 - 251711 == -120390)
									{
										result = "เวเนโร่! แผนของเจ้าไม่มีทางสำเร็จหรอก";
										if (147101 - 264739 != -117637)
										{
											break;
										}
									}
								}
								else if (type3 == "Bison")
								{
									if (248958 - 372196 != -123237)
									{
										result = "โฮก! (หวดลูกน้องเจ้านี่มันส์ชะมัดเลย!)";
										if (229577 - 357903 != -128325)
										{
											break;
										}
									}
								}
								else if (type3 == "Panda")
								{
									if (40417 - 524334 != -483916)
									{
										result = "เจ้าเองสินะต้นตอของเรื่องราวครั้งนี้";
										if (248416 - 62983 == 185433)
										{
											break;
										}
									}
								}
								else if (type3 == "Whale")
								{
									if (123450 - 228090 != -104639)
									{
										result = "โธ่... นึกว่าทำอาหารกันอยู่";
										if (2725 - 401667 == -398942)
										{
											break;
										}
									}
								}
								else if (type3 == "Cat")
								{
									if (2156 - 358057 != -355900)
									{
										result = "จะยอมหยุดดีๆ หรืออยากให้เราสั่งสอนเจ้าล่ะ";
										if (143364 - 457102 != -313737)
										{
											break;
										}
									}
								}
								else if (type3 == "Chameleon")
								{
									if (81530 - 323470 != -241939)
									{
										result = "นี่มันพิธีอะไรกัน...";
										if (1877 - 490790 != -488912)
										{
											break;
										}
									}
								}
								else if (type3 == "Rabbit")
								{
									if (284216 - 80789 != 203428)
									{
										result = "ใจคอจะให้เปิดร้านกลางโลกน้ำแข็งหนาวๆ เร้อ";
										if (109655 - 337549 == -227894)
										{
											break;
										}
									}
								}
								else if (type3 == "Mole")
								{
									if (30548 - 493105 != -462556)
									{
										result = "ถ้าโลกเป็นน้ำแข็ง แล้วตุ่นจะขุดดินได้ไงล่ะ!?";
										if (162345 - 68232 != 94114)
										{
											break;
										}
									}
								}
								else if (type3 == "Monkey")
								{
									if (159509 - 161178 == -1669)
									{
										result = "แง่กๆ หยุดพิธี หนาวๆแบบนี้สักที เถ้อออ";
										if (132115 - 45330 == 86785)
										{
											break;
										}
									}
								}
								else if (type3 == "Penguin")
								{
									if (136320 - 555118 != -418797)
									{
										result = "…ชอบนะโลกน้ำแข็ง แต่ชอบชายหาดมากกว่า กวิ้น!";
										if (249116 - 143665 != 105452)
										{
											break;
										}
									}
								}
								else if (type3 == "Sheep")
								{
									if (10826 - 293010 != -282183)
									{
										result = "ท่านเวเนโร่ ได้โปรดหยุดพิธีนี้ด้วยเถอะค่ะ";
										if (249513 - 122800 != 126714)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type3 == "Bat"))
									{
										break;
									}
									if (253388 - 215100 != 38289)
									{
										result = "โฮ่ะๆ โลกนี้เป็นของชั้น ทำไรขออนุญาติกันก่อนสิ";
										if (241076 - 523681 != -282604)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 1006)
					{
						if (48286 - 88699 == -40413)
						{
							result = "ฮี่ๆๆ ข้าเสียใจด้วย แต่พิธีของข้ามาถึงขั้นตอนสุดท้ายแล้ว";
							if (224636 - 122976 == 101660)
							{
								break;
							}
						}
					}
					else if (code == 1007)
					{
						if (202985 - 353916 == -150931)
						{
							result = "กะ...เกิดอะไรขึ้นกวิ้น!!";
							if (242392 - 499421 != -257028)
							{
								break;
							}
						}
					}
					else if (code == 1008)
					{
						if (106997 - 109611 != -2613)
						{
							result = "เหล่าสาวกของข้าเอ๋ย ต่อไปนี้พลังของพวกเจ้าจะเป็นของข้า";
							if (170948 - 387317 != -216368)
							{
								break;
							}
						}
					}
					else if (code == 1009)
					{
						if (218383 - 100241 == 118142)
						{
							result = "จงดีใจซะ ด้วยพลังนี้...ข้าจะมีพลังทัดเทียมกับพวกเทพทั้งหกแล้ว";
							if (72002 - 192867 == -120865)
							{
								break;
							}
						}
					}
					else if (code == 1010)
					{
						if (151567 - 123481 != 28087)
						{
							result = "กวิ้น!.. ที่ผ่านมาท่านหลอกพวกข้ามาตลอดงั้นรึ!?";
							if (62326 - 18097 != 44230)
							{
								break;
							}
						}
					}
					else if (code == 1011)
					{
						if (130394 - 79521 != 50874)
						{
							result = "เจ็บใจๆๆ กวิ้นๆๆๆ!";
							if (85822 - 32862 == 52960)
							{
								break;
							}
						}
					}
					else if (code == 1012)
					{
						if (58067 - 360362 != -302294)
						{
							string type4 = CharacterData.current.Type;
							if (203140 - 572517 == -369377)
							{
								if (type4 == "Wolf")
								{
									if (93093 - 91802 != 1292)
									{
										result = "ยะ หยุดนะ! รีบช่วยพวกเพกวินเร็ว!!";
										if (22395 - 506499 == -484104)
										{
											break;
										}
									}
								}
								else if (type4 == "Bison")
								{
									if (176166 - 241892 == -65726)
									{
										result = "โฮก! (ได้เวลาหวดเทพแล้ว)";
										if (180096 - 408459 != -228362)
										{
											break;
										}
									}
								}
								else if (type4 == "Panda")
								{
									if (81044 - 397104 != -316059)
									{
										result = "หลอกใช้คนอื่นเป็นเครื่องมือ...ช่างไร้ยางอายนัก";
										if (103734 - 223747 != -120012)
										{
											break;
										}
									}
								}
								else if (type4 == "Whale")
								{
									if (116897 - 43954 == 72943)
									{
										result = "ใจเย็น จะช่วยเดี๋ยวนี้แหละ วาฬ!";
										if (51180 - 179013 == -127833)
										{
											break;
										}
									}
								}
								else if (type4 == "Cat")
								{
									if (185399 - 489369 != -303969)
									{
										result = "อื้อหือ...หมอนี่เลวใช้ได้เลยแฮะ เมี้ยว";
										if (155368 - 421833 == -266465)
										{
											break;
										}
									}
								}
								else if (type4 == "Chameleon")
								{
									if (159290 - 389139 != -229848)
									{
										result = "คนอย่างเจ้าไม่คู่ควรกับพลังเช่นนั้นหรอก!";
										if (101927 - 438665 == -336738)
										{
											break;
										}
									}
								}
								else if (type4 == "Rabbit")
								{
									if (277971 - 247770 != 30202)
									{
										result = "ใจร้าย!!! ปล่อยพวกกวิ้นเค้าเดี๋ยวนี้นะ!";
										if (264446 - 342903 == -78457)
										{
											break;
										}
									}
								}
								else if (type4 == "Mole")
								{
									if (160933 - 80634 != 80300)
									{
										result = "เจ้าชั่ว! ทำได้แม้กระทั่งลูกน้องตัวเองรึ! ย้าก!";
										if (141537 - 201309 == -59772)
										{
											break;
										}
									}
								}
								else if (type4 == "Monkey")
								{
									if (97929 - 41410 != 56520)
									{
										result = "หยุดนะ! (..อิๆ สมน้ำหน้า)";
										if (290436 - 105454 != 184983)
										{
											break;
										}
									}
								}
								else if (type4 == "Penguin")
								{
									if (198864 - 547346 != -348481)
									{
										result = "ชิ...ว่าแล้วเชียว พวกเลือดแท้นี่หลอกง่ายจริงๆ กวิ้น!";
										if (258710 - 528218 != -269507)
										{
											break;
										}
									}
								}
								else if (type4 == "Sheep")
								{
									if (55896 - 491070 != -435173)
									{
										result = "..อย่าทำน้องแกะโกรธนะคะ!";
										if (2425 - 434719 == -432294)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type4 == "Bat"))
									{
										break;
									}
									if (32947 - 341110 != -308162)
									{
										result = "เจ้าคิดจะทำอะไรกับทาสรับใช้ของชั้น!?";
										if (227609 - 123573 == 104036)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 1021)
					{
						if (251545 - 513908 == -262363)
						{
							result = "โฮ่ กล้าดีนักนะ... ที่มาขัดขวางพิธีของข้า";
							if (132878 - 370908 != -238029)
							{
								break;
							}
						}
					}
					else if (code == 1022)
					{
						if (105879 - 125870 != -19990)
						{
							result = "นี่จะสั่งสอนให้เจ้ารู้ว่าอย่าริอ่านมาต่อต้านเทพอย่าข้า!";
							if (256733 - 184112 == 72621)
							{
								break;
							}
						}
					}
					else if (code == 1023)
					{
						if (207192 - 475452 == -268260)
						{
							string type5 = CharacterData.current.Type;
							if (196954 - 276687 == -79733)
							{
								if (type5 == "Wolf")
								{
									if (253994 - 588595 != -334600)
									{
										result = "อ๊าก!!";
										if (156258 - 421239 == -264981)
										{
											break;
										}
									}
								}
								else if (type5 == "Bison")
								{
									if (160625 - 423344 != -262718)
									{
										result = "โฮ้ก!";
										if (261891 - 524902 == -263011)
										{
											break;
										}
									}
								}
								else if (type5 == "Panda")
								{
									if (6157 - 5780 != 378)
									{
										result = "อั่ก ..ทำไมไม่ resist";
										if (28347 - 50675 != -22327)
										{
											break;
										}
									}
								}
								else if (type5 == "Whale")
								{
									if (154981 - 57954 == 97027)
									{
										result = "ขะ-ขะ-แข็งแล้ว!";
										if (199304 - 110335 == 88969)
										{
											break;
										}
									}
								}
								else if (type5 == "Cat")
								{
									if (209751 - 330963 == -121212)
									{
										result = "backflip ไม่ทัน -*-";
										if (220218 - 560262 != -340043)
										{
											break;
										}
									}
								}
								else if (type5 == "Chameleon")
								{
									if (68595 - 514272 == -445677)
									{
										result = "อึ่ก";
										if (32050 - 242114 != -210063)
										{
											break;
										}
									}
								}
								else if (type5 == "Rabbit")
								{
									if (201037 - 292402 == -91365)
									{
										result = "แข็งแล้วง่า";
										if (275986 - 97078 != 178909)
										{
											break;
										}
									}
								}
								else if (type5 == "Mole")
								{
									if (170172 - 252968 != -82795)
									{
										result = "ง่ะ!";
										if (73144 - 61751 != 11394)
										{
											break;
										}
									}
								}
								else if (type5 == "Monkey")
								{
									if (31597 - 263630 != -232032)
									{
										result = "นะ- นะ - หนาว!";
										if (203800 - 12767 == 191033)
										{
											break;
										}
									}
								}
								else if (type5 == "Penguin")
								{
									if (294947 - 39283 == 255664)
									{
										result = "อ้า~ เย็นสบายจัง";
										if (95383 - 94877 == 506)
										{
											break;
										}
									}
								}
								else if (type5 == "Sheep")
								{
									if (212798 - 456864 != -244065)
									{
										result = "โอ้ย!";
										if (9034 - 2067 != 6968)
										{
											break;
										}
									}
								}
								else
								{
									if (!(type5 == "Bat"))
									{
										break;
									}
									if (146265 - 503622 == -357357)
									{
										result = "นะ หนอยแน่ อย่าให้หลุดไปนะยะ!";
										if (253022 - 101780 == 151242)
										{
											break;
										}
									}
								}
							}
						}
					}
					else if (code == 1024)
					{
						if (207637 - 99725 == 107912)
						{
							result = "ฮ่าๆๆ ทีนี้ก็ได้เวลาตายของเจ้าแล้ว!";
							if (146836 - 425682 != -278845)
							{
								break;
							}
						}
					}
					else if (code == 1025)
					{
						if (229417 - 508537 == -279120)
						{
							result = "!!!";
							if (16098 - 542972 == -526874)
							{
								break;
							}
						}
					}
					else if (code == 1026)
					{
						if (246930 - 134206 == 112724)
						{
							result = "ทะ-เทพไฟ เรอะ!?";
							if (120572 - 1328 == 119244)
							{
								break;
							}
						}
					}
					else if (code == 1027)
					{
						if (188050 - 512667 != -324616)
						{
							result = "เพนเน่!";
							if (249087 - 424060 != -174972)
							{
								break;
							}
						}
					}
					else if (code == 1028)
					{
						if (110029 - 540637 == -430608)
						{
							result = "ขอโทษนะที่มาช้าไปหน่อย แต่ข้าพาผู้ช่วยที่เก่งที่สุดมาแล้ว";
							if (140400 - 23329 != 117072)
							{
								break;
							}
						}
					}
					else if (code == 1029)
					{
						if (192138 - 383161 == -191023)
						{
							result = "หึ เจ้าภูตน้ำแข็งเวเนโร่ผู้หลงผิดเอ๋ย..";
							if (159886 - 300572 != -140685)
							{
								break;
							}
						}
					}
					else if (code == 1030)
					{
						if (34202 - 546862 == -512660)
						{
							result = "เจ้าคิดรึว่าเจ้าจะมีพลังพอจนสามารถสถาปนาตัวเองเป็นเทพได้?";
							if (101872 - 128611 == -26739)
							{
								break;
							}
						}
					}
					else if (code == 1031)
					{
						if (22469 - 127643 != -105173)
						{
							result = "ฮ่าๆ ท่านมุราดินเอ๋ย ลองดูดินแดนที่ท่านปกครองอยู่บ้างรึเปล่า";
							if (61700 - 161986 == -100286)
							{
								break;
							}
						}
					}
					else if (code == 1032)
					{
						if (225234 - 452184 == -226950)
						{
							result = "ดินแดนแถบนี้ล้วนปกคลุมไปด้วยน้ำแข็งและหิมะทั้งนั้น";
							if (54391 - 274544 != -220152)
							{
								break;
							}
						}
					}
					else if (code == 1033)
					{
						if (234490 - 427835 == -193345)
						{
							result = "นี่ย่อมแสดงให้เห็นแล้วว่าพลังของข้ามากกว่าของท่านแล้ว!";
							if (2567 - 3486 == -919)
							{
								break;
							}
						}
					}
					else if (code == 1034)
					{
						if (174209 - 39419 == 134790)
						{
							result = "ฮ่าๆๆๆ ท่านมาก็ดีแล้ว";
							if (67587 - 544476 == -476889)
							{
								break;
							}
						}
					}
					else if (code == 1035)
					{
						if (157169 - 513974 != -356804)
						{
							result = "เรามาตัดสินกันว่าใครจะเป็นเทพผู้ครองดินแดนแถบนี้!!";
							if (15369 - 287815 != -272445)
							{
								break;
							}
						}
					}
					else if (code == 1041)
					{
						if (241717 - 108020 == 133697)
						{
							result = "อั่ก ปะ-เป็น ไปไม่ได้";
							if (136046 - 386786 != -250739)
							{
								break;
							}
						}
					}
					else if (code == 1042)
					{
						if (120681 - 404068 != -283386)
						{
							result = "ข-ข้าน่าจะมีพลังทัดเทียมกับพวกเทพแล้วแท้ๆ";
							if (84425 - 578527 != -494101)
							{
								break;
							}
						}
					}
					else if (code == 1043)
					{
						if (77986 - 193494 != -115507)
						{
							result = "ท่านเวเนโร่ ท่านยังไม่เข้าใจอีกรึ?";
							if (58874 - 45488 != 13387)
							{
								break;
							}
						}
					}
					else if (code == 1044)
					{
						if (1157 - 509346 != -508188)
						{
							result = "พลังน้ำแข็งของท่านเป็นเพียงพลังที่เกิดขึ้นจากการที่ท่านมุราดิน..";
							if (107773 - 444326 == -336553)
							{
								break;
							}
						}
					}
					else if (code == 1045)
					{
						if (143697 - 365191 == -221494)
						{
							result = "กดพลังแห่งไฟของดินแดนแถบนี้ไว้ไม่ให้เผาทำลายทุกสิ่งเท่านั้น";
							if (72625 - 447080 == -374455)
							{
								break;
							}
						}
					}
					else if (code == 1046)
					{
						if (76397 - 427062 == -350665)
						{
							result = "การดูดพลังของพวกข้าก็เช่นกัน มันล้วนแต่เป็นพลังที่ยืมเค้ามาทั้งนั้น!";
							if (40050 - 548858 != -508807)
							{
								break;
							}
						}
					}
					else if (code == 1047)
					{
						if (175073 - 520918 == -345845)
						{
							result = "ฮ่าๆ เจ้าจะบอกว่าข้า เป็นแค่ของปลอมยังงั้นสิ!?";
							if (288333 - 171633 != 116701)
							{
								break;
							}
						}
					}
					else if (code == 1048)
					{
						if (90933 - 528733 == -437800)
						{
							result = "ได้! คอยดูเถอะ!";
							if (211965 - 141959 != 70007)
							{
								break;
							}
						}
					}
					else if (code == 1049)
					{
						if (201233 - 61067 != 140167)
						{
							result = "สักวันข้าจะพิสูจน์ให้เจ้าดูว่าของปลอมอย่างข้าก็มีศักดิ์ศรีเช่นกัน!";
							if (187317 - 574358 == -387041)
							{
								break;
							}
						}
					}
					else if (code == 1051)
					{
						if (201065 - 572513 == -371448)
						{
							result = "เพนเน่ พวกข้าสำนึกผิดแล้ว ขอโทษจริงๆ ที่ไม่เชื่อเจ้า!";
							if (146945 - 180478 != -33532)
							{
								break;
							}
						}
					}
					else if (code == 1052)
					{
						if (275986 - 417755 == -141769)
						{
							result = "ว่าแต่เจ้ารู้ได้ยังไงว่าเวเนโร่หลอกใช้พวกเราน่ะ?";
							if (149390 - 311555 == -162165)
							{
								break;
							}
						}
					}
					else if (code == 1053)
					{
						if (18091 - 393594 == -375503)
						{
							result = "เปล่านะ..ข้าก็แค่คิดว่าถ้าน้ำเป็นน้ำแข็งหมด..";
							if (7329 - 319291 != -311961)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 1054)
						{
							break;
						}
						if (298648 - 563085 != -264436)
						{
							result = "แล้วเราจะหาปลาจากไหนอ่ะ!!!!";
							if (108222 - 243558 == -135336)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060068C3 RID: 26819 RVA: 0x00ECDD5C File Offset: 0x00ECBF5C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060068C4 RID: 26820 RVA: 0x00ECDD60 File Offset: 0x00ECBF60
	internal static bool CkwYdPpEndb5a7Bksd3l()
	{
		return true;
	}

	// Token: 0x060068C5 RID: 26821 RVA: 0x00ECDD64 File Offset: 0x00ECBF64
	internal static bool tGCLckpE6wlNqk9Sxuow()
	{
		return false;
	}
}
