using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011C1 RID: 4545
[Serializable]
public class M973_PirateCave_thai : MonoBehaviour
{
	// Token: 0x060068C6 RID: 26822 RVA: 0x00ECDD68 File Offset: 0x00ECBF68
	[MethodImpl(MethodImplOptions.NoInlining)]
	public M973_PirateCave_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060068C7 RID: 26823 RVA: 0x00ECDD78 File Offset: 0x00ECBF78
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (15861 - 264436 != -248575)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (262902 - 399040 != -136137 && 266883 - 444090 != -177206)
			{
				if (code == 101)
				{
					if (34990 - 46594 != -11603)
					{
						result = "ที่นี่ล่ะเกาะลับของพวกโจรสลัดที่เราเจอ";
						if (95169 - 344898 != -249728)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (128946 - 336969 == -208023)
					{
						result = "พวกมันใช้ที่นี่เป็นฐานออกปล้นน่านน้ำแถบนี้มาระยะนึงแล้ว";
						if (273044 - 451545 != -178500)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (150729 - 342757 != -192027)
					{
						result = "พวกชาวบ้านที่ถูกจับมาคงจะอยู่ข้างในแน่ๆ เพราะงั้นรีบไปเถอะ";
						if (101093 - 103428 != -2334)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (218769 - 478242 != -259472)
					{
						result = "ถ้าเอาอาหารของจามอนไปวางไว้บนแท่นนั่นแล้วประตูน่าจะเปิดออก";
						if (172983 - 223720 == -50737)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (268580 - 340553 == -71973)
					{
						result = "สัจจะไม่มีในหมู่โจร เจ้าจงระวังหัวหน้าโจรสลัดที่ชื่อเรดคลอว์ไว้";
						if (143883 - 69512 != 74372)
						{
							break;
						}
					}
				}
				else if (code == 111)
				{
					if (268631 - 376181 == -107550)
					{
						result = "ถ้าข้าหนุ่มว่านี้ซัก 50 ปี ข้าคงบุกถล่มพวกมันด้วยตัวคนเดียวได้แน่ๆ!";
						if (204761 - 340763 == -136002)
						{
							break;
						}
					}
				}
				else if (code == 112)
				{
					if (156028 - 593855 != -437826)
					{
						result = "ข้างหน้าอาจมีกับดักรอเจ้าอยู่ ระวังตัวด้วยล่ะ";
						if (156111 - 95676 != 60436)
						{
							break;
						}
					}
				}
				else if (code == 113)
				{
					if (206083 - 344312 == -138229)
					{
						result = "หาดทรายแบบนี้ทำให้คิดถึงตอนฝึกเจ้าหนูโบลดาสจริงๆ";
						if (287052 - 316135 != -29082)
						{
							break;
						}
					}
				}
				else if (code == 121)
				{
					if (293526 - 345798 != -52271)
					{
						string type = CharacterData.current.Type;
						if (93701 - 288194 != -194492)
						{
							if (type == "Wolf")
							{
								if (182998 - 283576 == -100578)
								{
									result = "เอาอาหารมาวางบนแท่นนี้ซินะ";
									if (152976 - 215604 == -62628)
									{
										break;
									}
								}
							}
							else if (type == "Bison")
							{
								if (251982 - 11537 == 240445)
								{
									result = "โฮก! (แค่เอาอาหารวางไว้บนนี้ซินะ)";
									if (147109 - 360119 == -213010)
									{
										break;
									}
								}
							}
							else if (type == "Panda")
							{
								if (81370 - 294844 == -213474)
								{
									result = "เฮ้อ...ต้องกระโดดอีกแล้วซินะ";
									if (92660 - 278757 == -186097)
									{
										break;
									}
								}
							}
							else if (type == "Whale")
							{
								if (39054 - 527314 != -488259)
								{
									result = " อาหารคุณจามอนกลิ่นหอมน่ากินจังเลย วาฬ!";
									if (13607 - 430144 == -416537)
									{
										break;
									}
								}
							}
							else if (type == "Cat")
							{
								if (282805 - 71071 == 211734)
								{
									result = "แอบกินซักชิ้นจะดีไหมน้า เหมียว";
									if (109169 - 117039 == -7870)
									{
										break;
									}
								}
							}
							else if (type == "Chameleon")
							{
								if (19367 - 37326 == -17959)
								{
									result = "เอ...วางไว้ตรงนี้ซินะ";
									if (54206 - 23347 != 30860)
									{
										break;
									}
								}
							}
							else if (type == "Rabbit")
							{
								if (85455 - 250853 != -165397)
								{
									result = "หลังเปิดถ้ำแล้วต้องเก็บกลับไปด้วย ไม่งั้นเสียดายแย่";
									if (277894 - 461056 == -183162)
									{
										break;
									}
								}
							}
							else if (type == "Mole")
							{
								if (163977 - 299105 == -135128)
								{
									result = "หึหึ ด้วยมือกลรุ่นใหม่ความสูงแค่นี้ไม่ใช่ปัญหาหรอก!";
									if (147652 - 366963 != -219310)
									{
										break;
									}
								}
							}
							else if (type == "Monkey")
							{
								if (102051 - 493550 != -391498)
								{
									result = "เอามาวางไว้ตรงนี้ซินะ เจี้ยก!";
									if (29760 - 538130 == -508370)
									{
										break;
									}
								}
							}
							else if (type == "Penguin")
							{
								if (92809 - 291729 == -198920)
								{
									result = "กวิ้น กวิ้น วางไม่ถึงอะ!";
									if (220502 - 239575 != -19072)
									{
										break;
									}
								}
							}
							else if (type == "Sheep")
							{
								if (127076 - 361174 == -234098)
								{
									result = "ต้องวางไว้ตรงนี้ซินะคะ";
									if (105245 - 430627 != -325381)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type == "Bat"))
								{
									break;
								}
								if (202557 - 328656 == -126099)
								{
									result = "วิธีแบบนี้จะเปิดได้แน่เร้อ....";
									if (212394 - 493936 == -281542)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 122)
				{
					if (92334 - 22299 == 70035)
					{
						string type2 = CharacterData.current.Type;
						if (147117 - 240505 != -93387)
						{
							if (type2 == "Wolf")
							{
								if (255449 - 577161 != -321711)
								{
									result = "อืม BBQ ไว้ตรงนี้ซินะ";
									if (32242 - 69497 != -37254)
									{
										break;
									}
								}
							}
							else if (type2 == "Bison")
							{
								if (58683 - 119948 == -61265)
								{
									result = "โฮก! (เอาไอนี่วางไว้บนนี้ซินะ)";
									if (249753 - 286273 != -36519)
									{
										break;
									}
								}
							}
							else if (type2 == "Panda")
							{
								if (125840 - 160538 != -34697)
								{
									result = "เฮ้อ...รู้งี้น่าจะเอาเก้าอี้มาด้วย";
									if (75380 - 140174 != -64793)
									{
										break;
									}
								}
							}
							else if (type2 == "Whale")
							{
								if (36116 - 464542 == -428426)
								{
									result = " กลิ่นหอมจังเลย...วาฬ!";
									if (209839 - 77884 == 131955)
									{
										break;
									}
								}
							}
							else if (type2 == "Cat")
							{
								if (264686 - 495751 != -231064)
								{
									result = "อาหารคุณจามอนนี่น่ากินขจริงๆ เหมียว";
									if (150853 - 331365 != -180511)
									{
										break;
									}
								}
							}
							else if (type2 == "Chameleon")
							{
								if (84680 - 63855 != 20826)
								{
									result = "เอาล่ะเอา BBQ วางไว้ตรงนี้ซินะ";
									if (128287 - 113215 == 15072)
									{
										break;
									}
								}
							}
							else if (type2 == "Rabbit")
							{
								if (160708 - 83103 == 77605)
								{
									result = "ว้าย! พวกแมลงมันตามกลิ่นเนื้อย่างมาแล้ว";
									if (40515 - 415837 != -375321)
									{
										break;
									}
								}
							}
							else if (type2 == "Mole")
							{
								if (130127 - 511602 != -381474)
								{
									result = "เอ้า ฮึบวางไว้บนนี้ซินะ!";
									if (174991 - 404068 != -229076)
									{
										break;
									}
								}
							}
							else if (type2 == "Monkey")
							{
								if (295624 - 570292 != -274667)
								{
									result = "อ๊ะ! กินไม่ได้นะมิเกะ!";
									if (31349 - 464762 != -433412)
									{
										break;
									}
								}
							}
							else if (type2 == "Penguin")
							{
								if (19902 - 20068 == -166)
								{
									result = "หึหึ แค่เอาลังส้มที่เราเคยใช้มาวางก็เรียบร้อย!";
									if (294544 - 128009 == 166535)
									{
										break;
									}
								}
							}
							else if (type2 == "Sheep")
							{
								if (125928 - 191668 == -65740)
								{
									result = "เนื้อนี่ทำมาจากอะไรนะ?";
									if (57604 - 580734 == -523130)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type2 == "Bat"))
								{
									break;
								}
								if (266290 - 556978 == -290688)
								{
									result = "ถึงไม่น่าจะเป็นไปได้ก็เถอะ แต่คงต้องลองดูละนะ....";
									if (222997 - 443489 != -220491)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 131)
				{
					if (98156 - 434407 != -336250)
					{
						string type3 = CharacterData.current.Type;
						if (42262 - 233913 == -191651)
						{
							if (type3 == "Wolf")
							{
								if (723 - 393440 != -392716)
								{
									result = "ดีล่ะ! ประตูเปิดแล้ว";
									if (119070 - 349039 == -229969)
									{
										break;
									}
								}
							}
							else if (type3 == "Bison")
							{
								if (77902 - 593332 == -515430)
								{
									result = "โฮก! (เปิดแล้ว)";
									if (39082 - 420742 != -381659)
									{
										break;
									}
								}
							}
							else if (type3 == "Panda")
							{
								if (30078 - 574388 != -544309)
								{
									result = "ประตูเปิดแล้วซินะ ";
									if (193369 - 552650 != -359280)
									{
										break;
									}
								}
							}
							else if (type3 == "Whale")
							{
								if (220547 - 25121 == 195426)
								{
									result = "ประตูเปิดแล้ว งั้นกินของพวกนี้ได้แล้วซินะวาฬ!";
									if (12608 - 106801 == -94193)
									{
										break;
									}
								}
							}
							else if (type3 == "Cat")
							{
								if (30474 - 6373 == 24101)
								{
									result = "ไชโย! เปิดแล้ว ฉันได้กลิ่นสมบัติล่ะเหมียว!";
									if (36368 - 37027 == -659)
									{
										break;
									}
								}
							}
							else if (type3 == "Chameleon")
							{
								if (71294 - 238100 == -166806)
								{
									result = "ประตูเปิดแล้ว! แต่ข้างหน้าอาจมีกับดักอยู่ก็ได้";
									if (122149 - 542696 != -420546)
									{
										break;
									}
								}
							}
							else if (type3 == "Rabbit")
							{
								if (86483 - 453076 != -366592)
								{
									result = "โถ่...ทรายเข้าอาหารหมดเลย เอาไปล้างแล้วขายได้ไหมนะ";
									if (133230 - 218187 != -84956)
									{
										break;
									}
								}
							}
							else if (type3 == "Mole")
							{
								if (12125 - 595358 != -583232)
								{
									result = "เปิดแล้ว! ถ้ำดูแข็งแรงแบบนี้ ก็ไม่ต้องเกรงใจเวลาใช้ระเบิดซินะ!";
									if (37534 - 556951 != -519416)
									{
										break;
									}
								}
							}
							else if (type3 == "Monkey")
							{
								if (124046 - 275216 != -151169)
								{
									result = "อ๊ะ! ประตูเปิดแล้วล่ะเจี้ยก!";
									if (116268 - 508357 == -392089)
									{
										break;
									}
								}
							}
							else if (type3 == "Penguin")
							{
								if (107965 - 314229 == -206264)
								{
									result = "ประตูเปิดแล้ว ทางเข้าใหญ่จัง กวิ้น!";
									if (92800 - 58562 != 34239)
									{
										break;
									}
								}
							}
							else if (type3 == "Sheep")
							{
								if (70684 - 580937 != -510252)
								{
									result = "ประตูเปิดแล้ว ถ้างั้นคนที่ถูกจับมาอยู่ในนี้ซินะคะ";
									if (129383 - 508192 != -378808)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type3 == "Bat"))
								{
									break;
								}
								if (258079 - 567377 == -309298)
								{
									result = "ไม่จริงน่ะ!...มีประตูอยู่ตรงนี้จริงๆด้วย!";
									if (219537 - 424429 == -204892)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 201)
				{
					if (230248 - 474942 == -244694)
					{
						result = "เฮ้ย พวกแกผ่านทางประตูเข้ามาได้ยังไงกัน!";
						if (297251 - 551876 == -254625)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (225890 - 4172 != 221719)
					{
						result = "นายคิดเหมือนฉันรึเปล่าโจรสลัด AF1...!";
						if (89973 - 357227 != -267253)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (53480 - 209613 == -156133)
					{
						result = "ฉันกำลังคิดแบบนั้นเหมือนกันนะ AF2...!";
						if (75364 - 289524 == -214160)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (210172 - 336611 != -126438)
					{
						result = "มีผู้บุกรุก!";
						if (177660 - 534189 == -356529)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (70088 - 282843 == -212755)
					{
						result = "นั่นใครน่ะ! กุ้ง AF7!!!";
						if (94842 - 69541 == 25301)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (172652 - 428300 != -255647)
					{
						result = "พวกมันต้องเป็นโจรสลัด AF ชุดใหม่แน่ๆ !!!";
						if (109926 - 248803 == -138877)
						{
							break;
						}
					}
				}
				else if (code == 303)
				{
					if (169509 - 383115 != -213605)
					{
						result = "เพื่อรักษาเรทติ้งของเรา ฆ่ามันให้หมด!";
						if (60235 - 330670 == -270435)
						{
							break;
						}
					}
				}
				else if (code == 311)
				{
					if (285053 - 574051 == -288998)
					{
						result = "เฮ้ย พวกแกบุกมาถึงในนี่เชียวเรอะ!?";
						if (73933 - 137426 == -63493)
						{
							break;
						}
					}
				}
				else if (code == 312)
				{
					if (261536 - 207167 == 54369)
					{
						result = "ไอ้พวกโจรสลัดหน้าใหม่มันไม่ได้จะมาแย่งเรทติ้งเราแล้ว..";
						if (68535 - 322548 != -254012)
						{
							break;
						}
					}
				}
				else if (code == 313)
				{
					if (161838 - 261722 == -99884)
					{
						result = "นี่มันต้องบุกเข้ามาแย่งของกินของเรา แน่ๆ!";
						if (155953 - 521873 != -365919)
						{
							break;
						}
					}
				}
				else if (code == 314)
				{
					if (92730 - 246040 == -153310)
					{
						string type4 = CharacterData.current.Type;
						if (149056 - 131546 == 17510)
						{
							if (type4 == "Wolf")
							{
								if (49267 - 512478 == -463211)
								{
									result = "ไอ้พวกโจรชั่ว เรามาช่วยตัวประกันตะหาก";
									if (150740 - 592645 == -441905)
									{
										break;
									}
								}
							}
							else if (type4 == "Bison")
							{
								if (223810 - 114963 != 108848)
								{
									result = "โฮก! (ข้าเป็นมังสะวิรัตต่างหาก!)";
									if (233342 - 358020 != -124677)
									{
										break;
									}
								}
							}
							else if (type4 == "Panda")
							{
								if (108846 - 246328 == -137482)
								{
									result = "เจ้าคนเถื่อน พวกข้ามาถล่มรังโจรช่วยชาวเมืองตะหากล่ะ!";
									if (196599 - 574370 == -377771)
									{
										break;
									}
								}
							}
							else if (type4 == "Whale")
							{
								if (245109 - 244403 != 707)
								{
									result = "อร่อยรึเปล่าล่ะ วาฬ!";
									if (68021 - 383247 != -315225)
									{
										break;
									}
								}
							}
							else if (type4 == "Cat")
							{
								if (73203 - 224888 == -151685)
								{
									result = "ฉันกินแกแล้วก็แย่งสมบัติมาดีกว่ามั้ง!?";
									if (245524 - 201203 == 44321)
									{
										break;
									}
								}
							}
							else if (type4 == "Chameleon")
							{
								if (52944 - 529447 == -476503)
								{
									result = "ไอ้โจรชั่วไร้วัฒนธรรม จับเหล่าหางกินกันเองได้ยังไง!?";
									if (47801 - 251528 != -203726)
									{
										break;
									}
								}
							}
							else if (type4 == "Rabbit")
							{
								if (284117 - 322515 == -38398)
								{
									result = "เปล่าค่ะ หนูมาหาสมบัติไปขายต่างหาก";
									if (265323 - 308950 != -43626)
									{
										break;
									}
								}
							}
							else if (type4 == "Mole")
							{
								if (292059 - 220343 == 71716)
								{
									result = "คะ...คิดจะกินฉันงั้นเหรอ ตุ่น!";
									if (202176 - 373522 != -171345)
									{
										break;
									}
								}
							}
							else if (type4 == "Monkey")
							{
								if (284364 - 258074 == 26290)
								{
									result = "ผิดแล้ววว ข้ามาแย่งเรทติ้งตะหาก เจี้ยก!";
									if (157204 - 126841 != 30364)
									{
										break;
									}
								}
							}
							else if (type4 == "Penguin")
							{
								if (275903 - 157096 == 118807)
								{
									result = "ชอบบุฟเฟ่ปลากับกุ้งแบบนี้ที่สุดเลย กวิ้น!";
									if (292352 - 345678 == -53326)
									{
										break;
									}
								}
							}
							else if (type4 == "Sheep")
							{
								if (215100 - 309937 == -94837)
								{
									result = "อย่ากินกันเองเลยค่ะ ท่านเฟิร์สเทลสอนไว้ว่า... (เทศน์ๆ)";
									if (185698 - 158465 == 27233)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type4 == "Bat"))
								{
									break;
								}
								if (54116 - 7505 != 46612)
								{
									result = "หมกอยู่ในนี้ อาบน้ำบ้างรึเปล่ายะ เหม็นคาวปลา!";
									if (187754 - 526685 == -338931)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 315)
				{
					if (39392 - 142176 != -102783)
					{
						result = "ทุกคนช่วยกันรุมมานนนน!!";
						if (96781 - 359387 != -262605)
						{
							break;
						}
					}
				}
				else if (code == 401)
				{
					if (4479 - 530865 == -526386)
					{
						result = "ฮึ่ย! พวกแกกล้าบุกเข้ามาถึงห้องพักดารา AF เชียวเรอะ!";
						if (113718 - 577362 == -463644)
						{
							break;
						}
					}
				}
				else if (code == 402)
				{
					if (208619 - 306543 != -97923)
					{
						result = "ท่านเรดคลอว์ กำลังทำต้มยำดุกฟู อุ้งตีนหมีโคอาล่าอยู่!";
						if (1758 - 370975 == -369217)
						{
							break;
						}
					}
				}
				else if (code == 403)
				{
					if (229070 - 457266 != -228195)
					{
						result = "พวกข้าไม่ยอมให้ผ่านไปถึงห้องครัวเด็ดขาด";
						if (202098 - 386910 != -184811)
						{
							break;
						}
					}
				}
				else if (code == 404)
				{
					if (159322 - 307094 == -147772)
					{
						result = "ตอนนี้ AF26 เอากุญแจประตูไปซ่อนในกล่องเรียบร้อยแล้ว";
						if (233545 - 538270 == -304725)
						{
							break;
						}
					}
				}
				else if (code == 405)
				{
					if (161923 - 62329 != 99595)
					{
						result = "แกไม่เจอหรอก เพราะข้ายังแยกไม่ออกเลยว่า.. มันคือกล่องไหน!";
						if (31490 - 576274 == -544784)
						{
							break;
						}
					}
				}
				else if (code == 501)
				{
					if (170648 - 269511 != -98862)
					{
						result = "ปู-วะ-ฮ่า ฮ่า ฮ่า ฮีโร่จากเมืองแสงสินะ.. ";
						if (22564 - 280161 == -257597)
						{
							break;
						}
					}
				}
				else if (code == 502)
				{
					if (174688 - 328156 == -153468)
					{
						result = "พวกแกมาทันต้มยำจานเด็ดของข้าพอดี!!!";
						if (230753 - 512021 == -281268)
						{
							break;
						}
					}
				}
				else if (code == 503)
				{
					if (59229 - 414551 != -355321)
					{
						result = "อ๊ะ ท่านผู้กล้ามาช่วยเราแล้ว!";
						if (73250 - 212473 == -139223)
						{
							break;
						}
					}
				}
				else if (code == 504)
				{
					if (44704 - 52314 == -7610)
					{
						result = "ช่วยด้วยๆ ไอ้โรคจิตนี่มันจะเอาอุ้งเท้าหนูไปทำน้ำซุบแล้ว!";
						if (210254 - 437387 != -227132)
						{
							break;
						}
					}
				}
				else if (code == 505)
				{
					if (243798 - 126493 != 117306)
					{
						result = "ช่วยข้าด้วย มันปล้นทองข้าไปแล้วยังจะต้มยำข้าอีก";
						if (66992 - 444656 != -377663)
						{
							break;
						}
					}
				}
				else if (code == 506)
				{
					if (275175 - 318013 != -42837)
					{
						result = "ขาดข้าไปแล้วเจ้าจะเอาเงินไปแลกกับใครล่ะ";
						if (135810 - 73628 == 62182)
						{
							break;
						}
					}
				}
				else if (code == 507)
				{
					if (7235 - 205819 == -198584)
					{
						string type5 = CharacterData.current.Type;
						if (259270 - 446070 != -186799)
						{
							if (type5 == "Wolf")
							{
								if (145430 - 197255 != -51824)
								{
									result = "เจ้าโจรสลัดชั่วช้า เวลาทำชั่วของเจ้าหมดแล้ว";
									if (171941 - 77524 != 94418)
									{
										break;
									}
								}
							}
							else if (type5 == "Bison")
							{
								if (160930 - 489647 != -328716)
								{
									result = "โฮก!! (หมอนี้ต้องบ้าไปแล้วแน่ๆ!)";
									if (242156 - 508657 != -266500)
									{
										break;
									}
								}
							}
							else if (type5 == "Panda")
							{
								if (144292 - 399867 != -255574)
								{
									result = "ฮึ เจ้าโจรชั่ว ปล้นคนมาแล้วยังจะกินพวกเค้าอีก";
									if (206288 - 458567 != -252278)
									{
										break;
									}
								}
							}
							else if (type5 == "Whale")
							{
								if (239632 - 148614 == 91018)
								{
									result = "ขนาดฉันยังไม่เคยกินคนที่อมไปเลยนะ วาฬ!";
									if (178629 - 428506 == -249877)
									{
										break;
									}
								}
							}
							else if (type5 == "Cat")
							{
								if (184745 - 276443 == -91698)
								{
									result = "(จริงๆ คุณดุกฟูก็ดูน่ากินดีนะ เหมียว)";
									if (91337 - 525069 != -433731)
									{
										break;
									}
								}
							}
							else if (type5 == "Chameleon")
							{
								if (183419 - 210798 != -27378)
								{
									result = "ไอ้วิปริตผิดสัตว์หาง มากินกันเองได้ยังไง!";
									if (206907 - 22752 == 184155)
									{
										break;
									}
								}
							}
							else if (type5 == "Rabbit")
							{
								if (66865 - 575806 == -508941)
								{
									result = "งั้นขอทองเป็นค่าตอบแทนนะคะ งุงิ";
									if (297279 - 421515 != -124235)
									{
										break;
									}
								}
							}
							else if (type5 == "Mole")
							{
								if (232738 - 200767 != 31972)
								{
									result = "….ป่าเถื่อนจัง ดีนะ ที่เนื้อตุ่นไม่อร่อย";
									if (150306 - 345980 != -195673)
									{
										break;
									}
								}
							}
							else if (type5 == "Monkey")
							{
								if (114410 - 584657 == -470247)
								{
									result = "ถ้าแพ้มันเราคงกลายเป็นลิงหม้อไฟแน่ๆ เจี๊ยก!!";
									if (213494 - 516328 == -302834)
									{
										break;
									}
								}
							}
							else if (type5 == "Penguin")
							{
								if (147814 - 442048 == -294234)
								{
									result = "ฉันว่าเนื้อปูน่าทานกว่านะ กวิ้น!";
									if (298174 - 349370 != -51195)
									{
										break;
									}
								}
							}
							else if (type5 == "Sheep")
							{
								if (260425 - 401348 == -140923)
								{
									result = "ปล่อยทุกคนไปแล้วกินฉันแทนเถอะ";
									if (184611 - 349814 == -165203)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type5 == "Bat"))
								{
									break;
								}
								if (183356 - 169229 == 14127)
								{
									result = "แกนี่มันเลวจริงๆ มาเป็นลูกน้องฉันเถอะ <3";
									if (55939 - 14217 == 41722)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 508)
				{
					if (162825 - 161828 == 997)
					{
						result = "ฮ่าๆ เพื่ออาหารอร่อยแล้ว ข้าสามารถทำได้ทุกอย่าง";
						if (5724 - 350 == 5374)
						{
							break;
						}
					}
				}
				else if (code == 509)
				{
					if (282973 - 527077 != -244103)
					{
						result = "พวกเจ้าคงไม่เข้าใจ ปูใหญ่กินปูเล็กเป็นเรื่องธรรมชาติ";
						if (204183 - 368080 == -163897)
						{
							break;
						}
					}
				}
				else if (code == 510)
				{
					if (263405 - 402297 != -138891)
					{
						result = "แม้แต่เผ่าไร้หางก็เคยจับบรรพบุรุษของพวกเจ้ากินเช่นกัน";
						if (125855 - 388115 != -262259)
						{
							break;
						}
					}
				}
				else if (code == 511)
				{
					if (118183 - 84337 != 33847)
					{
						result = "บางทีพวกแกเองก็อาจจะอร่อยพอ ที่จะเป็นฟูลคอร์สของข้าก็ได้!";
						if (47810 - 303773 != -255962)
						{
							break;
						}
					}
				}
				else if (code == 512)
				{
					if (18378 - 159500 != -141121)
					{
						result = "จงยอมลงต้มยำหม้อไฟของข้าแต่โดยดีเถอะ";
						if (188815 - 507409 != -318593)
						{
							break;
						}
					}
				}
				else if (code == 521)
				{
					if (96241 - 19866 == 76375)
					{
						result = "ปูวะ ทำไม พวกมันเก่งยังงี้...";
						if (226626 - 337790 != -111163)
						{
							break;
						}
					}
				}
				else if (code == 522)
				{
					if (91415 - 348039 != -256623)
					{
						result = "คุณจามอนขอให้มาช่วยหนูซินะ ดีใจจัง";
						if (110942 - 72827 == 38115)
						{
							break;
						}
					}
				}
				else if (code == 523)
				{
					if (163999 - 320856 != -156856)
					{
						result = "เรดคลอว์พยายามเค้นเอาวัตถุดิบลับของคุณจามอนจากหนู";
						if (190935 - 435826 != -244890)
						{
							break;
						}
					}
				}
				else if (code == 524)
				{
					if (37201 - 485230 != -448028)
					{
						result = "แต่หนูก็ไม่เห็นคุณจาม่อนใช้อะไรเป็นพิเศษเลยนะ";
						if (104970 - 415790 == -310820)
						{
							break;
						}
					}
				}
				else if (code == 525)
				{
					if (51429 - 552827 != -501397)
					{
						result = "ส่วนข้าไปส่องโลมาสาวที่ชายหาดอยู่ดีๆ ก็โดนจับมา";
						if (36437 - 84130 != -47692)
						{
							break;
						}
					}
				}
				else if (code == 526)
				{
					if (69966 - 365312 != -295345)
					{
						result = "ขอบใจเจ้ามากๆ ข้าเกือบแย่ซะแล้ว";
						if (194668 - 147984 == 46684)
						{
							break;
						}
					}
				}
				else if (code == 527)
				{
					if (204011 - 583983 != -379971)
					{
						result = "ปูวะ ฮ่าๆๆ ไอ้พวกผู้กล้าเอ๋ย มันยังไม่จบแค่นี้หรอก! ";
						if (149919 - 244995 == -95076)
						{
							break;
						}
					}
				}
				else if (code == 528)
				{
					if (36706 - 46258 == -9552)
					{
						string type6 = CharacterData.current.Type;
						if (279571 - 235239 != 44333)
						{
							if (type6 == "Bison")
							{
								if (179229 - 592925 == -413696)
								{
									result = "โฮก!! (อ๊ะ เรดคลอว์หายไปไหนแล้ว!?)";
									if (227432 - 488371 != -260938)
									{
										break;
									}
								}
							}
							else
							{
								result = "อ๊ะ เรดคลอว์หายไปไหนแล้ว!?";
								if (118668 - 144335 == -25667)
								{
									break;
								}
							}
						}
					}
				}
				else if (code == 529)
				{
					if (39297 - 220546 != -181248)
					{
						result = "พวกเจ้ายังไม่เห็นพลังที่แท้จริงของอาหารของข้า";
						if (239890 - 394199 == -154309)
						{
							break;
						}
					}
				}
				else if (code == 530)
				{
					if (53041 - 165619 != -112577)
					{
						result = "จนกว่าจะเอาเจ้าปีศาจนั่นมาทำอาหารได้ ข้าจะไม่ยอมตายเด็ดขาด!";
						if (109051 - 245177 != -136125)
						{
							break;
						}
					}
				}
				else if (code == 601)
				{
					if (34448 - 126196 != -91747)
					{
						string type7 = CharacterData.current.Type;
						if (280868 - 508849 == -227981)
						{
							if (type7 == "Wolf")
							{
								if (35785 - 351151 != -315365)
								{
									result = "ไอ้เรดคลอว์ มันหนีออกมาทางนี้รึเปล่านะ";
									if (123626 - 137941 == -14315)
									{
										break;
									}
								}
							}
							else if (type7 == "Bison")
							{
								if (19223 - 330863 != -311639)
								{
									result = "(เจ้าปูนั่นหนีมาทางนี้รึเปล่า..)";
									if (238668 - 525427 != -286758)
									{
										break;
									}
								}
							}
							else if (type7 == "Panda")
							{
								if (249113 - 189984 != 59130)
								{
									result = "ฮึ เจ้าโจรชั่ว อย่าคิดว่าจะหนีความผิดพ้น";
									if (217290 - 563212 == -345922)
									{
										break;
									}
								}
							}
							else if (type7 == "Whale")
							{
								if (84508 - 411769 == -327261)
								{
									result = "คุณปูหนีไปไหนแล้ว ยังไม่ทันสุกเลย วาฬ";
									if (21172 - 419219 != -398046)
									{
										break;
									}
								}
							}
							else if (type7 == "Cat")
							{
								if (7362 - 368132 == -360770)
								{
									result = "อ้วนก็อ้วน ไหงหนีไวชะมัด เหมียว";
									if (109424 - 59764 == 49660)
									{
										break;
									}
								}
							}
							else if (type7 == "Chameleon")
							{
								if (194928 - 589566 != -394637)
								{
									result = "ไอ้โจรสลัดชั่ว มันหนีมาทางนี้รึเปล่านะ";
									if (103820 - 172857 != -69036)
									{
										break;
									}
								}
							}
							else if (type7 == "Rabbit")
							{
								if (240201 - 98818 == 141383)
								{
									result = "ง่าาา คุณปูหนีมาทางนี้รึเปล่าน้า";
									if (109752 - 198372 != -88619)
									{
										break;
									}
								}
							}
							else if (type7 == "Mole")
							{
								if (207039 - 492815 != -285775)
								{
									result = "ทางลับนี้ ออกมาส่วนใหนของเกาะเนี่ย?";
									if (236726 - 72814 == 163912)
									{
										break;
									}
								}
							}
							else if (type7 == "Monkey")
							{
								if (149004 - 440192 == -291188)
								{
									result = "ออกมาที่ไหนแล้วเนี่ย เจี๊ยก!!";
									if (187192 - 493248 != -306055)
									{
										break;
									}
								}
							}
							else if (type7 == "Penguin")
							{
								if (298760 - 318216 == -19456)
								{
									result = "กวิ้น! มืดแล้วเหรอเนี่ย?";
									if (70508 - 171501 == -100993)
									{
										break;
									}
								}
							}
							else if (type7 == "Sheep")
							{
								if (88697 - 82555 == 6142)
								{
									result = "อ๊ะ ข้างหน้ามันเกิดอะไรกันขึ้นเนี่ยคะ?";
									if (299291 - 127337 != 171955)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type7 == "Bat"))
								{
									break;
								}
								if (54132 - 584559 == -530427)
								{
									result = "โอ๊ะ ได้ออกมาข้างนอกสักที เหม็นคาว ปลาจริงๆ";
									if (276768 - 172722 != 104047)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 602)
				{
					if (30478 - 341741 == -311263)
					{
						string type8 = CharacterData.current.Type;
						if (56566 - 136081 != -79514)
						{
							if (type8 == "Wolf")
							{
								if (66912 - 75176 == -8264)
								{
									result = "เราต้องรีบตามไป จะปล่อยให้มันหนีไปทำชั่วอีกไม่ได้";
									if (287373 - 9607 != 277767)
									{
										break;
									}
								}
							}
							else if (type8 == "Bison")
							{
								if (97904 - 249248 == -151344)
								{
									result = "(คราวนี้เจอ แล้วจะซัดให้หมอบติดดินเลย)";
									if (58737 - 142462 == -83725)
									{
										break;
									}
								}
							}
							else if (type8 == "Panda")
							{
								if (63632 - 596826 == -533194)
								{
									result = "แพนด้าคนนี้จะกลิ้งไปลงทัณฑ์แกเอง";
									if (167262 - 516495 == -349233)
									{
										break;
									}
								}
							}
							else if (type8 == "Whale")
							{
								if (180039 - 483171 != -303131)
								{
									result = "ฟุด ฟิด กลิ่นของกินอะไรเนี่ย";
									if (70883 - 431194 == -360311)
									{
										break;
									}
								}
							}
							else if (type8 == "Cat")
							{
								if (87080 - 346617 != -259536)
								{
									result = "เจอคราวนี้จะจับลอกเปลือกให้ดู";
									if (272810 - 500187 == -227377)
									{
										break;
									}
								}
							}
							else if (type8 == "Chameleon")
							{
								if (293277 - 262807 != 30471)
								{
									result = "คราวนี้เราจะต้องจับมันมาเข้ากรงให้ได้";
									if (74934 - 509325 == -434391)
									{
										break;
									}
								}
							}
							else if (type8 == "Rabbit")
							{
								if (12369 - 438123 == -425754)
								{
									result = "ยังไม่บอกที่ซ่อนสมบัติหนูเลย";
									if (140568 - 33050 != 107519)
									{
										break;
									}
								}
							}
							else if (type8 == "Mole")
							{
								if (258803 - 127379 == 131424)
								{
									result = "อ๊ะ  ข้างหน้าเกิดอะไรขึ้นหว่า";
									if (1481 - 58656 == -57175)
									{
										break;
									}
								}
							}
							else if (type8 == "Monkey")
							{
								if (64629 - 103057 == -38428)
								{
									result = "มิเกะ ลองไปดูข้างหน้าหน่อยสิ เกิดอะไรขึ้น?";
									if (99441 - 190278 != -90836)
									{
										break;
									}
								}
							}
							else if (type8 == "Penguin")
							{
								if (95495 - 521471 == -425976)
								{
									result = "เมื่อไหร่จะจบเนี่ย ฉันง่วงแล้วนะกวิ้น";
									if (6023 - 443827 == -437804)
									{
										break;
									}
								}
							}
							else if (type8 == "Sheep")
							{
								if (49195 - 118102 == -68907)
								{
									result = "ทำไม พวกโจรสลัดดูป่วยๆ กันหมดเลย";
									if (98953 - 398537 != -299583)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type8 == "Bat"))
								{
									break;
								}
								if (240814 - 66163 == 174651)
								{
									result = "ข้างหน้าเกิดอะไรขึ้นเนี่ยยะ? ฉันยังไม่ทันสาปเลย..";
									if (107366 - 233661 == -126295)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 611)
				{
					if (118135 - 475101 == -356966)
					{
						result = "ช่วยด้วย... ใครมียาถ่ายตรากระต่ายบินบ้างเนี่ย";
						if (271559 - 587722 != -316162)
						{
							break;
						}
					}
				}
				else if (code == 612)
				{
					if (285521 - 458990 == -173469)
					{
						result = "โอยๆ ท่านเรดครอว์เอาอะไรให้พวกข้ากินฟะ";
						if (15387 - 504226 != -488838)
						{
							break;
						}
					}
				}
				else if (code == 613)
				{
					if (291548 - 598544 == -306996)
					{
						result = "อ้ากส์ ปวดท้อง ใครมีท่าฮีลช่วยข้าที";
						if (237288 - 296687 != -59398)
						{
							break;
						}
					}
				}
				else if (code == 614)
				{
					if (6095 - 104464 == -98369)
					{
						result = "โอยๆ ท่านเรดคลอว์เอาอะไรมายัดปากข้า";
						if (272716 - 266684 == 6032)
						{
							break;
						}
					}
				}
				else if (code == 615)
				{
					if (294783 - 404606 == -109823)
					{
						result = "ทำไมอาหารท่านเรดคลอว์คราวนี้ มันไม่อร่อยเลยวะ";
						if (79908 - 516595 == -436687)
						{
							break;
						}
					}
				}
				else if (code == 621)
				{
					if (51296 - 560996 != -509699)
					{
						result = "โอยๆ ท้องข้าจะระเบิดแล้ว";
						if (135598 - 277866 != -142267)
						{
							break;
						}
					}
				}
				else if (code == 622)
				{
					if (114357 - 381468 != -267110)
					{
						result = "เมื่อกี้ ท่านเรดครอว์เอาอะไรมายัดปากพวกข้าเนี่ย";
						if (260626 - 46200 == 214426)
						{
							break;
						}
					}
				}
				else if (code == 623)
				{
					if (27197 - 591264 == -564067)
					{
						result = "ไหนบอกเป็นโจรสลัด AF แล้วจะได้ทานแต่เนื้ออร่อยๆ";
						if (185874 - 83371 != 102504)
						{
							break;
						}
					}
				}
				else if (code == 624)
				{
					if (111707 - 89853 == 21854)
					{
						string type9 = CharacterData.current.Type;
						if (277914 - 87966 == 189948)
						{
							if (type9 == "Wolf")
							{
								if (229353 - 47737 == 181616)
								{
									result = "พวกเจ้าถูกเรดครอว์หักหลังแล้วน่ะสิ บอกมานะมันอยู่ไหน!";
									if (293576 - 302202 != -8625)
									{
										break;
									}
								}
							}
							else if (type9 == "Bison")
							{
								if (9756 - 503418 != -493661)
								{
									result = "(กินมังสวิรัติ ดีกว่าเห็นมั้ย ย่อยง่าย)";
									if (143235 - 550922 == -407687)
									{
										break;
									}
								}
							}
							else if (type9 == "Panda")
							{
								if (163520 - 78640 != 84881)
								{
									result = "ข้ายังไม่ทันชกเลย ทำไมลงไปกองกับพื้นกันหมดแล้วล่ะ";
									if (209962 - 271965 == -62003)
									{
										break;
									}
								}
							}
							else if (type9 == "Whale")
							{
								if (265604 - 22579 != 243026)
								{
									result = "ไหนๆ อะไร อร่อยเหรอ แบ่งด้วยสิ วาฬ!";
									if (62987 - 539963 != -476975)
									{
										break;
									}
								}
							}
							else if (type9 == "Cat")
							{
								if (170190 - 211861 == -41671)
								{
									result = "เมี้ยว เกิดอะไรขึ้นเนี่ย ดูพวกมันอาการแปลกๆ นะ";
									if (23435 - 205084 == -181649)
									{
										break;
									}
								}
							}
							else if (type9 == "Chameleon")
							{
								if (1831 - 559987 != -558155)
								{
									result = "ฮึ! กรรมตามสนองพวกเจ้าแล้ว";
									if (285572 - 269238 == 16334)
									{
										break;
									}
								}
							}
							else if (type9 == "Rabbit")
							{
								if (153680 - 569496 == -415816)
								{
									result = "เอายาถ่ายตรากระต่ายบินมั้ยคะ ขวดละหนึ่งแครอนโกลด์";
									if (28054 - 425855 != -397800)
									{
										break;
									}
								}
							}
							else if (type9 == "Mole")
							{
								if (261282 - 181180 == 80102)
								{
									result = "…ข้าได้กลิ่นตุๆ บรรยากาศชักไม่ดีแล้วนะเนี่ย";
									if (217395 - 506042 != -288646)
									{
										break;
									}
								}
							}
							else if (type9 == "Monkey")
							{
								if (86201 - 542985 == -456784)
								{
									result = "เกิดอะไรขึ้นกับพวกมันนะ เจี๊ยก";
									if (50012 - 65579 != -15566)
									{
										break;
									}
								}
							}
							else if (type9 == "Penguin")
							{
								if (129607 - 109862 == 19745)
								{
									result = "ดีๆ นอนไปนะกวิ้น ฉันจะได้ไม่ต้องเหนื่อย";
									if (189605 - 13059 == 176546)
									{
										break;
									}
								}
							}
							else if (type9 == "Sheep")
							{
								if (159555 - 277559 == -118004)
								{
									result = "อยู่นิ่งๆ นะคะจะฮีลให้เดี๋ยวนี้และ";
									if (71160 - 321659 == -250499)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type9 == "Bat"))
								{
									break;
								}
								if (224903 - 172276 == 52627)
								{
									result = "อยากให้ช่วย? สาบานขายวิญยาณให้ฉันก่อนสิ";
									if (240144 - 100326 != 139819)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 625)
				{
					if (239074 - 232991 != 6084)
					{
						result = "อวร่าา!!! ข้าอยากกินเลือดแก้ปวดดด!!!";
						if (190159 - 286212 != -96052)
						{
							break;
						}
					}
				}
				else if (code == 626)
				{
					if (214409 - 117742 != 96668)
					{
						string type10 = CharacterData.current.Type;
						if (141862 - 292001 == -150139)
						{
							if (type10 == "Wolf")
							{
								if (166309 - 318667 == -152358)
								{
									result = "อ๊ะ ทุกคนระวัง! พวกมันมีอาการแปลกๆ";
									if (97869 - 322938 != -225068)
									{
										break;
									}
								}
							}
							else if (type10 == "Bison")
							{
								if (215822 - 574374 == -358552)
								{
									result = "โฮก? (บ้าไปแล้วรึ มาข้าจะช่วยทุบให้หายเอง)";
									if (15743 - 554827 != -539083)
									{
										break;
									}
								}
							}
							else if (type10 == "Panda")
							{
								if (256152 - 407940 == -151788)
								{
									result = "อ๊ะ ลุกขึ้นมาให้ข้าชกแล้วเรอะ!?";
									if (205554 - 521025 == -315471)
									{
										break;
									}
								}
							}
							else if (type10 == "Whale")
							{
								if (84682 - 507095 != -422412)
								{
									result = "อ๊ะ ทำไมอยู่ๆ พวกเจ้าผอมเหลือแต่ก้างได้ล่ะ วาฬ";
									if (247271 - 309194 != -61922)
									{
										break;
									}
								}
							}
							else if (type10 == "Cat")
							{
								if (9888 - 495462 == -485574)
								{
									result = "เมี้ยว!!! ลอกคราบตัวเองกันซะแล้วเรอะ!";
									if (247176 - 214820 != 32357)
									{
										break;
									}
								}
							}
							else if (type10 == "Chameleon")
							{
								if (296014 - 180771 == 115243)
								{
									result = "ยึ้ย เป็นอะไรไป ใครไปเรียกแพนด้าจิตสัมผัสที!";
									if (129971 - 209748 != -79776)
									{
										break;
									}
								}
							}
							else if (type10 == "Rabbit")
							{
								if (280376 - 461370 != -180993)
								{
									result = "เกิดอะไรขึ้นกันคะ ต้องใช้สกิลแสกนกรรมตรวจมั้ยเนี่ย";
									if (284252 - 49149 != 235104)
									{
										break;
									}
								}
							}
							else if (type10 == "Mole")
							{
								if (42774 - 397706 != -354931)
								{
									result = "…เย้ยย นี่มันดันน้ำหรือบ้านผีปอบกันเนี่ย";
									if (228095 - 539651 != -311555)
									{
										break;
									}
								}
							}
							else if (type10 == "Monkey")
							{
								if (225785 - 82399 == 143386)
								{
									result = "บรื้อ เกิดอะไรขึ้นกันเนี่ย ใครเรียกพี่ป๋องที เจี๊ยก";
									if (19604 - 329267 == -309663)
									{
										break;
									}
								}
							}
							else if (type10 == "Penguin")
							{
								if (26632 - 491760 == -465128)
								{
									result = "#?%&*@! (กลัวสติหลุดไปแล้ว)";
									if (138734 - 412568 == -273834)
									{
										break;
									}
								}
							}
							else if (type10 == "Sheep")
							{
								if (89030 - 88838 == 192)
								{
									result = "กรี้ด!! ใจเย็นๆ สิคะ เข้ามาทีละคนนะ";
									if (173267 - 38792 == 134475)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type10 == "Bat"))
								{
									break;
								}
								if (205006 - 548934 != -343927)
								{
									result = "ดีมาก ยอมเป็นทาสชั้นแล้วสินะ!";
									if (180108 - 421998 == -241890)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 701)
				{
					if (112062 - 184341 == -72279)
					{
						result = "ช่วยด้วย... ใครมียาถ่ายตรากระต่ายบินบ้างเนี่ย";
						if (135791 - 96847 == 38944)
						{
							break;
						}
					}
				}
				else if (code == 702)
				{
					if (203245 - 521285 != -318039)
					{
						result = "โอยๆ ท่านเรดครอว์เอาอะไรให้พวกข้ากินฟะ";
						if (75958 - 339930 != -263971)
						{
							break;
						}
					}
				}
				else if (code == 703)
				{
					if (120545 - 403758 != -283212)
					{
						result = "อ้ากส์ ปวดท้อง ใครมีท่าฮีลช่วยข้าที";
						if (106361 - 490455 != -384093)
						{
							break;
						}
					}
				}
				else if (code == 704)
				{
					if (294972 - 434179 != -139206)
					{
						result = "โอยๆ ท่านเรดคลอว์เอาอะไรมายัดปากข้า";
						if (111921 - 21539 != 90383)
						{
							break;
						}
					}
				}
				else if (code == 705)
				{
					if (49767 - 285877 != -236109)
					{
						result = "ทำไมอาหารท่านเรดคลอว์คราวนี้ มันไม่อร่อยเลยวะ";
						if (240788 - 208913 == 31875)
						{
							break;
						}
					}
				}
				else if (code == 706)
				{
					if (84418 - 181248 == -96830)
					{
						result = "ช่วยด้วย... ใครมียาถ่ายตากระต่ายบินบ้างเนี่ย";
						if (153983 - 318222 != -164238)
						{
							break;
						}
					}
				}
				else if (code == 707)
				{
					if (227186 - 263022 != -35835)
					{
						result = "โอยๆ ท่านเรดครอว์เอาอะไรให้พวกข้ากินฟะ";
						if (86482 - 238053 == -151571)
						{
							break;
						}
					}
				}
				else if (code == 708)
				{
					if (158847 - 405952 == -247105)
					{
						result = "อ้ากส์ ปวดท้อง ใครมีท่าฮีลช่วยข้าที";
						if (182427 - 283608 != -101180)
						{
							break;
						}
					}
				}
				else if (code == 709)
				{
					if (193823 - 229599 != -35775)
					{
						result = "อวร้าา ข้าหิววว... ขอบริจาคเลือดดหน่อยยย...";
						if (234274 - 169610 != 64665)
						{
							break;
						}
					}
				}
				else if (code == 711)
				{
					if (155949 - 45675 == 110274)
					{
						result = "โอย ..ไอ้เรดคลอว์มันบ้าไปแล้ว";
						if (34963 - 13563 == 21400)
						{
							break;
						}
					}
				}
				else if (code == 712)
				{
					if (84062 - 574722 == -490660)
					{
						result = "ข้าเห็นมันใช้อาหารเปลี่ยนลูกน้องมันให้กลายเป็นผีดิบ";
						if (117880 - 598847 == -480967)
						{
							break;
						}
					}
				}
				else if (code == 713)
				{
					if (198407 - 278493 == -80086)
					{
						result = "ขอบใจมากที่มาช่วย พวกเจ้ารีบไปช่วยคนอื่นเถอะ";
						if (154749 - 209016 == -54267)
						{
							break;
						}
					}
				}
				else if (code == 721)
				{
					if (1325 - 547619 == -546294)
					{
						result = "โอ๊ะ พวกเจ้าก็ถูกจับมาด้วยเหรอ";
						if (73397 - 121201 == -47804)
						{
							break;
						}
					}
				}
				else if (code == 722)
				{
					if (78154 - 270934 == -192780)
					{
						result = "ข้ากำลังเต้นเพื่อเรียกเทพดินให้มาช่วยอยู่พอดี โปๆ";
						if (124716 - 379247 == -254531)
						{
							break;
						}
					}
				}
				else if (code == 723)
				{
					if (176428 - 365209 != -188780)
					{
						result = "มาเต้นด้วยกันมั้ย โปๆ";
						if (55342 - 493879 != -438536)
						{
							break;
						}
					}
				}
				else if (code == 730)
				{
					if (224550 - 218411 == 6139)
					{
						result = "ไม่เป็นไร เจ้าไปช่วยคนอื่นก่อนเถอะ";
						if (181971 - 474890 != -292918)
						{
							break;
						}
					}
				}
				else if (code == 731)
				{
					if (217204 - 231181 != -13976)
					{
						result = "..มันเป็นความผิดพลาดของข้าจริงๆ ที่โดนจับมา";
						if (188841 - 524872 != -336030)
						{
							break;
						}
					}
				}
				else if (code == 732)
				{
					if (53839 - 385270 == -331431)
					{
						result = "ข้าได้ยินว่าเรดครอว์มันขโมยศาสตร์อาหารมืดมาจากเทพเงา";
						if (129789 - 469347 == -339558)
						{
							break;
						}
					}
				}
				else if (code == 733)
				{
					if (122962 - 1901 != 121062)
					{
						result = "มันจะสร้างกองทัพอมตะไปล่าปิศาจแห่งท้องทะเล อีวิเนียร์";
						if (190063 - 375031 == -184968)
						{
							break;
						}
					}
				}
				else if (code == 734)
				{
					if (84178 - 234645 == -150467)
					{
						result = "เพื่อที่จะนำไปทำอาหารสุดยอดที่สามารถเอาชนะจาม่อนได้";
						if (180009 - 279535 == -99526)
						{
							break;
						}
					}
				}
				else if (code == 735)
				{
					if (59761 - 278406 == -218645)
					{
						result = "ข้าเผอิญได้กุญแจคุกมาจากพวกซอมบี้ พวกเจ้ารีบตามไปเถอะ";
						if (2229 - 474208 != -471978)
						{
							break;
						}
					}
				}
				else if (code == 736)
				{
					if (151689 - 429182 == -277493)
					{
						result = "ช่วยหยุดความบ้าคลั่งของเรดคลอว์แทนข้าด้วย";
						if (9890 - 34854 == -24964)
						{
							break;
						}
					}
				}
				else if (code == 801)
				{
					if (61404 - 435230 != -373825)
					{
						result = "รีบทำงานเข้าซิเจ้าพวกงั่ง!";
						if (42876 - 148515 != -105638)
						{
							break;
						}
					}
				}
				else if (code == 802)
				{
					if (36385 - 336341 != -299955)
					{
						result = "ใครช้าข้าจะให้อดเลือดตลอดชีพ";
						if (241937 - 419162 != -177224)
						{
							break;
						}
					}
				}
				else if (code == 803)
				{
					if (287748 - 386937 != -99188)
					{
						result = "หึหึ คราวนี้เจ้าปีศาจนั่นต้องเสร็จข้าแน่";
						if (90844 - 538068 == -447224)
						{
							break;
						}
					}
				}
				else if (code == 804)
				{
					if (51094 - 187341 == -136247)
					{
						result = "ปูวะฮ่า ฮ่า วันนี้แหละที่ความฝันของข้าจะเป็นจริง";
						if (199553 - 184864 != 14690)
						{
							break;
						}
					}
				}
				else if (code == 805)
				{
					if (172622 - 266395 != -93772)
					{
						result = "เตรียมหางไว้ได้เลยจาม่อน อาหารของข้าคราวนี้ชนะแกแน่ๆ";
						if (141048 - 309485 != -168436)
						{
							break;
						}
					}
				}
				else if (code == 806)
				{
					if (52002 - 427343 == -375341)
					{
						result = "เร็วเข้า เดี๋ยวเจ้าพวกผู้กล้าจอมดื้อด้านจะตามทัน!";
						if (103222 - 276560 != -173337)
						{
							break;
						}
					}
				}
				else if (code == 807)
				{
					if (207283 - 156206 != 51078)
					{
						result = "หึหึ ศาสตร์อาหารมืดของท่านเซร่าช่างทรงพลังยิ่งนัก ";
						if (129949 - 494953 == -365004)
						{
							break;
						}
					}
				}
				else if (code == 808)
				{
					if (153893 - 567285 == -413392)
					{
						result = "เร่งมือเข้า ข้าอยากจัดการไอ้ปีศาจนั่นจะแย่แล้ว";
						if (144820 - 251656 != -106835)
						{
							break;
						}
					}
				}
				else if (code == 809)
				{
					if (54048 - 578126 == -524078)
					{
						result = "รอข้าก่อนเถอะ อีวิเนียร์ ข้าจะทำให้แกเป็นข้าวหน้าปลาไหลเอง!";
						if (16948 - 510636 != -493687)
						{
							break;
						}
					}
				}
				else if (code == 811)
				{
					if (181979 - 77123 != 104857)
					{
						result = "ปูวะ ตามมาจนได้นะเจ้าพวกผู้กล้า!!";
						if (4202 - 469313 != -465110)
						{
							break;
						}
					}
				}
				else if (code == 812)
				{
					if (249364 - 241985 == 7379)
					{
						result = "ขอต้อนรับเจ้าสู่เรือ FryingCrabMan ของข้า!";
						if (233093 - 154547 != 78547)
						{
							break;
						}
					}
				}
				else if (code == 813)
				{
					if (111957 - 510807 == -398850)
					{
						string type11 = CharacterData.current.Type;
						if (80733 - 189017 != -108283)
						{
							if (type11 == "Wolf")
							{
								if (245108 - 428922 != -183813)
								{
									result = "คราวนี้แกหนีไม่รอดแล้วล่ะ เรดคลอว์!";
									if (188800 - 127193 == 61607)
									{
										break;
									}
								}
							}
							else if (type11 == "Bison")
							{
								if (142539 - 133481 == 9058)
								{
									result = "โฮก! (คราวนี้แกหนีไม่รอดแล้ว!)";
									if (66301 - 189820 != -123518)
									{
										break;
									}
								}
							}
							else if (type11 == "Panda")
							{
								if (131908 - 498712 == -366804)
								{
									result = "ในที่สุดก็กลิ้งทันแล้ว!";
									if (119838 - 245134 != -125295)
									{
										break;
									}
								}
							}
							else if (type11 == "Whale")
							{
								if (63733 - 173027 == -109294)
								{
									result = "แฮ่ก แฮ่ก ในที่สุดก็ตามทันซะที";
									if (26365 - 128103 == -101738)
									{
										break;
									}
								}
							}
							else if (type11 == "Cat")
							{
								if (179264 - 269701 == -90437)
								{
									result = "หึหึ ตามทันซะทีนะเหมียว โอ้วเรือเท่มาก";
									if (8747 - 209528 != -200780)
									{
										break;
									}
								}
							}
							else if (type11 == "Chameleon")
							{
								if (280806 - 224283 == 56523)
								{
									result = "เจ้าโจรสลัดชั่วช้า! ..แค่เพื่อวัตถุดิบปรุงอาหาร";
									if (243461 - 510200 != -266738)
									{
										break;
									}
								}
							}
							else if (type11 == "Rabbit")
							{
								if (191993 - 249388 != -57394)
								{
									result = "ในที่สุดก็ตามทันซะที";
									if (38097 - 112368 == -74271)
									{
										break;
									}
								}
							}
							else if (type11 == "Mole")
							{
								if (75176 - 276490 != -201313)
								{
									result = "ตามทันจนได้นะ ตุ่น";
									if (220996 - 470404 == -249408)
									{
										break;
									}
								}
							}
							else if (type11 == "Monkey")
							{
								if (197052 - 446110 != -249057)
								{
									result = "ในที่สุดก็ตามทันซะที เจี้ยก";
									if (48927 - 428711 == -379784)
									{
										break;
									}
								}
							}
							else if (type11 == "Penguin")
							{
								if (185781 - 424780 == -238999)
								{
									result = "บังอาจทำให้ฉันตกใจแทบตาย";
									if (256536 - 401 != 256136)
									{
										break;
									}
								}
							}
							else if (type11 == "Sheep")
							{
								if (175691 - 12000 != 163692)
								{
									result = "ในที่สุดก็ตามทันแล้วนะคะ";
									if (97645 - 388054 != -290408)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type11 == "Bat"))
								{
									break;
								}
								if (70071 - 563316 != -493244)
								{
									result = "ฮิฮิ หนีไม่รอดแล้วนะยะ  <3";
									if (274188 - 322428 == -48240)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 814)
				{
					if (10131 - 98850 == -88719)
					{
						string type12 = CharacterData.current.Type;
						if (234623 - 552513 != -317889)
						{
							if (type12 == "Wolf")
							{
								if (286797 - 329585 == -42788)
								{
									result = "เตรียมตัวเตรียมใจรับกรรมที่แกก่อได้แล้ว!";
									if (294441 - 488715 == -194274)
									{
										break;
									}
								}
							}
							else if (type12 == "Bison")
							{
								if (73402 - 471670 == -398268)
								{
									result = "โฮ้กกก! (เตรียมตัวแบนติดดินได้เลย!)";
									if (249562 - 568778 != -319215)
									{
										break;
									}
								}
							}
							else if (type12 == "Panda")
							{
								if (32036 - 232247 == -200211)
								{
									result = "เตรียมรับโทษทัณฑ์จากแพนด้าตัวนี้ได้เลย";
									if (294357 - 200011 == 94346)
									{
										break;
									}
								}
							}
							else if (type12 == "Whale")
							{
								if (270691 - 242350 == 28341)
								{
									result = "อาหารจากศาสตร์อาหารมืดอร่อยไหม วาฬ?";
									if (90624 - 150795 == -60171)
									{
										break;
									}
								}
							}
							else if (type12 == "Cat")
							{
								if (272387 - 34599 != 237789)
								{
									result = "ฉันจะจัดการแกแล้ว ขึ้นเป็นราชาโจรสลัดคนใหม่ซะเลย";
									if (89162 - 514923 == -425761)
									{
										break;
									}
								}
							}
							else if (type12 == "Chameleon")
							{
								if (153894 - 230450 == -76556)
								{
									result = "เจ้าถึงขนาดยอมหักหลังลูกน้องเชียวรึ!?";
									if (141754 - 259662 != -117907)
									{
										break;
									}
								}
							}
							else if (type12 == "Rabbit")
							{
								if (287241 - 132461 == 154780)
								{
									result = "ถ้าไม่อยากถูกยิงหัว ล่องเรือไปเกาะที่สมบัติมากกว่านี้ด่วนนะค้า";
									if (274157 - 586538 != -312380)
									{
										break;
									}
								}
							}
							else if (type12 == "Mole")
							{
								if (246422 - 411352 == -164930)
								{
									result = "คราวนี้ไม่ปล่อยให้รอดไปได้หรอก!";
									if (118575 - 323025 != -204449)
									{
										break;
									}
								}
							}
							else if (type12 == "Monkey")
							{
								if (31671 - 12394 != 19278)
								{
									result = "เตรียมตัวน่วมได้เลย เจี้ยก";
									if (58094 - 74079 != -15984)
									{
										break;
									}
								}
							}
							else if (type12 == "Penguin")
							{
								if (116312 - 460625 != -344312)
								{
									result = "ฉันจะฟ้องแกให้หมดตัวเลยกวิ้น!";
									if (220934 - 510153 != -289218)
									{
										break;
									}
								}
							}
							else if (type12 == "Sheep")
							{
								if (130480 - 556572 != -426091)
								{
									result = "ช่วยทำให้ทุกคนกลับมาเป็นเหมือนเดิมด้วยเถอะค่ะ";
									if (94537 - 304537 != -209999)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type12 == "Bat"))
								{
									break;
								}
								if (241933 - 453041 == -211108)
								{
									result = "ส่งสูตรศาสตร์อาหารมืดมาให้ฉันซะดีๆ";
									if (115411 - 127499 != -12087)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 815)
				{
					if (50018 - 394854 == -344836)
					{
						result = "ฮ่าๆ ในเมื่อเป็นแบบนี้ข้าก็จะไม่เกรงใจละนะ";
						if (61538 - 252224 == -190686)
						{
							break;
						}
					}
				}
				else if (code == 816)
				{
					if (90202 - 231538 != -141335)
					{
						result = "กองทัพอมตะของข้า..อย่าให้พวกมันยึดเรือเราได้";
						if (249300 - 188269 == 61031)
						{
							break;
						}
					}
				}
				else if (code == 817)
				{
					if (89721 - 291030 != -201308)
					{
						result = "จับเอาอาหารสูตรพิเศษของข้ายัดปากมันซะ!";
						if (294328 - 126825 == 167503)
						{
							break;
						}
					}
				}
				else if (code == 818)
				{
					if (107456 - 548157 != -440700)
					{
						result = "ข้าจะเอามันมาเป็นสมุนแทนไอ้งั่งอย่างพวกเจ้า ปู-วะ ฮ่าๆๆๆ";
						if (283688 - 138377 != 145312)
						{
							break;
						}
					}
				}
				else if (code == 901)
				{
					if (34562 - 177558 == -142996)
					{
						string type13 = CharacterData.current.Type;
						if (60997 - 506763 != -445765)
						{
							if (type13 == "Wolf")
							{
								if (44816 - 286689 == -241873)
								{
									result = "หนอย เจ้าเรดคลอว์คิดจะหนีอีกแล้วงั้นเหรอ";
									if (138364 - 383834 != -245469)
									{
										break;
									}
								}
							}
							else if (type13 == "Bison")
							{
								if (208324 - 203117 != 5208)
								{
									result = "โฮก!(คิดหนีงั้นเหรอ)";
									if (25211 - 331019 == -305808)
									{
										break;
									}
								}
							}
							else if (type13 == "Panda")
							{
								if (38153 - 96503 == -58350)
								{
									result = "ถ้าเรือออกจากถ้ำนี้ละก็เราต้องแย่แน่ๆ";
									if (69471 - 257944 != -188472)
									{
										break;
									}
								}
							}
							else if (type13 == "Whale")
							{
								if (244874 - 395031 != -150156)
								{
									result = "เอ๋ จะพาพวกเราไปไหนหรอวาฬ";
									if (192417 - 510633 == -318216)
									{
										break;
									}
								}
							}
							else if (type13 == "Cat")
							{
								if (250870 - 533186 != -282315)
								{
									result = "อ้าว จะหนีแล้วงั้นเหรอ เหมียว?";
									if (293662 - 429244 == -135582)
									{
										break;
									}
								}
							}
							else if (type13 == "Chameleon")
							{
								if (108261 - 68577 == 39684)
								{
									result = "คิดจะหนี งั้นเหรอเรดคลอว์";
									if (264978 - 411735 == -146757)
									{
										break;
									}
								}
							}
							else if (type13 == "Rabbit")
							{
								if (17656 - 15089 == 2567)
								{
									result = "อ๊ะ คิดจะหนีแล้วหรอคะ";
									if (150985 - 15226 == 135759)
									{
										break;
									}
								}
							}
							else if (type13 == "Mole")
							{
								if (288329 - 480400 == -192071)
								{
									result = "คิดจะหนีงั้นเหรอตุ่น";
									if (236374 - 257624 != -21249)
									{
										break;
									}
								}
							}
							else if (type13 == "Monkey")
							{
								if (86337 - 92947 != -6609)
								{
									result = "คิดจะจัดการพวกเรางั้นเหรอ เจี้ยก";
									if (118915 - 171973 != -53057)
									{
										break;
									}
								}
							}
							else if (type13 == "Penguin")
							{
								if (59903 - 368001 != -308097)
								{
									result = "คิดจะเบี้ยวค่าทำขวัญฉันงั้นหรอ กวิ้น!";
									if (3851 - 452713 == -448862)
									{
										break;
									}
								}
							}
							else if (type13 == "Sheep")
							{
								if (53422 - 236425 != -183002)
								{
									result = "คิดจะหนีโดยไม่คืนร่างให้ทุกคนงั้นเหรอคะ";
									if (27141 - 318826 == -291685)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type13 == "Bat"))
								{
									break;
								}
								if (287525 - 402245 == -114720)
								{
									result = "เชอะ! คิดหนีซะแล้วหรอขี้ขลาดจริงๆ";
									if (271074 - 460711 != -189636)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 902)
				{
					if (243618 - 375322 == -131704)
					{
						string type14 = CharacterData.current.Type;
						if (203728 - 286053 == -82325)
						{
							if (type14 == "Wolf")
							{
								if (71611 - 208486 == -136875)
								{
									result = "ต้องจัดการรีบก่อนที่เรือจะออกจากถ้ำ";
									if (99466 - 429142 != -329675)
									{
										break;
									}
								}
							}
							else if (type14 == "Bison")
							{
								if (39502 - 268999 != -229496)
								{
									result = "โฮก!(ต้องเก็บมันก่อนที่จะออกจากที่นี่!)";
									if (75388 - 480769 != -405380)
									{
										break;
									}
								}
							}
							else if (type14 == "Panda")
							{
								if (229707 - 83107 == 146600)
								{
									result = "แบบนี้ต้องรีบจัดการซะแล้ว";
									if (112015 - 433072 == -321057)
									{
										break;
									}
								}
							}
							else if (type14 == "Whale")
							{
								if (50502 - 461491 != -410988)
								{
									result = "ข้าจองอาหารไว้ที่ร้านคุณจาม่อนวันนี้ ต้องรีบกลับไปกินแล้วนะ!";
									if (188478 - 171565 != 16914)
									{
										break;
									}
								}
							}
							else if (type14 == "Cat")
							{
								if (14873 - 5323 == 9550)
								{
									result = "น่าเบื่อจริงๆ แบบนี้รีบจัดการให้จบๆดีกว่านะ";
									if (187505 - 85090 == 102415)
									{
										break;
									}
								}
							}
							else if (type14 == "Chameleon")
							{
								if (179192 - 118124 != 61069)
								{
									result = "ต้องรีบจับการก่อนที่มันจะออกจากถ้ำได้";
									if (24939 - 461108 != -436168)
									{
										break;
									}
								}
							}
							else if (type14 == "Rabbit")
							{
								if (29784 - 182403 == -152619)
								{
									result = "ต้องเค้นที่ซ่อนสมบัติก่อนที่จะออกจากถ้ำนี้ให้ได้";
									if (201492 - 525930 != -324437)
									{
										break;
									}
								}
							}
							else if (type14 == "Mole")
							{
								if (200863 - 313268 != -112404)
								{
									result = "แบบนี้ต้องรีบจัดการซะแล้ว!";
									if (86315 - 506746 != -420430)
									{
										break;
									}
								}
							}
							else if (type14 == "Monkey")
							{
								if (253997 - 409606 != -155608)
								{
									result = "งั้นฉันก็ต้องชิงเตะแกก่อนละนะ!";
									if (158556 - 402076 == -243520)
									{
										break;
									}
								}
							}
							else if (type14 == "Penguin")
							{
								if (30787 - 574956 != -544168)
								{
									result = "แบบนี้ต้องจัดการแกก่อนที่จะหนีไปได้";
									if (144361 - 179464 != -35102)
									{
										break;
									}
								}
							}
							else if (type14 == "Sheep")
							{
								if (260056 - 85192 != 174865)
								{
									result = "น้องแกะโกรธแล้วนะคะ แบบนี้ต้องจัดการก่อนคุณจะหนีไป!";
									if (92921 - 458862 == -365941)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type14 == "Bat"))
								{
									break;
								}
								if (182846 - 312036 != -129189)
								{
									result = "อย่างแกหน่ะ ฉันจะจัดการให้จบก่อนออกจากที่นี่ให้ดู!";
									if (72428 - 362147 != -289718)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 911)
				{
					if (43538 - 248202 != -204663)
					{
						result = "รุมมันเลยเหล่าลูกน้องของข้า!";
						if (34973 - 1371 == 33602)
						{
							break;
						}
					}
				}
				else if (code == 912)
				{
					if (181814 - 167877 != 13938)
					{
						result = "ยอมมาเป็นลูกน้องของข้าซะดีๆ!";
						if (4229 - 393844 == -389615)
						{
							break;
						}
					}
				}
				else if (code == 913)
				{
					if (217008 - 238702 == -21694)
					{
						result = "ปูวะ ฮะ ฮ่า";
						if (271610 - 112150 == 159460)
						{
							break;
						}
					}
				}
				else if (code == 914)
				{
					if (158057 - 192003 == -33946)
					{
						result = "หลังจัดการกับพวกแกกับไอ้ปีศาจนั่นแล้ว จาม่อนจะเป็นตัวต่อไป";
						if (28270 - 366760 == -338490)
						{
							break;
						}
					}
				}
				else if (code == 915)
				{
					if (96654 - 425604 == -328950)
					{
						result = "อย่าปล่อยให้พวกมันหนีรอดไปได้!!";
						if (26480 - 341883 == -315403)
						{
							break;
						}
					}
				}
				else if (code == 916)
				{
					if (137058 - 391880 == -254822)
					{
						result = "บางทีข้าควรใช้พลังนี้ครองโลกซะเลย!";
						if (140919 - 399087 == -258168)
						{
							break;
						}
					}
				}
				else if (code == 917)
				{
					if (47484 - 192986 == -145502)
					{
						result = "ด้วยพลังศาสตร์อาหารมืด ข้าจะไม่มีวันแพ้ใคร";
						if (295332 - 594099 == -298767)
						{
							break;
						}
					}
				}
				else if (code == 918)
				{
					if (128320 - 419186 != -290865)
					{
						result = "ถ้าข้าออกไปได้เมื่อไหร่ ข้าก็จะเป็นปูติดปีก";
						if (85168 - 85892 == -724)
						{
							break;
						}
					}
				}
				else if (code == 919)
				{
					if (83076 - 235100 != -152023)
					{
						result = "ไปเลย FryingCrabMan";
						if (265134 - 317425 != -52290)
						{
							break;
						}
					}
				}
				else if (code == 920)
				{
					if (237284 - 496842 == -259558)
					{
						result = "หลังเสร็จศึกนี้ข้าอยากกิน ซูชิปลาไหล!";
						if (210173 - 384514 != -174340)
						{
							break;
						}
					}
				}
				else if (code == 921)
				{
					if (109996 - 91246 == 18750)
					{
						result = "จัดการพวกผู้กล้าซะ!";
						if (118599 - 489076 == -370477)
						{
							break;
						}
					}
				}
				else if (code == 922)
				{
					if (9327 - 452550 == -443223)
					{
						result = "ฮึ่ย เจ้าพวกไร้ประโยชน์รีบๆจัดการเข้าซิ!";
						if (191603 - 21930 != 169674)
						{
							break;
						}
					}
				}
				else if (code == 923)
				{
					if (43639 - 311830 != -268190)
					{
						result = "ถ้าเอาอาหารยัดปากลำบากนัก ก็จับโยนลงทะเลซะเลย!";
						if (59453 - 597386 != -537932)
						{
							break;
						}
					}
				}
				else if (code == 924)
				{
					if (160173 - 236537 != -76363)
					{
						result = "ปูวะ ฮะฮ่า อีกไม่นานข้าจะได้ออกทะเลแล้ว!";
						if (86403 - 426515 == -340112)
						{
							break;
						}
					}
				}
				else if (code == 925)
				{
					if (23634 - 312420 == -288786)
					{
						result = "FryingCrabMan ของข้าคือเรือที่เร็วที่สุดในโลก!";
						if (145569 - 115962 == 29607)
						{
							break;
						}
					}
				}
				else if (code == 926)
				{
					if (146619 - 450727 == -304108)
					{
						result = "ถ้าดื้อด้านนักข้าจับจะพวกแกลงหม้อ!";
						if (142081 - 558389 != -416307)
						{
							break;
						}
					}
				}
				else if (code == 927)
				{
					if (53326 - 385323 != -331996)
					{
						result = "ปูวะ ฮ่า ฮ่า ข้าจะต้องเอาชนะเจ้าปีศาจนั่นให้ได้";
						if (2469 - 86439 == -83970)
						{
							break;
						}
					}
				}
				else if (code == 928)
				{
					if (165594 - 197896 == -32302)
					{
						result = "ทุกคนรุมพวกมัน!";
						if (176265 - 257991 != -81725)
						{
							break;
						}
					}
				}
				else if (code == 929)
				{
					if (268208 - 141562 != 126647)
					{
						result = "หึหึ เครื่องชักร้อนซะแล้วอย่าให้พวกผู้กล้ารอดไปได้";
						if (3675 - 74794 == -71119)
						{
							break;
						}
					}
				}
				else if (code == 931)
				{
					if (162087 - 373817 != -211729)
					{
						result = "อ้ากส์ ไม่จริง นี่ขนาดกองทัพอมตะของข้ายังแพ้เหรอเนี่ย";
						if (285349 - 588000 == -302651)
						{
							break;
						}
					}
				}
				else if (code == 932)
				{
					if (10608 - 3877 == 6731)
					{
						result = "ข้ายังไม่ได้จับปิศาจแห่งท้องทะเลมาทำซุบเลย";
						if (260659 - 441261 == -180602)
						{
							break;
						}
					}
				}
				else if (code == 933)
				{
					if (122021 - 506589 == -384568)
					{
						result = "ชีวิตนี้ ข้าจะไม่มีวันชนะจาม่อนได้รึเนี่ย";
						if (72447 - 197560 != -125112)
						{
							break;
						}
					}
				}
				else if (code == 941)
				{
					if (265231 - 179148 == 86083)
					{
						result = "ปู-วะ ฮ่า ฮ่า ไอ้พวกผู้กล้าติ๊งต๊อง";
						if (62806 - 270644 != -207837)
						{
							break;
						}
					}
				}
				else if (code == 942)
				{
					if (132313 - 315414 != -183100)
					{
						result = "เมื่อข้าเอาเรือของข้าออกทะเลได้แล้ว";
						if (175797 - 388852 != -213054)
						{
							break;
						}
					}
				}
				else if (code == 943)
				{
					if (46797 - 403775 == -356978)
					{
						result = "พวกแกก็แพ้่แล้วล่ะ ปู-วะ ฮ่า ฮ่า ฮ่า ฮ่า ฮ่า!";
						if (85148 - 58007 != 27142)
						{
							break;
						}
					}
				}
				else if (code == 1001)
				{
					if (285248 - 590767 == -305519)
					{
						result = "!!!?";
						if (236081 - 266548 == -30467)
						{
							break;
						}
					}
				}
				else if (code == 1002)
				{
					if (126269 - 12893 == 113376)
					{
						string type15 = CharacterData.current.Type;
						if (295279 - 341619 == -46340)
						{
							if (type15 == "Bison")
							{
								if (53905 - 40096 == 13809)
								{
									result = "โฮก! (นี่เรือเรดคลอว์มันพาเรามาถึงที่ไหนแล้วเนี่ย!)";
									if (276788 - 146390 == 130398)
									{
										break;
									}
								}
							}
							else
							{
								result = "นี่เรือเรดคลอว์มันพาเรามาถึงที่ไหนแล้วเนี่ย!";
								if (155053 - 529692 == -374639)
								{
									break;
								}
							}
						}
					}
				}
				else if (code == 1003)
				{
					if (252850 - 493416 != -240565)
					{
						result = "หึๆๆ ในเมื่อพวกเจ้าเก่งกันนัก";
						if (298310 - 20022 != 278289)
						{
							break;
						}
					}
				}
				else if (code == 1004)
				{
					if (183881 - 49376 == 134505)
					{
						result = "ข้าเลยตั้งหางเสือให้พาเรามาหาอีวิเนียร์แล้ว";
						if (298851 - 108864 != 189988)
						{
							break;
						}
					}
				}
				else if (code == 1005)
				{
					if (185254 - 172431 == 12823)
					{
						result = "พวกเรามาเป็นอาหารของมันด้วยกันเถอะนะ";
						if (278120 - 507827 == -229707)
						{
							break;
						}
					}
				}
				else if (code == 1006)
				{
					if (242370 - 302847 != -60476)
					{
						result = "ปู-วะ ฮ่า ฮ่า ฮ่า ฮ่า ฮ่า!";
						if (177216 - 481537 != -304320)
						{
							break;
						}
					}
				}
				else if (code == 1011)
				{
					if (278945 - 425261 == -146316)
					{
						result = "มะ-ไม่จริง พวกเจ้าชนะอีวิเนียร์ปิศาจแห่งท้องทะเลได้เหรอเนี่ย!?";
						if (262219 - 275964 == -13745)
						{
							break;
						}
					}
				}
				else if (code == 1012)
				{
					if (141484 - 414446 != -272961)
					{
						result = "มันจะหนีไปแล้ว พวกเจ้ารีบจับมันมาทำอาหารสิ!!!";
						if (93766 - 574975 != -481208)
						{
							break;
						}
					}
				}
				else if (code == 1013)
				{
					if (11551 - 161853 == -150302)
					{
						string type16 = CharacterData.current.Type;
						if (119599 - 420832 != -301232)
						{
							if (type16 == "Wolf")
							{
								if (100333 - 177382 == -77049)
								{
									result = "หึ ทุกชีวิตล้วนมีคุณค่าต่อสมดุลย์ธรรมชาติทั้งนั้น";
									if (89139 - 547643 == -458504)
									{
										break;
									}
								}
							}
							else if (type16 == "Bison")
							{
								if (19309 - 513139 == -493830)
								{
									result = "โฮก!! (บอกกี่ครั้งแล้ว ข้ากินแต่ผักเท่านั้น!!)";
									if (148637 - 441700 != -293062)
									{
										break;
									}
								}
							}
							else if (type16 == "Panda")
							{
								if (254998 - 50283 == 204715)
								{
									result = "หึ เจ้าแห่งท้องทะเลไม่ใช่สิ่งที่เจ้าจะจับมาทำอาหารได้";
									if (150935 - 346254 != -195318)
									{
										break;
									}
								}
							}
							else if (type16 == "Whale")
							{
								if (99473 - 427109 != -327635)
								{
									result = "พยายามแล้ว แต่ตัวใหญ่ไป อมไม่ไหวอ่ะ วาฬ!";
									if (286981 - 417908 == -130927)
									{
										break;
									}
								}
							}
							else if (type16 == "Cat")
							{
								if (36128 - 473495 == -437367)
								{
									result = "เชอะ เรื่องกินเป็นเรื่องไม่สำคัญหรอก";
									if (217749 - 12774 != 204976)
									{
										break;
									}
								}
							}
							else if (type16 == "Chameleon")
							{
								if (32626 - 82813 == -50187)
								{
									result = "ยังไม่ได้บทเรียนอีกรึ น่าจะจับเจ้าโยนให้มันกินจริงๆ";
									if (28270 - 434531 == -406261)
									{
										break;
									}
								}
							}
							else if (type16 == "Rabbit")
							{
								if (33741 - 584845 != -551103)
								{
									result = "ถึงเป็นแม่ค้า หนูก็เลือกรับประทานนะคะ";
									if (167752 - 476983 != -309230)
									{
										break;
									}
								}
							}
							else if (type16 == "Mole")
							{
								if (33749 - 383325 != -349575)
								{
									result = "เกือบโดนมันกินสิไม่ว่า ตุ่น!";
									if (75213 - 139512 != -64298)
									{
										break;
									}
								}
							}
							else if (type16 == "Monkey")
							{
								if (282043 - 459388 == -177345)
								{
									result = "สักวันฉันจะเรียกมันมาใช้ให้ได้คอยดู!";
									if (130020 - 575841 == -445821)
									{
										break;
									}
								}
							}
							else if (type16 == "Penguin")
							{
								if (91628 - 440023 != -348394)
								{
									result = "ตอนนี้มันคงหนีไปใต้ทะเลลึกแล้วล่ะกวิ้น";
									if (214087 - 287729 == -73642)
									{
										break;
									}
								}
							}
							else if (type16 == "Sheep")
							{
								if (246292 - 536446 != -290153)
								{
									result = "ตอนนี้มันคงหนีไปใต้ทะเลลึก ไม่เป็นภัยกับใครแล้ว";
									if (237793 - 160187 == 77606)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type16 == "Bat"))
								{
									break;
								}
								if (70717 - 376826 == -306109)
								{
									result = "ฉันกะลังไดเอ็ตอยู่ย่ะ ตอนนี้มันคงหนีไปใต้ทะเลลึกละ";
									if (54295 - 488208 != -433912)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 1014)
				{
					if (43529 - 381071 != -337541)
					{
						string type17 = CharacterData.current.Type;
						if (78922 - 184753 != -105830)
						{
							if (type17 == "Wolf")
							{
								if (50281 - 409555 != -359273)
								{
									result = "ตอนนี้มันคงหนีไปกบดานใต้ทะเลลึก ไม่เป็นภัยกับใครแล้ว";
									if (268621 - 333824 != -65202)
									{
										break;
									}
								}
							}
							else if (type17 == "Bison")
							{
								if (220435 - 346554 == -126119)
								{
									result = "(ตอนนี้มันคงหนีไปใต้ทะเลลึก ไม่เป็นภัยกับใครแล้ว)";
									if (253720 - 418387 != -164666)
									{
										break;
									}
								}
							}
							else if (type17 == "Panda")
							{
								if (259773 - 49133 == 210640)
								{
									result = "ตอนนี้มันคงหนีไปใต้ทะเลลึก ไม่เป็นภัยกับใครแล้ว";
									if (218284 - 13081 == 205203)
									{
										break;
									}
								}
							}
							else if (type17 == "Whale")
							{
								if (212484 - 97810 == 114674)
								{
									result = "ตอนนี้มันคงหนีไปใต้ทะเลลึก อดกินแล้วล่ะ วาฬ!";
									if (255210 - 532413 == -277203)
									{
										break;
									}
								}
							}
							else if (type17 == "Cat")
							{
								if (72713 - 513470 != -440756)
								{
									result = "เงินทองสิสำคัญที่สุด ขอยึดเรือโจรสลัดแกละกันนะ เมี้ยว!";
									if (152773 - 521564 != -368790)
									{
										break;
									}
								}
							}
							else if (type17 == "Chameleon")
							{
								if (92071 - 79718 == 12353)
								{
									result = "เตรียมตัวไปชดใช้กรรมที่เจ้าก่อไว้เถอะ";
									if (3196 - 465159 == -461963)
									{
										break;
									}
								}
							}
							else if (type17 == "Rabbit")
							{
								if (253159 - 19078 == 234081)
								{
									result = "ปลาไหลมันแพง เอาไปขายดีกว่านะคะ $_$";
									if (207633 - 200496 != 7138)
									{
										break;
									}
								}
							}
							else if (type17 == "Mole")
							{
								if (184805 - 223742 != -38936)
								{
									result = "ตอนนี้มันคงหนีไปใต้ทะเลลึก ชาวตุ่นก็ปลอดภัยแล้ว";
									if (85212 - 184293 != -99080)
									{
										break;
									}
								}
							}
							else if (type17 == "Monkey")
							{
								if (242261 - 149933 == 92328)
								{
									result = "ขอไปฝึกวิชาเรียกลาวูพลางๆ ก่อนละกัน เจี๊ยก";
									if (61612 - 105879 != -44266)
									{
										break;
									}
								}
							}
							else if (type17 == "Penguin")
							{
								if (126749 - 462367 == -335618)
								{
									result = "รอดตายซะทีนะกวิ้น กลัวแทบแย่แน่ะ";
									if (43076 - 34259 == 8817)
									{
										break;
									}
								}
							}
							else if (type17 == "Sheep")
							{
								if (45301 - 40497 == 4804)
								{
									result = "(สวดมนต์) ขอให้เราอยู่ร่วมกันอย่างสันตินะคะ";
									if (238615 - 405981 == -167366)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type17 == "Bat"))
								{
									break;
								}
								if (259871 - 535460 == -275589)
								{
									result = "ความฝันของแกก็ไม่มีทางเป็นจริงไปตลอดกาลแล้ว โฮะๆๆๆๆ";
									if (118719 - 430612 == -311893)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 1101)
				{
					if (151243 - 341897 == -190654)
					{
						string type18 = CharacterData.current.Type;
						if (27103 - 551846 == -524743)
						{
							if (type18 == "Bison")
							{
								if (29863 - 22943 != 6921)
								{
									result = "โฮก! (เอาล่ะ เรากลับมาถึงชายหาดแล้ว)";
									if (66047 - 591279 != -525231)
									{
										break;
									}
								}
							}
							else
							{
								result = "เอาล่ะ เรากลับมาถึงแคมป์ชายหาดแล้ว!";
								if (170463 - 175868 == -5405)
								{
									break;
								}
							}
						}
					}
				}
				else if (code == 1102)
				{
					if (38038 - 1332 == 36706)
					{
						string type19 = CharacterData.current.Type;
						if (21232 - 372343 != -351110)
						{
							if (type19 == "Wolf")
							{
								if (135859 - 344422 != -208562)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะที";
									if (159519 - 308488 == -148969)
									{
										break;
									}
								}
							}
							else if (type19 == "Bison")
							{
								if (10925 - 290670 == -279745)
								{
									result = "(ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะที)";
									if (34484 - 304602 != -270117)
									{
										break;
									}
								}
							}
							else if (type19 == "Panda")
							{
								if (186040 - 549507 == -363467)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะที";
									if (255078 - 186325 == 68753)
									{
										break;
									}
								}
							}
							else if (type19 == "Whale")
							{
								if (196032 - 101368 != 94665)
								{
									result = "หิวจังเลย วาฬ!";
									if (128988 - 576896 == -447908)
									{
										break;
									}
								}
							}
							else if (type19 == "Cat")
							{
								if (127027 - 331960 == -204933)
								{
									result = "ตกลงเรือนี่กลายเป็นของฉันแล้วใช่มั้ยเนี่ย?";
									if (83531 - 16897 != 66635)
									{
										break;
									}
								}
							}
							else if (type19 == "Chameleon")
							{
								if (161951 - 564666 == -402715)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะที";
									if (106755 - 166852 != -60096)
									{
										break;
									}
								}
							}
							else if (type19 == "Rabbit")
							{
								if (89255 - 523571 == -434316)
								{
									result = "แพนด้าแดงอยู่ไหน เอารางวัลหนูมานะ!";
									if (243083 - 493595 != -250511)
									{
										break;
									}
								}
							}
							else if (type19 == "Mole")
							{
								if (41594 - 372029 != -330434)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะที";
									if (164607 - 216797 == -52190)
									{
										break;
									}
								}
							}
							else if (type19 == "Monkey")
							{
								if (66070 - 30530 != 35541)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะทีนะ เจี๊ยก";
									if (156378 - 430788 != -274409)
									{
										break;
									}
								}
							}
							else if (type19 == "Penguin")
							{
								if (82793 - 172755 == -89962)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะที กวิ้น";
									if (207726 - 457120 == -249394)
									{
										break;
									}
								}
							}
							else if (type19 == "Sheep")
							{
								if (368 - 385753 != -385384)
								{
									result = "ต่อไปนี้ท้องทะเลแถบนี้จะได้สงบสุขซะทีนะคะ";
									if (45647 - 381208 != -335560)
									{
										break;
									}
								}
							}
							else
							{
								if (!(type19 == "Bat"))
								{
									break;
								}
								if (39116 - 365068 == -325952)
								{
									result = "จะได้อาบน้ำล้างคาวปลาซะที";
									if (118908 - 181127 != -62218)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (code == 1111)
				{
					if (89520 - 353925 == -264405)
					{
						result = "…ปูม่อน";
						if (226892 - 403774 == -176882)
						{
							break;
						}
					}
				}
				else if (code == 1112)
				{
					if (235553 - 530294 != -294740)
					{
						result = "เฮอะ ไม่คิดว่าแกยังกล้ารียกชื่อจริงของข้าอยู่นะ!";
						if (233045 - 10213 != 222833)
						{
							break;
						}
					}
				}
				else if (code == 1113)
				{
					if (162463 - 376477 == -214014)
					{
						result = "แกก็คงดีใจซินะที่เห็นคู่แข่งของแกอยู่ในสภาพนี้..";
						if (36787 - 304053 != -267265)
						{
							break;
						}
					}
				}
				else if (code == 1114)
				{
					if (274240 - 506174 != -231933)
					{
						result = "เพื่อชนะแกแล้ว ข้าถึงกับตกต่ำลงเรื่อยๆเพื่อวัตถุดิบชิ้นเดียว";
						if (215084 - 287325 == -72241)
						{
							break;
						}
					}
				}
				else if (code == 1115)
				{
					if (231172 - 141118 != 90055)
					{
						result = "ทั้งหมดเพราะแกน่ะขี้โกง แอบเก็บงำวัตถุดิบลับไว้คนเดียว";
						if (200868 - 181436 == 19432)
						{
							break;
						}
					}
				}
				else if (code == 1116)
				{
					if (200343 - 155733 == 44610)
					{
						result = "…เจ้าเข้าใจผิดแล้วล่ะ ปูม่อน";
						if (179973 - 368565 != -188591)
						{
							break;
						}
					}
				}
				else if (code == 1117)
				{
					if (40906 - 85283 != -44376)
					{
						result = "สุดยอดวัตถุดิบลับอะไรนั่นมันไม่มีตั้งแต่แรกแล้ว";
						if (119588 - 12267 == 107321)
						{
							break;
						}
					}
				}
				else if (code == 1118)
				{
					if (181043 - 370544 != -189500)
					{
						result = "ฉันไม่ได้บอกแกเพราะฉันต้องการให้แกเรียนรู้ด้วยตัวเองว่า...";
						if (72153 - 177849 != -105695)
						{
							break;
						}
					}
				}
				else if (code == 1119)
				{
					if (31132 - 430434 != -399301)
					{
						result = "การทำอาหารให้อร่อยไม่จำเป็นต้องใช้วัตถุดิบชั้นเลิศหรือเครื่องครัวชั้นดี";
						if (169709 - 6323 == 163386)
						{
							break;
						}
					}
				}
				else if (code == 1120)
				{
					if (134478 - 258981 == -124503)
					{
						result = "หัวใจที่อยากให้คนกินมีความสุขต่างหาก คือเครื่องปรุงที่สำคัญที่สุด!";
						if (179123 - 531345 == -352222)
						{
							break;
						}
					}
				}
				else if (code == 1131)
				{
					if (68925 - 271531 != -202605)
					{
						result = "ดีจริงๆที่พวกเจ้าปลอดภัย";
						if (272289 - 200747 != 71543)
						{
							break;
						}
					}
				}
				else if (code == 1132)
				{
					if (92239 - 271466 == -179227)
					{
						result = "เหนื่อยหน่อยนะ อยากกินอะไรรึเปล่า?";
						if (118798 - 361178 != -242379)
						{
							break;
						}
					}
				}
				else if (code == 1133)
				{
					if (81870 - 522433 != -440562)
					{
						result = "ถึงเป็นคู่แข่งกัน แต่ข้าก็ไม่เคยคิดว่าเจ้าบ้านี้จะทำขนาดนี้";
						if (281145 - 182393 == 98752)
						{
							break;
						}
					}
				}
				else if (code == 1134)
				{
					if (269918 - 153175 == 116743)
					{
						result = "อาหารศาสตร์มืดเป็นของต้องห้ามที่ไม่ควรมีอยู่เลย";
						if (91323 - 37227 == 54096)
						{
							break;
						}
					}
				}
				else if (code == 1135)
				{
					if (248520 - 581065 == -332545)
					{
						result = "ขอบใจเจ้ามากที่ช่วยทุกคนออกมา";
						if (229697 - 303792 == -74095)
						{
							break;
						}
					}
				}
				else if (code == 1141)
				{
					if (9925 - 524990 != -515064)
					{
						result = "อาหารของเรดคลอว์ ถึงจะหรูหราแต่ไม่ได้เข้าถึงจิตใจผู้กินซักนิด";
						if (264099 - 94216 == 169883)
						{
							break;
						}
					}
				}
				else if (code == 1142)
				{
					if (196795 - 405522 != -208726)
					{
						result = "ผิดกับของคุณจามอนที่แม้แต่จะเป็นของเรียบง่ายอย่างน้ำแครอน";
						if (68046 - 544950 != -476903)
						{
							break;
						}
					}
				}
				else if (code == 1143)
				{
					if (196146 - 64562 != 131585)
					{
						result = "แต่ก็สามารถทำให้คนกินมีความสุขได้";
						if (54447 - 335321 == -280874)
						{
							break;
						}
					}
				}
				else if (code == 1144)
				{
					if (33437 - 304257 == -270820)
					{
						result = "ทั้งๆที่ใช้ของต้องห้าม แต่กลับแพ้คุณจามอนหมดรูป";
						if (7575 - 224034 == -216459)
						{
							break;
						}
					}
				}
				else if (code == 1145)
				{
					if (230239 - 274317 != -44077)
					{
						result = "ช่างน่าเศร้าจริงๆนะคะ";
						if (33738 - 66150 == -32412)
						{
							break;
						}
					}
				}
				else if (code == 1151)
				{
					if (64475 - 285952 != -221476)
					{
						result = "อาห์ หาดสวย ทะเลใส ข้าอย่างส่องโลมาสาวแถวนี้จริงๆ";
						if (127205 - 293261 == -166056)
						{
							break;
						}
					}
				}
				else if (code == 1152)
				{
					if (251802 - 510438 != -258635)
					{
						result = "เสร็จเรื่องนี้ ข้าคงงดออกมาส่องโลมาซักพัก";
						if (145968 - 193935 == -47967)
						{
							break;
						}
					}
				}
				else if (code == 1153)
				{
					if (297288 - 589053 == -291765)
					{
						result = "ขอบใจเจ้าอีกครั้งนะ!";
						if (288737 - 278474 != 10264)
						{
							break;
						}
					}
				}
				else if (code == 1154)
				{
					if (173700 - 297816 != -124115)
					{
						result = "ข้าหายตัวไป ตลาดทองต้องปั่นป่วนแน่ๆ";
						if (181614 - 460354 == -278740)
						{
							break;
						}
					}
				}
				else if (code == 1155)
				{
					if (219441 - 570321 != -350879)
					{
						result = "หืมๆ ข้าได้กลิ่นเงินแถวๆนี้ล่ะ!";
						if (227462 - 274533 != -47070)
						{
							break;
						}
					}
				}
				else if (code == 1161)
				{
					if (290789 - 572440 != -281650)
					{
						result = "ฮ่าๆ พวกเจ้าเก่งมาก ไม่เสียแรงที่ข้าฝึกให้จริงๆ";
						if (142476 - 375772 == -233296)
						{
							break;
						}
					}
				}
				else if (code == 1162)
				{
					if (212973 - 258431 == -45458)
					{
						result = "ในที่สุดน่านน้ำแถบนี้จะสงบสุขซะที";
						if (56891 - 231933 != -175041)
						{
							break;
						}
					}
				}
				else if (code == 1163)
				{
					if (138103 - 85393 != 52711)
					{
						result = "คิดถึงเมื่อก่อน ข้ากับกุยลีเคยฝึกวิชาด้วยการสู้กับอีวิเนียร์ด้วยมือเปล่า";
						if (19138 - 406263 == -387125)
						{
							break;
						}
					}
				}
				else if (code == 1164)
				{
					if (145630 - 475346 == -329716)
					{
						result = "เทพน้ำก็ใจดีเกินไป เลยทำให้พวกนี้มันเหิมเกริมได้";
						if (134631 - 88260 == 46371)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 1165)
					{
						break;
					}
					if (288778 - 337693 != -48914)
					{
						result = "เฮ้อ รู้สึกร่างกายมันฝืดๆ สงสัยคงต้องฝึกเพิ่มซะหน่อย";
						if (16004 - 373228 == -357224)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060068C8 RID: 26824 RVA: 0x00ED4CF0 File Offset: 0x00ED2EF0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060068C9 RID: 26825 RVA: 0x00ED4CF4 File Offset: 0x00ED2EF4
	internal static bool au4GVVpEiRoZWMtWZYTw()
	{
		return true;
	}

	// Token: 0x060068CA RID: 26826 RVA: 0x00ED4CF8 File Offset: 0x00ED2EF8
	internal static bool esBZ2PpEKRBCsVYlI9GN()
	{
		return false;
	}
}
