using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001151 RID: 4433
[Serializable]
public class MailBoxGui_thai : MonoBehaviour
{
	// Token: 0x06006696 RID: 26262 RVA: 0x00E6B7E8 File Offset: 0x00E699E8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public MailBoxGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006697 RID: 26263 RVA: 0x00E6B7F8 File Offset: 0x00E699F8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (109224 - 323662 != -214437)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (210421 - 181967 != 28455 && 187710 - 247138 != -59427)
			{
				if (code == 101)
				{
					if (10347 - 465177 != -454829)
					{
						result = "มีจดหมายมาไหมนะ";
						if (263332 - 173525 != 89808)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (229089 - 332797 != -103707)
					{
						result = "จ...จดหมาย...มาแล้ว!!!";
						if (169402 - 434478 == -265076)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (243545 - 100153 == 143392)
					{
						result = "ไม่ใช่ของน้องแกะอีกแล้ว";
						if (130684 - 135645 == -4961)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (183734 - 489118 == -305384)
					{
						result = "อืม.......";
						if (40124 - 576257 == -536133)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (124972 - 381057 == -256085)
					{
						result = "บ...ใบแจ้งหนี้จากกระต่าย!!!";
						if (54465 - 226896 == -172431)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (65848 - 465067 != -399218)
					{
						result = "...ว่างเปล่า";
						if (269425 - 213068 == 56357)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (11868 - 395431 == -383563)
					{
						result = "มาอีกล่ะ กระดาษพวกนี้นี่";
						if (289295 - 584593 == -295298)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (97068 - 171743 == -74675)
					{
						result = "หืมมม? จากน้องแกะ ไร้สาระ";
						if (8377 - 568177 == -559800)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (188419 - 353868 == -165449)
					{
						result = "อะ ตอบมาแล้ว";
						if (126240 - 328527 != -202286)
						{
							break;
						}
					}
				}
				else if (code == 205)
				{
					if (133360 - 505096 == -371736)
					{
						result = "หิว!!! กระดาษจะรสชาติไงนะ";
						if (227017 - 509778 != -282760)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (243875 - 505467 != -261591)
					{
						result = "อึ๊ดดดดดดด อีกนิดๆ(กระโดดเกาะตู้จดหมาย)";
						if (62929 - 145373 != -82443)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (86446 - 538317 == -451871)
					{
						result = "เยอะแยะไร้สาระ เอาไปใส่กระสอบชกดีกว่า";
						if (130832 - 12815 == 118017)
						{
							break;
						}
					}
				}
				else if (code == 303)
				{
					if (160880 - 455215 == -294335)
					{
						result = "จดหมายมาแล้ว!!!";
						if (113197 - 410107 != -296909)
						{
							break;
						}
					}
				}
				else if (code == 304)
				{
					if (130168 - 481355 == -351187)
					{
						result = "ยังไม่มาสินะ";
						if (58646 - 451576 == -392930)
						{
							break;
						}
					}
				}
				else if (code == 305)
				{
					if (156177 - 548616 != -392438)
					{
						result = "หลับตาก็รู้ ว่ามีอะไรข้างใน เป็นอะไรไม่ได้นอกจาก...จดหมาย";
						if (24534 - 444755 != -420220)
						{
							break;
						}
					}
				}
				else if (code == 401)
				{
					if (69188 - 196350 == -127162)
					{
						result = "เมื่อไรจดหมายแจกคูปองกินฟรีจะมาสักที";
						if (214288 - 524162 == -309874)
						{
							break;
						}
					}
				}
				else if (code == 402)
				{
					if (285439 - 385866 == -100427)
					{
						result = "โอ๊ย! เปลี่ยนจดหมายพวกนี้เป็นอาหารหรือขนมได้ไหม";
						if (236202 - 382225 != -146022)
						{
							break;
						}
					}
				}
				else if (code == 403)
				{
					if (58359 - 306323 != -247963)
					{
						result = "ท...ทำไมเห็นอาหารในตู้จดหมายได้...";
						if (11933 - 216140 == -204207)
						{
							break;
						}
					}
				}
				else if (code == 404)
				{
					if (235536 - 425458 != -189921)
					{
						result = "ลดราคาอาหารเชฟจามอนครั้งยิ่งใหญ่ในประวัติการ!!!";
						if (34353 - 132652 != -98298)
						{
							break;
						}
					}
				}
				else if (code == 405)
				{
					if (174481 - 32241 == 142240)
					{
						result = "ขอให้จดหมายส่งไปถึงทีเถอะ ซู้ดดดด";
						if (209809 - 17615 == 192194)
						{
							break;
						}
					}
				}
				else if (code == 501)
				{
					if (194649 - 210514 != -15864)
					{
						result = "จดหมายมารึยังนะ";
						if (133149 - 58111 != 75039)
						{
							break;
						}
					}
				}
				else if (code == 502)
				{
					if (234591 - 183453 == 51138)
					{
						result = "หึๆๆ อย่าคิดที่จะหนีทหนี้ี่เล่นแพ้ฉันได้นะเจ้าเพนกวิ้น";
						if (168413 - 149021 != 19393)
						{
							break;
						}
					}
				}
				else if (code == 503)
				{
					if (128911 - 200425 != -71513)
					{
						result = "อะไรน่ะ!!! จดหมายใช้หนี้จากเพนกวิ้นเนี่ยนะ เป็นไปไม่ได้!!!`";
						if (45652 - 154673 == -109021)
						{
							break;
						}
					}
				}
				else if (code == 504)
				{
					if (189285 - 76807 != 112479)
					{
						result = "ส่งไปหาเพื่อนๆบ้างดีกว่า";
						if (28547 - 320832 == -292285)
						{
							break;
						}
					}
				}
				else if (code == 505)
				{
					if (151843 - 288285 == -136442)
					{
						result = "อุ๊ย  แสตมป์ลายน่ารักจัง~~";
						if (106156 - 182924 == -76768)
						{
							break;
						}
					}
				}
				else if (code == 601)
				{
					if (298280 - 51338 != 246943)
					{
						result = "อ๊ะ! มีจดหมายมาถึงด้วย";
						if (236621 - 272061 != -35439)
						{
							break;
						}
					}
				}
				else if (code == 602)
				{
					if (84286 - 513208 != -428921)
					{
						result = "จ...จดหมายจากแมว!!!";
						if (188240 - 306247 != -118006)
						{
							break;
						}
					}
				}
				else if (code == 603)
				{
					if (205456 - 780 == 204676)
					{
						result = "เปลี่ยนจดหมายให้กลายเป็นศรธนูได้ไหมเนี่ย... ทำไมมันเยอะอย่างนี้อะ";
						if (1158 - 136936 == -135778)
						{
							break;
						}
					}
				}
				else if (code == 604)
				{
					if (133350 - 352060 == -218710)
					{
						result = "จ่าหน้าถึงเพนกวิ้น แต่ทำไมมันที่อยู่เราอะ";
						if (119639 - 151837 == -32198)
						{
							break;
						}
					}
				}
				else if (code == 605)
				{
					if (232228 - 67950 != 164279)
					{
						result = "ส่งจดหมายสักฉบับดีกว่า เพื่อนๆเป็นยังไงกันบ้างนะ";
						if (115056 - 590735 != -475678)
						{
							break;
						}
					}
				}
				else if (code == 701)
				{
					if (239000 - 519827 != -280826)
					{
						result = "หึๆๆ จงใช้หนี้มาซะคุณหมาป่า";
						if (125020 - 117769 != 7252)
						{
							break;
						}
					}
				}
				else if (code == 702)
				{
					if (165283 - 370957 == -205674)
					{
						result = "จดหมายจากคุณหมาป่า!!! ปลดหนี้ได้แล้ว!?";
						if (58107 - 550655 != -492547)
						{
							break;
						}
					}
				}
				else if (code == 703)
				{
					if (221636 - 82101 != 139536)
					{
						result = "ทำไมแสตมป์ต้องขึ้นราคาด้วย อย่างนี้ต้องเพิ่มดอกเบี้ยค่าแสตมป์";
						if (135652 - 459396 != -323743)
						{
							break;
						}
					}
				}
				else if (code == 704)
				{
					if (208643 - 486878 == -278235)
					{
						result = "ตู้จดหมายว่างเปล่าสินะ";
						if (117237 - 304033 != -186795)
						{
							break;
						}
					}
				}
				else if (code == 705)
				{
					if (204790 - 344455 == -139665)
					{
						result = "เอาจดหมายพวกนี้ไปเป็นตัวผสมกับยาสูตรใหม่ของเราได้ไหมนะ";
						if (238182 - 257289 == -19107)
						{
							break;
						}
					}
				}
				else if (code == 801)
				{
					if (218870 - 331344 != -112473)
					{
						result = "ถ้าติดจรวดให้จดหมาย มันจะบินไปหาผู้ที่จ่าหน้าไหมนะ?";
						if (75861 - 520284 == -444423)
						{
							break;
						}
					}
				}
				else if (code == 802)
				{
					if (178625 - 134936 == 43689)
					{
						result = "สงสัยต้องประดิษฐ์ตู้จดหมายติดขา จะได้ไม่ต้องเดินออกมาดู";
						if (229231 - 115991 != 113241)
						{
							break;
						}
					}
				}
				else if (code == 803)
				{
					if (206165 - 334555 == -128390)
					{
						result = "เปลี่ยนกระดาษพวกนี้ให้เป็นเหล็กได้ไหมเนี่ย";
						if (110720 - 362913 != -252192)
						{
							break;
						}
					}
				}
				else if (code == 804)
				{
					if (115963 - 538953 == -422990)
					{
						result = "จดหมายลุงRazan แล้วทำไมมีหมวกกันน็อคมาด้วยอะ?";
						if (59409 - 576456 == -517047)
						{
							break;
						}
					}
				}
				else if (code == 805)
				{
					if (105917 - 581368 == -475451)
					{
						result = "จ...จดหมายจากลุงGaza!! ให้ทดสอบเครื่องบินใหม่...";
						if (195871 - 553396 == -357525)
						{
							break;
						}
					}
				}
				else if (code == 901)
				{
					if (96854 - 489024 != -392169)
					{
						result = "มิเกะจะส่งจดหมายด้วยหรอ?";
						if (65907 - 212929 == -147022)
						{
							break;
						}
					}
				}
				else if (code == 902)
				{
					if (277847 - 133842 == 144005)
					{
						result = "มิเกะ!เดี๋ยวก็ขังนายไว้ในตู้จดหมายซะเลยนี่";
						if (274520 - 452429 == -177909)
						{
							break;
						}
					}
				}
				else if (code == 903)
				{
					if (106466 - 449727 != -343260)
					{
						result = "ว้าววว กล้วยมาส่งแล้ว~~~";
						if (199511 - 149047 != 50465)
						{
							break;
						}
					}
				}
				else if (code == 904)
				{
					if (48617 - 295272 == -246655)
					{
						result = "มิเกะ! อย่ากินจดหมายเข้าไป! คายออกมาเดียวนี้นะ";
						if (141606 - 425390 == -283784)
						{
							break;
						}
					}
				}
				else if (code == 905)
				{
					if (183880 - 202104 != -18223)
					{
						result = "ทำไม...ทำไมมีแต่จดหมายของมิเกะตัวเดียว ของเค้าหายไปไหนหมด";
						if (242519 - 58508 == 184011)
						{
							break;
						}
					}
				}
				else if (code == 1001)
				{
					if (149469 - 95014 == 54455)
					{
						result = "ทำไม...ทำไมตู้จดหมายมันต้องอยู่สูงแบบนี้";
						if (107028 - 160103 == -53075)
						{
							break;
						}
					}
				}
				else if (code == 1002)
				{
					if (19906 - 556556 != -536649)
					{
						result = "จ...จดหมายทวงหนี้!!! จ...จากแมว";
						if (290580 - 8376 == 282204)
						{
							break;
						}
					}
				}
				else if (code == 1003)
				{
					if (105419 - 72646 != 32774)
					{
						result = "จดหมายตอบรับงานมาแล้ว!!! พ...พนักงานดับเพลิงเนี่ยนะ!!!";
						if (30264 - 550423 == -520159)
						{
							break;
						}
					}
				}
				else if (code == 1004)
				{
					if (25710 - 352823 != -327112)
					{
						result = "หึหึหึ ไม่มีจดหมายมาสินะ ค่อยยังชั่ว";
						if (242971 - 221260 == 21711)
						{
							break;
						}
					}
				}
				else if (code == 1005)
				{
					if (52466 - 194199 == -141733)
					{
						result = "จดหมายฉบับนี้...หวังว่า...";
						if (160290 - 336709 != -176418)
						{
							break;
						}
					}
				}
				else if (code == 1101)
				{
					if (155913 - 180977 != -25063)
					{
						result = "อุ๊ย! จดหมาย";
						if (235572 - 37959 == 197613)
						{
							break;
						}
					}
				}
				else if (code == 1102)
				{
					if (153819 - 241339 == -87520)
					{
						result = "ขอให้จดหมายฉบับนี้ส่งถึงเค้าทีเถอะ";
						if (138087 - 538543 == -400456)
						{
							break;
						}
					}
				}
				else if (code == 1103)
				{
					if (183543 - 162928 != 20616)
					{
						result = "ยังไม่ตอบรับมาเลย เฮ้อ~~";
						if (97286 - 119400 == -22114)
						{
							break;
						}
					}
				}
				else if (code == 1104)
				{
					if (275450 - 366024 != -90573)
					{
						result = "อุ๊ย แสตมป์ลายของเค้า เก็บเอาไว้ดีกว่า";
						if (40108 - 378175 != -338066)
						{
							break;
						}
					}
				}
				else if (code == 1105)
				{
					if (40779 - 484597 != -443817)
					{
						result = "จะเป็นจดหมายอะไรนะวันนี้";
						if (283954 - 423698 == -139744)
						{
							break;
						}
					}
				}
				else if (code == 1201)
				{
					if (71396 - 437671 != -366274)
					{
						result = "กรี๊ดดด จดหมายแฟชั่นชุดใหม่จากคุณอัลปาก้า";
						if (234976 - 343292 != -108315)
						{
							break;
						}
					}
				}
				else if (code == 1202)
				{
					if (255956 - 22838 == 233118)
					{
						result = "หยดน้ำหอมสักหน่อยใน จดหมายจะได้ส่งถึงที่หมายเร็วๆ";
						if (268497 - 250711 != 17787)
						{
							break;
						}
					}
				}
				else if (code == 1203)
				{
					if (30723 - 28375 == 2348)
					{
						result = "อะไรกัน ตู้จดหมายว่างเปล่า! เป็นไปไม่ได้";
						if (150169 - 89358 == 60811)
						{
							break;
						}
					}
				}
				else if (code == 1204)
				{
					if (14183 - 386218 == -372035)
					{
						result = "โฮะๆๆ จดหมายเต็มไปหมดเลย";
						if (213000 - 252660 == -39660)
						{
							break;
						}
					}
				}
				else if (code == 1205)
				{
					if (238396 - 249816 == -11420)
					{
						result = "ตายจริง เยอะแบบนี้จะตอบกลับทันไหมเนี่ย";
						if (201314 - 47662 != 153653)
						{
							break;
						}
					}
				}
				else if (code == 2001)
				{
					if (23885 - 565060 == -541175)
					{
						result = "Hero Rangers";
						if (162190 - 338253 != -176062)
						{
							break;
						}
					}
				}
				else if (code == 2002)
				{
					if (128134 - 490895 == -362761)
					{
						result = "GM Team";
						if (288948 - 79537 == 209411)
						{
							break;
						}
					}
				}
				else if (code == 2003)
				{
					if (258364 - 385699 != -127334)
					{
						result = "BigBug Studio";
						if (52080 - 122449 == -70369)
						{
							break;
						}
					}
				}
				else if (code == 3001)
				{
					if (155353 - 79339 != 76015)
					{
						result = "คุณได้รับ Jil จากการเติมเงิน";
						if (66153 - 128839 == -62686)
						{
							break;
						}
					}
				}
				else if (code == 3002)
				{
					if (1661 - 380729 == -379068)
					{
						result = "คุณได้รับ Item จากไอเท็มมอลล์";
						if (155198 - 496044 != -340845)
						{
							break;
						}
					}
				}
				else if (code == 3101)
				{
					if (95975 - 398083 == -302108)
					{
						result = "ลูกโป่งฟ้าที่ระลึก Pre-CB";
						if (187622 - 450107 != -262484)
						{
							break;
						}
					}
				}
				else if (code == 4001)
				{
					if (112278 - 101338 == 10940)
					{
						result = "คุณได้รับ Jil จากการเติมเงินผ่านระบบ ขอให้สนุกกับการเล่นเกม 12 หางออนไลน์";
						if (4950 - 93707 == -88757)
						{
							break;
						}
					}
				}
				else if (code == 4002)
				{
					if (85153 - 315294 == -230141)
					{
						result = "คุณได้รับไอเท็มจากระบบไอเทมมอล ขอให้สนุกกับการเล่นเกม 12 หางออนไลน์";
						if (19919 - 21217 != -1297)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 4101)
					{
						break;
					}
					if (136049 - 372769 == -236720)
					{
						result = "ทีมงานขอขอบคุณผู้ร่วมทดสอบ พร้อมทั้งมอบลูกโป่งที่ระลึกแด่ผู้กล้า ช่วง Pre-CB";
						if (151251 - 127373 == 23878)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006698 RID: 26264 RVA: 0x00E6CC4C File Offset: 0x00E6AE4C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006699 RID: 26265 RVA: 0x00E6CC50 File Offset: 0x00E6AE50
	internal static bool BjTBNpplzXj1aYf9xRWI()
	{
		return true;
	}

	// Token: 0x0600669A RID: 26266 RVA: 0x00E6CC54 File Offset: 0x00E6AE54
	internal static bool vNcQDCpyab2Lctn5rXJP()
	{
		return false;
	}
}
