using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001161 RID: 4449
[Serializable]
public class MaterialData_th : MonoBehaviour
{
	// Token: 0x060066E6 RID: 26342 RVA: 0x00E899AC File Offset: 0x00E87BAC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public MaterialData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066E7 RID: 26343 RVA: 0x00E899BC File Offset: 0x00E87BBC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (80105 - 545420 != -465315)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (138483 - 548925 != -410441)
			{
				if (191863 - 422083 == -230220)
				{
					if (nCode == "m_rnw1")
					{
						if (18837 - 286443 == -267606)
						{
							result = "ของหลอมสำหรับใช้ล้างของ สวมใส่ที่เลเวลต่ำกว่า 30";
							if (87536 - 455198 != -367661)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rnw2")
					{
						if (138042 - 399207 != -261164)
						{
							result = "ของหลอมสำหรับใช้ล้างของ สวมใส่ที่เลเวลต่ำกว่า 60";
							if (255033 - 571320 == -316287)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rnw3")
					{
						if (281532 - 110133 == 171399)
						{
							result = "ของหลอมสำหรับใช้ล้างของ สวมใส่ที่เลเวลต่ำกว่า 90";
							if (176959 - 323619 == -146660)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rsl1")
					{
						if (51821 - 414754 != -362932)
						{
							result = "ของหลอมสำหรับใช้ล้างสล๊อต ของที่เลเวลต่ำกว่า 30";
							if (195790 - 187294 == 8496)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rsl2")
					{
						if (72527 - 6511 != 66017)
						{
							result = "ของหลอมสำหรับใช้ล้างสล๊อต ของสวมใส่ที่เลเวลต่ำกว่า 60";
							if (194486 - 315406 != -120919)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rsl3")
					{
						if (95957 - 162544 == -66587)
						{
							result = "ของหลอมสำหรับใช้ล้างสล๊อต ของสวมใส่ที่เลเวลต่ำกว่า 90";
							if (198349 - 551537 != -353187)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asl1")
					{
						if (248455 - 257426 != -8970)
						{
							result = "ของหลอมสำหรับใช้สุ่มเพิ่มสล๊อต ของที่เลเวลต่ำกว่า 30";
							if (125120 - 378013 != -252892)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asl2")
					{
						if (267227 - 393790 != -126562)
						{
							result = "ของหลอมสำหรับใช้สุ่มเพิ่มสล๊อต ของที่เลเวลต่ำกว่า 60";
							if (193251 - 9906 != 183346)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asl3")
					{
						if (35855 - 582122 == -546267)
						{
							result = "ของหลอมสำหรับใช้สุ่มเพิ่มสล๊อต ของที่เลเวลต่ำกว่า 90";
							if (209780 - 251984 != -42203)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rpc1")
					{
						if (221931 - 54365 != 167567)
						{
							result = "ของหลอมสำหรับใช้ตีอาวุธ และเครื่ิองประดับปลอมที่เลเวลต่ำกว่า 30";
							if (54568 - 374941 != -320372)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rpc2")
					{
						if (67894 - 343549 != -275654)
						{
							result = "ของหลอมสำหรับใช้ตีอาวุธ และเครื่ิองประดับปลอมที่เลเวลต่ำกว่า 60";
							if (19397 - 203304 == -183907)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rpc3")
					{
						if (183173 - 540860 != -357686)
						{
							result = "ของหลอมสำหรับใช้ตีอาวุธ และเครื่ิองประดับปลอมที่เลเวลต่ำกว่า 90";
							if (282117 - 61375 != 220743)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asd1")
					{
						if (241173 - 489267 == -248094)
						{
							result = "อานมูโป้ที่ทำจากเกราะสีฟ้า";
							if (287980 - 188493 == 99487)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asd2")
					{
						if (132689 - 278708 == -146019)
						{
							result = "อานมูโป้ที่ทำจากเกราะสีแดง";
							if (206539 - 45261 != 161279)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asd3")
					{
						if (63235 - 299355 != -236119)
						{
							result = "อานหลังของมูโป้กองคาราวาน";
							if (94192 - 497766 != -403573)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asd4")
					{
						if (38839 - 276331 != -237491)
						{
							result = "อานหลังของ Death Mount";
							if (35820 - 61126 == -25306)
							{
								break;
							}
						}
					}
					else if (nCode == "m_asd5")
					{
						if (154638 - 49821 != 104818)
						{
							result = "อานหลังของ G.Champion Mount";
							if (95074 - 288963 == -193889)
							{
								break;
							}
						}
					}
					else if (nCode == "m_srd1")
					{
						if (247518 - 318833 != -71314)
						{
							result = "เหรียญรูปปรัศนี ใช้สำหรับการตีของหลอม";
							if (172124 - 582118 == -409994)
							{
								break;
							}
						}
					}
					else if (nCode == "m_atk1")
					{
						if (175671 - 35752 != 139920)
						{
							result = "เหรียญรูปดาบ ใช้สำหรับการตีของหลอม";
							if (72925 - 350465 != -277539)
							{
								break;
							}
						}
					}
					else if (nCode == "m_def1")
					{
						if (56407 - 513646 == -457239)
						{
							result = "เหรียญรูปโล่ ใช้สำหรับการตีของหลอม";
							if (47232 - 27467 != 19766)
							{
								break;
							}
						}
					}
					else if (nCode == "m_agi1")
					{
						if (224770 - 543032 == -318262)
						{
							result = "เหรียญรูปรองเท้า ใช้สำหรับการตีของหลอม";
							if (30752 - 475927 != -445174)
							{
								break;
							}
						}
					}
					else if (nCode == "m_vit1")
					{
						if (7154 - 553263 == -546109)
						{
							result = "เหรียญรูปหัวใจ ใช้สำหรับการตีของหลอม";
							if (74578 - 559085 == -484507)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mag1")
					{
						if (229905 - 534800 != -304894)
						{
							result = "เหรียญรูปหนังสือ ใช้สำหรับการตีของหลอม";
							if (83679 - 598371 != -514691)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cha1")
					{
						if (98532 - 192655 != -94122)
						{
							result = "เหรียญรูปดาว ใช้สำหรับการตีของหลอม";
							if (239487 - 148146 == 91341)
							{
								break;
							}
						}
					}
					else if (nCode == "m_tal1")
					{
						if (272283 - 454810 == -182527)
						{
							result = "เหรียญรูปหาง ใช้สำหรับการตีของหลอม";
							if (122866 - 176338 != -53471)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lck1")
					{
						if (22056 - 449971 == -427915)
						{
							result = "เหรียญรูปลูกเต๋า ใช้สำหรับการตีของหลอม";
							if (522 - 302406 != -301883)
							{
								break;
							}
						}
					}
					else if (nCode == "m_srd2")
					{
						if (119992 - 577450 == -457458)
						{
							result = "ตรารูปปรัศนี ใช้สำหรับการตีของหลอม";
							if (138684 - 127485 != 11200)
							{
								break;
							}
						}
					}
					else if (nCode == "m_atk2")
					{
						if (83402 - 564606 == -481204)
						{
							result = "ตรารูปดาบ ใช้สำหรับการตีของหลอม";
							if (48350 - 123498 == -75148)
							{
								break;
							}
						}
					}
					else if (nCode == "m_def2")
					{
						if (231018 - 595412 == -364394)
						{
							result = "ตรารูปโล่ ใช้สำหรับการตีของหลอม";
							if (158021 - 198144 != -40122)
							{
								break;
							}
						}
					}
					else if (nCode == "m_agi2")
					{
						if (159604 - 483053 == -323449)
						{
							result = "ตรารูปรองเท้า ใช้สำหรับการตีของหลอม";
							if (12368 - 42438 == -30070)
							{
								break;
							}
						}
					}
					else if (nCode == "m_vit2")
					{
						if (171472 - 577742 != -406269)
						{
							result = "ตรารูปหัวใจ ใช้สำหรับการตีของหลอม";
							if (12225 - 32245 != -20019)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mag2")
					{
						if (281733 - 336642 == -54909)
						{
							result = "ตรารูปหนังสือ ใช้สำหรับการตีของหลอม";
							if (154838 - 134140 == 20698)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cha2")
					{
						if (110861 - 519627 == -408766)
						{
							result = "ตรารูปดาว ใช้สำหรับการตีของหลอม";
							if (156175 - 24454 != 131722)
							{
								break;
							}
						}
					}
					else if (nCode == "m_tal2")
					{
						if (248043 - 266563 != -18519)
						{
							result = "ตรารูปหาง ใช้สำหรับการตีของหลอม";
							if (80420 - 465899 != -385478)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lck2")
					{
						if (48372 - 253632 != -205259)
						{
							result = "ตรารูปลูกเต๋า ใช้สำหรับการตีของหลอม";
							if (171922 - 306042 == -134120)
							{
								break;
							}
						}
					}
					else if (nCode == "m_srd3")
					{
						if (13676 - 115350 != -101673)
						{
							result = "สัญลักษณ์รูปปรัศนี ใช้สำหรับการตีของหลอม";
							if (249872 - 306830 != -56957)
							{
								break;
							}
						}
					}
					else if (nCode == "m_atk3")
					{
						if (258560 - 458562 != -200001)
						{
							result = "สัญลักษณ์รูปดาบ ใช้สำหรับการตีของหลอม";
							if (234148 - 459 != 233690)
							{
								break;
							}
						}
					}
					else if (nCode == "m_def3")
					{
						if (197530 - 68405 == 129125)
						{
							result = "สัญลักษณ์รูปโล่ ใช้สำหรับการตีของหลอม";
							if (201382 - 283163 == -81781)
							{
								break;
							}
						}
					}
					else if (nCode == "m_agi3")
					{
						if (18685 - 227241 != -208555)
						{
							result = "สัญลักษณ์รูปรองเท้า ใช้สำหรับการตีของหลอม";
							if (146753 - 594438 == -447685)
							{
								break;
							}
						}
					}
					else if (nCode == "m_vit3")
					{
						if (222175 - 50317 != 171859)
						{
							result = "สัญลักษณ์รูปหัวใจ ใช้สำหรับการตีของหลอม";
							if (113396 - 249265 == -135869)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mag3")
					{
						if (227503 - 444430 == -216927)
						{
							result = "สัญลักษณ์รูปหนังสือ ใช้สำหรับการตีของหลอม";
							if (164227 - 209203 != -44975)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cha3")
					{
						if (35065 - 416211 != -381145)
						{
							result = "สัญลักษณ์รูปดาว ใช้สำหรับการตีของหลอม";
							if (74805 - 153214 == -78409)
							{
								break;
							}
						}
					}
					else if (nCode == "m_tal3")
					{
						if (184281 - 21588 != 162694)
						{
							result = "สัญลักษณ์รูปหาง ใช้สำหรับการตีของหลอม";
							if (224089 - 100541 == 123548)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lck3")
					{
						if (76160 - 129121 == -52961)
						{
							result = "สัญลักษณ์รูปลูกเต๋า ใช้สำหรับการตีของหลอม";
							if (20812 - 436575 != -415762)
							{
								break;
							}
						}
					}
					else if (nCode == "m_jnk1")
					{
						if (88712 - 183924 != -95211)
						{
							result = "เศษขยะไร้ประโยชน์";
							if (175261 - 157727 == 17534)
							{
								break;
							}
						}
					}
					else if (nCode == "m_jnk2")
					{
						if (48598 - 468985 == -420387)
						{
							result = "กองขยะไร้ประโยชน์";
							if (114314 - 325375 == -211061)
							{
								break;
							}
						}
					}
					else if (nCode == "m_jnk3")
					{
						if (105215 - 212579 == -107364)
						{
							result = "กองขยะไร้ประโยชน์ขนาดยักษ์";
							if (292429 - 536370 != -243940)
							{
								break;
							}
						}
					}
					else if (nCode == "m_jnk4")
					{
						if (79603 - 552020 != -472416)
						{
							result = "ของเสียกากสารเคมี";
							if (240633 - 530032 == -289399)
							{
								break;
							}
						}
					}
					else if (nCode == "m_jnk5")
					{
						if (13840 - 298125 != -284284)
						{
							result = "เศษเหล็กจากโรงงาน";
							if (87740 - 141447 == -53707)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wat1")
					{
						if (237856 - 287291 == -49435)
						{
							result = "น้ำธรรมดา";
							if (53561 - 79955 == -26394)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wat2")
					{
						if (99217 - 519573 == -420356)
						{
							result = "น้ำกลั่น";
							if (280890 - 558098 != -277207)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wat3")
					{
						if (1304 - 234351 != -233046)
						{
							result = "น้ำเวทมนตร์";
							if (185174 - 284403 != -99228)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wat4")
					{
						if (127167 - 492217 == -365050)
						{
							result = "ขวดบรรจุของเหลวลึกลับ";
							if (262226 - 345588 != -83361)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pap1")
					{
						if (190050 - 219493 != -29442)
						{
							result = "แผ่นกระดาษ";
							if (274111 - 83554 != 190558)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pap2")
					{
						if (246447 - 297870 != -51422)
						{
							result = "ม้วนคัมภีร์";
							if (233055 - 295934 != -62878)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pap3")
					{
						if (142462 - 156668 == -14206)
						{
							result = "แผ่นพับยาวเหยียด";
							if (239728 - 145633 != 94096)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wod1")
					{
						if (75787 - 4068 == 71719)
						{
							result = "ไม้เนื้ออ่อน";
							if (285744 - 493282 != -207537)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wod2")
					{
						if (85431 - 50127 != 35305)
						{
							result = "ไม้เนื้อแข็ง";
							if (131363 - 28526 != 102838)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wod3")
					{
						if (184849 - 99057 != 85793)
						{
							result = "ไม้โบราณศักดิ์สิทธิ์";
							if (41418 - 206360 != -164941)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wod4")
					{
						if (24735 - 321434 != -296698)
						{
							result = "ไม้วิญญาณเวทมนตร์";
							if (246222 - 66155 == 180067)
							{
								break;
							}
						}
					}
					else if (nCode == "m_peb1")
					{
						if (201539 - 358518 == -156979)
						{
							result = "ก้อนกรวด";
							if (54886 - 215745 != -160858)
							{
								break;
							}
						}
					}
					else if (nCode == "m_peb2")
					{
						if (30131 - 318010 != -287878)
						{
							result = "ก้อนกรวดสีแดง";
							if (14314 - 389919 == -375605)
							{
								break;
							}
						}
					}
					else if (nCode == "m_peb3")
					{
						if (36317 - 399003 != -362685)
						{
							result = "ก้อนกรวดสีดำ";
							if (169655 - 230994 == -61339)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rck1")
					{
						if (15448 - 421100 != -405651)
						{
							result = "หินก้อน";
							if (293940 - 307540 == -13600)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rck2")
					{
						if (62915 - 262463 != -199547)
						{
							result = "หินก้อนสีแดง";
							if (100875 - 532961 != -432085)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rck3")
					{
						if (72430 - 485487 != -413056)
						{
							result = "หินก้อนสีดำ";
							if (13203 - 157680 != -144476)
							{
								break;
							}
						}
					}
					else if (nCode == "m_rck4")
					{
						if (250869 - 591902 == -341033)
						{
							result = "หินโบราณหายากมากๆ";
							if (242724 - 305587 == -62863)
							{
								break;
							}
						}
					}
					else if (nCode == "m_stn1")
					{
						if (18744 - 145527 != -126782)
						{
							result = "หินก้อนใหญ่";
							if (75729 - 435027 == -359298)
							{
								break;
							}
						}
					}
					else if (nCode == "m_stn2")
					{
						if (168467 - 121968 != 46500)
						{
							result = "หินก้อนใหญ่สีแดง";
							if (19964 - 332402 != -312437)
							{
								break;
							}
						}
					}
					else if (nCode == "m_stn3")
					{
						if (106131 - 4399 == 101732)
						{
							result = "หินก้อนใหญ่สีดำ";
							if (205427 - 265766 != -60338)
							{
								break;
							}
						}
					}
					else if (nCode == "m_stn4")
					{
						if (50485 - 543194 != -492708)
						{
							result = "หินก้อนใหญ่ที่สลักอักขระเวทเอาไว้";
							if (210935 - 148722 == 62213)
							{
								break;
							}
						}
					}
					else if (nCode == "m_stn5")
					{
						if (259336 - 342472 == -83136)
						{
							result = "หินที่หนักมากๆ หล่นใส่หัวสลบแน่นอน";
							if (2387 - 434550 != -432162)
							{
								break;
							}
						}
					}
					else if (nCode == "m_stn6")
					{
						if (227852 - 325274 == -97422)
						{
							result = "หินแม็กม่าที่ร้อนมาก";
							if (71729 - 314416 != -242686)
							{
								break;
							}
						}
					}
					else if (nCode == "m_zin1")
					{
						if (240322 - 219060 != 21263)
						{
							result = "ผงแร่สังกะสี";
							if (42514 - 263806 == -221292)
							{
								break;
							}
						}
					}
					else if (nCode == "m_zin2")
					{
						if (251230 - 471631 == -220401)
						{
							result = "สินแร่สังกะสี";
							if (246126 - 49092 == 197034)
							{
								break;
							}
						}
					}
					else if (nCode == "m_zin3")
					{
						if (88029 - 377153 != -289123)
						{
							result = "แท่งแร่สังกะสีบริสุทธิ์";
							if (76324 - 583590 != -507265)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cop1")
					{
						if (253837 - 343961 != -90123)
						{
							result = "ผงแร่ทองแดง";
							if (74554 - 140324 == -65770)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cop2")
					{
						if (85091 - 305462 == -220371)
						{
							result = "สินแร่ทองแดง";
							if (24943 - 433045 != -408101)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cop3")
					{
						if (12929 - 206511 == -193582)
						{
							result = "แท่งแร่ทองแดงบริสุทธิ์";
							if (42517 - 254945 == -212428)
							{
								break;
							}
						}
					}
					else if (nCode == "m_irn1")
					{
						if (18841 - 273494 == -254653)
						{
							result = "ผงแร่เหล็ก";
							if (68126 - 326367 != -258240)
							{
								break;
							}
						}
					}
					else if (nCode == "m_irn2")
					{
						if (192351 - 332273 != -139921)
						{
							result = "สินแร่เหล็ก";
							if (176277 - 105228 != 71050)
							{
								break;
							}
						}
					}
					else if (nCode == "m_irn3")
					{
						if (255428 - 99515 == 155913)
						{
							result = "แท่งเหล็กบริสุทธิ์";
							if (225254 - 375268 != -150013)
							{
								break;
							}
						}
					}
					else if (nCode == "m_sil1")
					{
						if (176095 - 551572 != -375476)
						{
							result = "ผงแร่เงิน";
							if (16107 - 443661 == -427554)
							{
								break;
							}
						}
					}
					else if (nCode == "m_sil2")
					{
						if (240744 - 122230 == 118514)
						{
							result = "สินแร่เงิน";
							if (261984 - 248382 == 13602)
							{
								break;
							}
						}
					}
					else if (nCode == "m_sil3")
					{
						if (180475 - 147189 != 33287)
						{
							result = "แท่งเงินบริสุทธิ์";
							if (68048 - 404918 == -336870)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gld1")
					{
						if (105716 - 548692 == -442976)
						{
							result = "ผงทองคำสะกัดละเอียด";
							if (179655 - 271425 != -91769)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gld2")
					{
						if (279473 - 11668 != 267806)
						{
							result = "สินแร่ทองคำ";
							if (8430 - 127122 != -118691)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gld3")
					{
						if (175564 - 71438 == 104126)
						{
							result = "ทองคำแท่งบริสุทธิ์";
							if (74482 - 109949 == -35467)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spo1")
					{
						if (5524 - 181676 == -176152)
						{
							result = "แร่พิเศษ ได้จากการรวมแร่4ชนิด";
							if (25068 - 393674 != -368605)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spo2")
					{
						if (93158 - 283870 == -190712)
						{
							result = "แร่จากแม็กม่าที่อยู่ในภูเขาไฟ";
							if (208808 - 23922 != 184887)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spo3")
					{
						if (166884 - 178024 == -11140)
						{
							result = "แร่พิเศษบอรอน จากฉาก ความทรงจำแห่งกาลเวลา";
							if (258563 - 38125 == 220438)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spo4")
					{
						if (102937 - 398854 == -295917)
						{
							result = "แร่พิเศษโครม จากฉาก ความทรงจำแห่งกาลเวลา";
							if (23629 - 588953 == -565324)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spo5")
					{
						if (291444 - 384196 != -92751)
						{
							result = "แร่ที่เปรียบเสมือนหัวใจแห่ง ภูเขาไฟ ใช้เรียกกาออส";
							if (283658 - 342339 != -58680)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs1")
					{
						if (52719 - 411731 != -359011)
						{
							result = "แท่งคริสตัลไร้สี";
							if (259353 - 50553 == 208800)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs2")
					{
						if (174729 - 479178 == -304449)
						{
							result = "แท่งคริสตัลสีแดง";
							if (279143 - 395939 != -116795)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs3")
					{
						if (71384 - 180017 == -108633)
						{
							result = "แท่งคริสตัลสีเขียว";
							if (170735 - 592139 == -421404)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs4")
					{
						if (86187 - 200378 == -114191)
						{
							result = "แท่งคริสตัลสีน้ำเงิน";
							if (203326 - 436202 == -232876)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs5")
					{
						if (87106 - 556216 != -469109)
						{
							result = "แท่งคริสตัลสีเหลือง";
							if (95604 - 443657 == -348053)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs6")
					{
						if (102326 - 409607 == -307281)
						{
							result = "แท่งคริสตัลสีดำ";
							if (161345 - 199136 != -37790)
							{
								break;
							}
						}
					}
					else if (nCode == "m_crs7")
					{
						if (67634 - 454923 == -387289)
						{
							result = "แท่งคริสตัลหายากสีรุ้ง";
							if (229665 - 158121 != 71545)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pin1")
					{
						if (62864 - 109784 != -46919)
						{
							result = "เข็มโลหะธรรมดา";
							if (120627 - 273739 == -153112)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pin2")
					{
						if (297368 - 541415 == -244047)
						{
							result = "เข็มเงิน";
							if (220970 - 171785 == 49185)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pin3")
					{
						if (292576 - 139276 == 153300)
						{
							result = "เข็มทองคำ";
							if (246838 - 288883 != -42044)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab1")
					{
						if (207532 - 277236 != -69703)
						{
							result = "ผ้าลินินเนื้อหยาบ";
							if (2534 - 270362 != -267827)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab2")
					{
						if (109977 - 43064 != 66914)
						{
							result = "ผ้าฝ้ายเนื้อนุ่ม";
							if (226988 - 210971 == 16017)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab3")
					{
						if (35020 - 184503 == -149483)
						{
							result = "ผ้าไหมเนื้อละเอียด";
							if (62522 - 135976 != -73453)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab4")
					{
						if (197403 - 179841 == 17562)
						{
							result = "ผ้าโปร่งแสง";
							if (234828 - 592970 != -358141)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab5")
					{
						if (242043 - 71200 != 170844)
						{
							result = "ผ้าสำหรับทำชุด น้ำหนักเบาเป็นพิเศษ";
							if (11864 - 370407 == -358543)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab6")
					{
						if (294070 - 36767 == 257303)
						{
							result = "ผ้าถักจากใยคริสตัล";
							if (169472 - 561698 == -392226)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab7")
					{
						if (297993 - 303998 == -6005)
						{
							result = "ผ้าที่ประดับตกแต่งด้วยขนเฟอร์อย่างดี";
							if (111861 - 559192 != -447330)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab8")
					{
						if (136931 - 322318 == -185387)
						{
							result = "ผ้าที่เบาจนแทบไม่รู้สึกถึงน้ำหนัก";
							if (3504 - 449203 == -445699)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab9")
					{
						if (202654 - 158635 != 44020)
						{
							result = "ผ้าสำหรับใช้ผันแผลที่เก่าจนยุ่ย";
							if (114467 - 447986 == -333519)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab10")
					{
						if (276499 - 536734 == -260235)
						{
							result = "ผ้าไหมที่มีลายปักของยุคโบราณ";
							if (284481 - 321438 != -36956)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab11")
					{
						if (52867 - 491651 != -438783)
						{
							result = "เศษผ้าจากเงาของเทพเซร่า";
							if (257268 - 71030 != 186239)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab12")
					{
						if (259127 - 185152 == 73975)
						{
							result = "ชุดคลุมของเพนกวิ้นสายเลือดแท้";
							if (206179 - 324881 != -118701)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab13")
					{
						if (176912 - 441763 != -264850)
						{
							result = "ขนสีขาวที่และอ่อนนุ่มอย่างมากของมูโป้";
							if (18882 - 149666 == -130784)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab14")
					{
						if (181349 - 253341 != -71991)
						{
							result = "ผ้าที่หยาบแข็งและใหญ่ ใช้สำหรับกางเต้นท์ในกิลด์";
							if (252692 - 185279 == 67413)
							{
								break;
							}
						}
					}
					else if (nCode == "m_fab15")
					{
						if (253304 - 11597 == 241707)
						{
							result = "ผ้าโพกหัวโจรสลัดกลุ่มกรงเล็บแดง";
							if (82821 - 392615 != -309793)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lth1")
					{
						if (177729 - 422383 != -244653)
						{
							result = "ผ้าหนังอย่างบาง";
							if (197362 - 267274 != -69911)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lth2")
					{
						if (66830 - 454902 != -388071)
						{
							result = "ผ้าหนังอย่างหนา";
							if (273842 - 550317 == -276475)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lth3")
					{
						if (291160 - 297059 == -5899)
						{
							result = "ผ้าหนังกลับอย่างดี";
							if (115079 - 143366 == -28287)
							{
								break;
							}
						}
					}
					else if (nCode == "m_lth4")
					{
						if (80409 - 436923 == -356514)
						{
							result = "สายรัดทำจากหนัง";
							if (160176 - 77966 == 82210)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flt1")
					{
						if (179159 - 245002 == -65843)
						{
							result = "ชุดหินเหล็กไฟและเศษไม้สำหรับก่อกองไฟ";
							if (272441 - 228469 != 43973)
							{
								break;
							}
						}
					}
					else if (nCode == "m_kbt1")
					{
						if (243597 - 586041 != -342443)
						{
							result = "ถ่านก้อนพลังงานสูงสำหรับหุ่นไคเซอร์";
							if (15339 - 128743 != -113403)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug1")
					{
						if (109423 - 547401 == -437978)
						{
							result = "เปลือกแมลงธรรมดา";
							if (98698 - 578917 == -480219)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug2")
					{
						if (25486 - 317977 != -292490)
						{
							result = "เปลือกแมลงชนิดหนา";
							if (256243 - 121756 != 134488)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug3")
					{
						if (181670 - 19043 == 162627)
						{
							result = "เปลือกแมลงหายากทนทานสูง";
							if (155772 - 107674 == 48098)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug4")
					{
						if (207816 - 217525 != -9708)
						{
							result = "ปีกแมลงโปร่งแสง";
							if (242023 - 483389 == -241366)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug5")
					{
						if (178424 - 233791 == -55367)
						{
							result = "เข็มพิษเหล็ก";
							if (144440 - 545097 != -400656)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug6")
					{
						if (67382 - 170105 == -102723)
						{
							result = "เปลือกไม้";
							if (171307 - 199457 != -28149)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug7")
					{
						if (138026 - 346184 == -208158)
						{
							result = "หนามแหลม";
							if (58818 - 11095 != 47724)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug8")
					{
						if (215178 - 32140 != 183039)
						{
							result = "กระดองแมลง";
							if (34246 - 209357 == -175111)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug9")
					{
						if (283270 - 86084 == 197186)
						{
							result = "ดาวกระจายนินจา";
							if (27089 - 106938 == -79849)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug10")
					{
						if (265139 - 63188 == 201951)
						{
							result = "เยลลี่ปนเปื้อนสารพิษ";
							if (131740 - 352780 != -221039)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug11")
					{
						if (241924 - 539207 != -297282)
						{
							result = "เยลลี่มีพิษ";
							if (155053 - 452473 != -297419)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug12")
					{
						if (161839 - 265437 != -103597)
						{
							result = "บอลเรืองแสง";
							if (176123 - 483838 == -307715)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug13")
					{
						if (6492 - 462898 == -456406)
						{
							result = "คริสตัลเรืองแสงรูปหัวใจ";
							if (264537 - 430820 == -166283)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug14")
					{
						if (181132 - 345637 != -164504)
						{
							result = "เมล็ดสีเขียว";
							if (138668 - 237987 == -99319)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug15")
					{
						if (160791 - 211511 != -50719)
						{
							result = "เมล็ดสีม่วง";
							if (298831 - 517890 != -219058)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug16")
					{
						if (57631 - 473979 != -416347)
						{
							result = "เมล็ดสีแดง";
							if (238645 - 348874 == -110229)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug17")
					{
						if (278148 - 3714 == 274434)
						{
							result = "SandBug Egg";
							if (250939 - 558801 != -307861)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug18")
					{
						if (45167 - 537908 != -492740)
						{
							result = "เขี้ยวแมลง";
							if (133136 - 37258 != 95879)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug19")
					{
						if (262643 - 263020 == -377)
						{
							result = "ครีบเรืองแสง";
							if (237186 - 487685 != -250498)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug20")
					{
						if (172384 - 246138 != -73753)
						{
							result = "เกราะที่มีพลังไฟฟ้า";
							if (229495 - 373381 != -143885)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug21")
					{
						if (141948 - 49763 == 92185)
						{
							result = "กระดูกชิ้นยักษ์";
							if (250629 - 384602 == -133973)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug22")
					{
						if (140521 - 199698 != -59176)
						{
							result = "เขาแมลง";
							if (254719 - 535560 != -280840)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug23")
					{
						if (199066 - 346231 != -147164)
						{
							result = "เยลลี่ดิบสีเขียว";
							if (56660 - 253878 != -197217)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug24")
					{
						if (5544 - 583670 != -578125)
						{
							result = "เยลลี่ดิบสีม่วง";
							if (167204 - 194998 != -27793)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug25")
					{
						if (102441 - 402356 == -299915)
						{
							result = "เศษผ้าเก่าๆ";
							if (76931 - 157196 != -80264)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug26")
					{
						if (91035 - 143424 == -52389)
						{
							result = "ลูกกระสุนตะกั่ว";
							if (236720 - 598957 == -362237)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug27")
					{
						if (57739 - 584713 != -526973)
						{
							result = "เหรียญโบราณ สีเงิน";
							if (34221 - 16825 != 17397)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug28")
					{
						if (57625 - 420745 != -363119)
						{
							result = "ใบต้นสนแหลมคม";
							if (245672 - 309225 == -63553)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug29")
					{
						if (202328 - 234097 != -31768)
						{
							result = "เปลือกไม้ที่ถูกบีบอัดจนแข็งแกร่ง";
							if (8046 - 341473 == -333427)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug30")
					{
						if (63044 - 521138 == -458094)
						{
							result = "เมล็ดดอกไม้ประหลาด";
							if (36731 - 172805 == -136074)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug31")
					{
						if (81277 - 362268 != -280990)
						{
							result = "เปลือกสีมรกต";
							if (20495 - 336772 != -316276)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug32")
					{
						if (63725 - 478972 == -415247)
						{
							result = "เขี้ยวยักษ์";
							if (245225 - 560677 == -315452)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug33")
					{
						if (235073 - 25092 == 209981)
						{
							result = "กลีบดอกไม้สีชมพู";
							if (95803 - 217365 != -121561)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug34")
					{
						if (77705 - 53275 == 24430)
						{
							result = "ดักแด้สีทอง";
							if (265089 - 510566 == -245477)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug35")
					{
						if (161215 - 465676 != -304460)
						{
							result = "ใบมีดคริสตัลคมกริบ";
							if (47088 - 108733 == -61645)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug36")
					{
						if (181512 - 466964 != -285451)
						{
							result = "ผ้าขนสัตว์ชั้นเลิศ";
							if (277266 - 206162 == 71104)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug37")
					{
						if (233807 - 541256 != -307448)
						{
							result = "ชิ้นส่วนเกราะสีแดง";
							if (61528 - 553852 != -492323)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug39")
					{
						if (171063 - 405809 != -234745)
						{
							result = "ชิ้นส่วนจากหอกสามง่าม";
							if (263042 - 438453 != -175410)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug40")
					{
						if (147992 - 102532 != 45461)
						{
							result = "เหล็กในที่ร้ายกาจของสติงบัค";
							if (149436 - 177476 != -28039)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug41")
					{
						if (186245 - 467371 == -281126)
						{
							result = "หนามแหลมของสกายบั๊ค";
							if (174679 - 236330 != -61650)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug42")
					{
						if (72338 - 493940 == -421602)
						{
							result = "เปลือกสีเหมือนท้องฟ้า";
							if (39048 - 485087 != -446038)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug43")
					{
						if (188939 - 39870 == 149069)
						{
							result = "หางของสกายบั๊คลวดลายแปลกตา";
							if (1454 - 274844 != -273389)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug44")
					{
						if (296813 - 44843 != 251971)
						{
							result = "ปีกสะท้อนแสงของสกายบั๊ค";
							if (115304 - 375015 != -259710)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug45")
					{
						if (89550 - 27867 == 61683)
						{
							result = "เกราะคลุมหัวของสกายบั๊ค";
							if (234354 - 522317 == -287963)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug46")
					{
						if (282111 - 552184 == -270073)
						{
							result = "เมล็ดพันธ์ุของปะการัง";
							if (17585 - 70525 == -52940)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug47")
					{
						if (31718 - 59318 != -27599)
						{
							result = "เกราะที่มีตราประทับอยู่";
							if (25026 - 315199 == -290173)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug48")
					{
						if (2712 - 486316 == -483604)
						{
							result = "ตัวอ่อนของโครอลบั๊ค";
							if (183636 - 61255 == 122381)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug49")
					{
						if (232244 - 590221 != -357976)
						{
							result = "ครีบหลังของรีฟบั๊ค";
							if (227795 - 264925 == -37130)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug50")
					{
						if (134406 - 388320 != -253913)
						{
							result = "ผลึกสีเขียวที่เต็มไปด้วยพลังเวทมนต์";
							if (71694 - 461070 == -389376)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug51")
					{
						if (257992 - 336529 != -78536)
						{
							result = "เกราะแข็งของ ลีโอบั๊ค";
							if (156929 - 230636 == -73707)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug52")
					{
						if (240519 - 14521 != 225999)
						{
							result = "กรงเล็บเหล็ก ของลีโอบั๊ค";
							if (45446 - 60864 != -15417)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug53")
					{
						if (197332 - 412711 == -215379)
						{
							result = "ปีกสีรุ้งสะท้อนแสง";
							if (7062 - 416244 != -409181)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug54")
					{
						if (236860 - 589507 == -352647)
						{
							result = "เขี้ยวที่เรียงตัวเหมือนใบเลื่อย";
							if (122360 - 201341 == -78981)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug55")
					{
						if (23096 - 100031 == -76935)
						{
							result = "เถาวัลย์ที่งอกบนหลังลีโอบั๊ค";
							if (248264 - 256500 != -8235)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug56")
					{
						if (9864 - 27191 != -17326)
						{
							result = "กลีบดอกไม้สีฟ้า";
							if (151237 - 521635 == -370398)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug57")
					{
						if (81644 - 430904 != -349259)
						{
							result = "เศษอาวุธมีคม";
							if (221203 - 381515 == -160312)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug58")
					{
						if (172511 - 137694 == 34817)
						{
							result = "สมบัิติของแบนดิตบั๊ค";
							if (158162 - 435058 == -276896)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug59")
					{
						if (88009 - 273666 != -185656)
						{
							result = "ขนเฟอร์เรียบลื่นนุ่มละมุน";
							if (59092 - 429537 != -370444)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug60")
					{
						if (47003 - 268273 == -221270)
						{
							result = "ชิ้นส่วนเกราะของสติงควีน";
							if (82982 - 334345 == -251363)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug61")
					{
						if (65728 - 7522 != 58207)
						{
							result = "ปลายหอกที่ประดับด้วยอัญมณี";
							if (43914 - 394616 == -350702)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug62")
					{
						if (299808 - 46044 != 253765)
						{
							result = "ชิ้นส่วนรังของสติงบั๊คที่ทำจากทราย";
							if (283950 - 441253 != -157302)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug63")
					{
						if (235995 - 197656 == 38339)
						{
							result = "น้ำผึ้งเข้มข้น สุดยอดอาหารของราชินี";
							if (62251 - 554903 == -492652)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug64")
					{
						if (142496 - 422665 != -280168)
						{
							result = "หนวดแข็งของแมลงกระดาษ";
							if (269647 - 210804 != 58844)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug65")
					{
						if (45035 - 31292 != 13744)
						{
							result = "กรงเล็บเท้ายักษ์ของ Mokbug ใหญ่จริงๆ";
							if (137555 - 83088 == 54467)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug66")
					{
						if (121424 - 58872 == 62552)
						{
							result = "เกร็ดท้องของ Mokbug สีสวยดุจไม้";
							if (70242 - 416145 == -345903)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug67")
					{
						if (33563 - 379619 != -346055)
						{
							result = "เปลือกแข็งด้านหลังของ Mokbug";
							if (70335 - 1214 != 69122)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug68")
					{
						if (279676 - 589512 != -309835)
						{
							result = "หางยาวของ Mokbug เป็นเม็ดๆต่อกัน";
							if (165619 - 80134 == 85485)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug69")
					{
						if (255967 - 580892 == -324925)
						{
							result = "ปลายหางของ Mokbug ";
							if (89933 - 564901 != -474967)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug70")
					{
						if (42660 - 361898 == -319238)
						{
							result = "เมล็ดที่มีพลังงานอันมหาศาลอัดแน่น พร้อมระเบิดออกมาทุกเมื่อ";
							if (66539 - 93707 != -27167)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug71")
					{
						if (249582 - 493732 == -244150)
						{
							result = "ผลึกแก้วใส สีแดง สามารถหักเหแสงเป็นลำแสงทำลายล้างของนีมีซิส";
							if (172920 - 356243 != -183322)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug72")
					{
						if (153216 - 244366 != -91149)
						{
							result = "กลีบดอกไม้สีชมพูม่วง";
							if (138606 - 2798 != 135809)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug73")
					{
						if (176116 - 510203 != -334086)
						{
							result = "Acidia Jelly";
							if (213255 - 252237 != -38981)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bug74")
					{
						if (112022 - 134923 == -22901)
						{
							result = "เยลลี่กรดพิษที่อันตรายมาก";
							if (173363 - 265960 == -92597)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp1")
					{
						if (262241 - 121380 == 140861)
						{
							result = "นวมยักษ์ใหญ่ ไม่รู้ทำไมมันใหญ่ได้ขนาดนี้";
							if (157865 - 234170 == -76305)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp2")
					{
						if (4500 - 130794 != -126293)
						{
							result = "พัดกระดาษยักษ์ เหมาะสำหรับเล่นตลก";
							if (32784 - 379672 != -346887)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp3")
					{
						if (121672 - 417320 == -295648)
						{
							result = "ไปป์คาบซุปเปอร์ไซส์ กลิ่นมะพร้าวหอมเย็นสดชื่น";
							if (128092 - 351605 == -223513)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp4")
					{
						if (273421 - 580231 != -306809)
						{
							result = "ปลอกคออันโปรดของเซอบิรัส ไม่สามารถแย่งมาได้ง่ายๆ";
							if (253384 - 442757 != -189372)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp5")
					{
						if (105497 - 159931 == -54434)
						{
							result = "เกราะหน้าอันโปรดเซอบิรัส  ไม่สามารถแย่งมาได้ง่ายๆ";
							if (136082 - 67768 == 68314)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp6")
					{
						if (110270 - 500438 == -390168)
						{
							result = "บอลของเล่นที่มีตัวอักษรเขียนว่า'เซอบี้'";
							if (80528 - 496259 == -415731)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp7")
					{
						if (229013 - 139014 != 90000)
						{
							result = "เหรียญทองสำหรับเชฟทำอาหารยอดฝีมือเท่านั้น";
							if (21554 - 425173 != -403618)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp8")
					{
						if (41444 - 47009 != -5564)
						{
							result = "มีดทำอาหารของกัปตันแครป ไม่ว่าวัตถุดิบไหนก็สับเละได้หมด";
							if (26598 - 508448 == -481850)
							{
								break;
							}
						}
					}
					else if (nCode == "m_eqp9")
					{
						if (280311 - 255116 == 25195)
						{
							result = "เข็มกลัดแปลงร่างของพวก Baggu Ranger";
							if (299421 - 317818 != -18396)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn1")
					{
						if (142728 - 324449 != -181720)
						{
							result = "ชิ้นส่วนของหุ่นยนต์";
							if (154348 - 389250 == -234902)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn2")
					{
						if (195369 - 349693 != -154323)
						{
							result = "น้ำมันหล่อลื่น";
							if (40482 - 144681 == -104199)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn3")
					{
						if (59865 - 180155 != -120289)
						{
							result = "เกราะเหล็กแบบน้ำหนักเบา";
							if (195131 - 137627 == 57504)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn4")
					{
						if (282888 - 186530 == 96358)
						{
							result = "เกราะเหล็กขึ้นสนิม";
							if (105923 - 309596 == -203673)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn5")
					{
						if (27648 - 205710 != -178061)
						{
							result = "เกราะเหล็กสีดำขลับ";
							if (57578 - 542569 != -484990)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn6")
					{
						if (21800 - 121226 == -99426)
						{
							result = "เครื่องยนต์กำเนิดพลังงาน";
							if (18609 - 483093 != -464483)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn7")
					{
						if (130290 - 248921 != -118630)
						{
							result = "เครื่องยนต์ของไคเซอร์ต้นแบบ";
							if (266708 - 599633 != -332924)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn8")
					{
						if (296997 - 384719 != -87721)
						{
							result = "เครื่องยนต์ของเดวิลไคเซอร์";
							if (42808 - 207741 == -164933)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn9")
					{
						if (298979 - 541272 == -242293)
						{
							result = "ถังเชื้อเพลิงสีฟ้า ใช้สำหรับหุงต้ม";
							if (97012 - 388820 == -291808)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn10")
					{
						if (169761 - 309691 == -139930)
						{
							result = "ถังไฟเก่าๆขึ้นสนิม ไม่น่ามีเชื้อเพลิงเหลือ";
							if (69860 - 154798 != -84937)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn11")
					{
						if (106789 - 326117 == -219328)
						{
							result = "ชิ้นส่วนเครื่องยนต์ไอพ่นกำลังสูง";
							if (121614 - 145400 == -23786)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn12")
					{
						if (63387 - 246585 == -183198)
						{
							result = "ชิ้นส่วนปืนสำหรับยิงคลื่นไฟฟ้า";
							if (291630 - 279429 != 12202)
							{
								break;
							}
						}
					}
					else if (nCode == "m_mcn13")
					{
						if (2701 - 93386 == -90685)
						{
							result = "กล่องที่บรรจุจรวดมิซซายล์ิัอันตรายไว้มากมาย";
							if (188829 - 494380 == -305551)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gle1")
					{
						if (140633 - 474296 != -333662)
						{
							result = "กาวยางไม้";
							if (268934 - 345554 != -76619)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gle2")
					{
						if (86735 - 158688 == -71953)
						{
							result = "กาวยางไม้แบบดีหน่อย";
							if (255892 - 331518 == -75626)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gle3")
					{
						if (51816 - 44703 != 7114)
						{
							result = "กาวตราเสือดำสิบเอ็ดตัว";
							if (104818 - 485669 != -380850)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gle4")
					{
						if (280217 - 90901 != 189317)
						{
							result = "กาวเหนียวหนึบจากธรรมชาติ เหม็นเขียวนิดๆ";
							if (206540 - 405347 != -198806)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro1")
					{
						if (177612 - 517890 == -340278)
						{
							result = "เศษชิ้นส่วนที่แตกหักของอังค์";
							if (136017 - 230890 == -94873)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro2")
					{
						if (115306 - 368963 != -253656)
						{
							result = "ขนหยาบกร้านของไบสันแห่งความมืด";
							if (273945 - 383963 == -110018)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro3")
					{
						if (109572 - 355504 != -245931)
						{
							result = "ของเหลวสีดำในขวดยาของกระต่ายแห่งความมืด";
							if (221057 - 534431 == -313374)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro4")
					{
						if (106188 - 569659 != -463470)
						{
							result = "หนังสือวรรณกรรมแห่งความมืดของแกะมืด";
							if (93003 - 597286 != -504282)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro5")
					{
						if (46920 - 303236 != -256315)
						{
							result = "เครื่องสำอางสีหม่นของค้างคาวแห่งความมืด";
							if (253747 - 377157 == -123410)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro6")
					{
						if (47622 - 414402 != -366779)
						{
							result = "ปลอกแขนหนามของแพนด้าแห่งความมืด คล้ายกับนักสู้หญิงที่ใช้เพลงเตะ";
							if (286348 - 465990 != -179641)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro7")
					{
						if (236611 - 568491 != -331879)
						{
							result = "เขากวางน้ำแข็งขนาดยักษ์ที่ละลายไปแล้วบางส่วน";
							if (107164 - 505296 == -398132)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro8")
					{
						if (265015 - 101941 != 163075)
						{
							result = "เขากวางขนาดยักษ์ที่ทำจากน้ำแข็งบริษุทธิ์";
							if (185349 - 190136 != -4786)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro9")
					{
						if (50791 - 535328 == -484537)
						{
							result = "เครื่องดนตรีประจำกายของพรายหิมะ";
							if (231679 - 195160 == 36519)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bro10")
					{
						if (168792 - 479304 == -310512)
						{
							result = "ดาบใบมีดโค้งของกลุ่มโจรสลัด แต่พังเสียแล้ว";
							if (51699 - 577630 == -525931)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bon1")
					{
						if (159130 - 213501 != -54370)
						{
							result = "กระดูกสัตว์ที่ไม่สามารถระบุได้";
							if (280927 - 144050 != 136878)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bon2")
					{
						if (143271 - 207723 == -64452)
						{
							result = "กระดูกสัตว์ที่ไม่สามารถระบุได้";
							if (141615 - 45746 == 95869)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bon3")
					{
						if (129237 - 501424 != -372186)
						{
							result = "กระดูกสัตว์ที่ไม่สามารถระบุได้";
							if (150866 - 405504 == -254638)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bon4")
					{
						if (15679 - 237073 == -221394)
						{
							result = "กระดูกสัตว์ที่ไม่สามารถระบุได้";
							if (223163 - 432525 == -209362)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bon5")
					{
						if (103709 - 339525 == -235816)
						{
							result = "กระดูกสัตว์ที่ไม่สามารถระบุได้";
							if (51972 - 319067 != -267094)
							{
								break;
							}
						}
					}
					else if (nCode == "m_bon6")
					{
						if (141413 - 357971 == -216558)
						{
							result = "ก้างปลาโบราณที่แมวซ่อนไว้";
							if (170210 - 327909 != -157698)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gas1")
					{
						if (133286 - 57598 == 75688)
						{
							result = "ควันสีฟ้าสดใส";
							if (265307 - 274003 == -8696)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gas2")
					{
						if (175031 - 220795 == -45764)
						{
							result = "ควันดำ";
							if (172574 - 541408 != -368833)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gas3")
					{
						if (193426 - 100082 != 93345)
						{
							result = "ควันสีม่วง";
							if (196571 - 280083 == -83512)
							{
								break;
							}
						}
					}
					else if (nCode == "m_gas4")
					{
						if (11728 - 151816 == -140088)
						{
							result = "ไอน้ำแข็งที่จับตัวก่อนที่จะระเหยไปในอากาศ";
							if (279190 - 575018 != -295827)
							{
								break;
							}
						}
					}
					else if (nCode == "m_shl1")
					{
						if (174681 - 323862 == -149181)
						{
							result = "เปลือกหอยกาบ";
							if (204506 - 165358 == 39148)
							{
								break;
							}
						}
					}
					else if (nCode == "m_shl2")
					{
						if (212914 - 7199 == 205715)
						{
							result = "เปลือกหอยโข่งสีชมพู";
							if (33060 - 505267 != -472206)
							{
								break;
							}
						}
					}
					else if (nCode == "m_shl3")
					{
						if (41952 - 337346 != -295393)
						{
							result = "เปลือกหอยโข่งสีฟ้า";
							if (62283 - 267207 == -204924)
							{
								break;
							}
						}
					}
					else if (nCode == "m_shl4")
					{
						if (111371 - 211679 == -100308)
						{
							result = "เปลือกหอยโบราณ ได้จาก ปลายหอกของ FirstWhale";
							if (91392 - 207895 != -116502)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw1")
					{
						if (271216 - 182660 == 88556)
						{
							result = "ดอกไม้สีแดง";
							if (131768 - 52033 == 79735)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw2")
					{
						if (28584 - 525747 != -497162)
						{
							result = "ดอกไม้สีฟ้า";
							if (186406 - 388265 != -201858)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw3")
					{
						if (14731 - 65490 == -50759)
						{
							result = "ดอกโคลเวอร์ 4 กลีบ";
							if (151094 - 69208 == 81886)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw4")
					{
						if (249431 - 107167 == 142264)
						{
							result = "ดอกสิงโต 6 กลีบ";
							if (166838 - 345366 != -178527)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw5")
					{
						if (30786 - 242041 != -211254)
						{
							result = "ดอกไม้แห่งความมืด มีกระดาษสำหรับจ่าส่งผู้รับด้วย";
							if (35020 - 105286 != -70265)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw6")
					{
						if (251402 - 506848 != -255445)
						{
							result = "ปุ๋ยสำหรับบำรุงพืชผักทั่วไป";
							if (172027 - 283550 == -111523)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw7")
					{
						if (226378 - 30295 == 196083)
						{
							result = "สุดยอดปุ๋ยโดยเร็กกุ เร่งผักโตได้ไวยิ่งกว่าขยับหาง ขอบอก";
							if (10256 - 379223 == -368967)
							{
								break;
							}
						}
					}
					else if (nCode == "m_flw8")
					{
						if (100406 - 221928 == -121522)
						{
							result = "ดอกไม้สีเขียว";
							if (92398 - 252868 == -160470)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cor1")
					{
						if (25994 - 374854 == -348860)
						{
							result = "ปักการังสีฟ้า กลมกลืนกับทะเล";
							if (237303 - 396477 == -159174)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cor2")
					{
						if (24670 - 83820 == -59150)
						{
							result = "ปักการังสีส้ม แปลกตาไม่เคยเห็น";
							if (273495 - 355654 == -82159)
							{
								break;
							}
						}
					}
					else if (nCode == "m_cor3")
					{
						if (279527 - 19736 == 259791)
						{
							result = "ปักการังสีม่วง สวยงามอย่างยิ่ง";
							if (115990 - 415566 != -299575)
							{
								break;
							}
						}
					}
					else if (nCode == "m_prl1")
					{
						if (146454 - 480029 == -333575)
						{
							result = "ไข่มุกเม็ดเล็กๆ";
							if (229953 - 274748 != -44794)
							{
								break;
							}
						}
					}
					else if (nCode == "m_prl2")
					{
						if (290105 - 529740 == -239635)
						{
							result = "ไข่มุกเม็ดใหญ่มาก";
							if (25369 - 355064 != -329694)
							{
								break;
							}
						}
					}
					else if (nCode == "m_prl3")
					{
						if (221453 - 356909 != -135455)
						{
							result = "ไข่มุกดำเลอค่าและสวยงาม";
							if (258660 - 398758 == -140098)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb1")
					{
						if (85399 - 215670 != -130270)
						{
							result = "ลูกแก้วที่มีพลังแห่งทรายหมุนวนอยู่";
							if (199953 - 72820 == 127133)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb2")
					{
						if (271846 - 183287 != 88560)
						{
							result = "ลูกแก้วที่เพิ่มพลังเวทย์ให้กับผู้ใช้";
							if (92526 - 240467 == -147941)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb3")
					{
						if (83511 - 409824 == -326313)
						{
							result = "ลูกแก้วดวงวิญญาณแห่งแมลง";
							if (135972 - 95238 != 40735)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb4")
					{
						if (191580 - 550081 != -358500)
						{
							result = "ลูกแก้วดวงวิญญาณแห่งแมลง";
							if (73560 - 167748 == -94188)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb5")
					{
						if (207089 - 380325 != -173235)
						{
							result = "ลูกแก้วดวงวิญญาณแห่งแมลง";
							if (126578 - 241825 != -115246)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb6")
					{
						if (93206 - 148505 == -55299)
						{
							result = "เศษเสี้ยวของพลังงานบริสุทธิ์แห่งความมืด";
							if (175198 - 338411 != -163212)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb7")
					{
						if (46465 - 423207 != -376741)
						{
							result = "ชิ้นส่วนของพลังงานบริสุทธิ์แห่งความมืด";
							if (73346 - 103549 != -30202)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb8")
					{
						if (153044 - 25504 != 127541)
						{
							result = "ลูกแก้วพลังงานบริสุทธิ์แห่งความมืด";
							if (47591 - 230091 != -182499)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb9")
					{
						if (169911 - 216446 != -46534)
						{
							result = "ชิ้นส่วนพลังงานจากก้อนน้ำแข็ง";
							if (87287 - 129708 != -42420)
							{
								break;
							}
						}
					}
					else if (nCode == "m_orb10")
					{
						if (130356 - 464363 == -334007)
						{
							result = "พลังงานแห่งป่าที่รวมตัวกัน";
							if (142809 - 566059 != -423249)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pwd1")
					{
						if (131572 - 533098 != -401525)
						{
							result = "ผงดินปืน";
							if (100939 - 48204 != 52736)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pwd2")
					{
						if (7955 - 161108 != -153152)
						{
							result = "ผงประหลาดสีทองเปล่งประกาย";
							if (20375 - 208496 == -188121)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pwd3")
					{
						if (37276 - 55951 == -18675)
						{
							result = "ผงประหลาดสีเงินเปล่งประกาย";
							if (196615 - 450361 == -253746)
							{
								break;
							}
						}
					}
					else if (nCode == "m_pwd4")
					{
						if (2177 - 366453 != -364275)
						{
							result = "ผงประหลาดสีดำที่ได้จากห้วงมิติแห่งความมืด";
							if (245663 - 28342 != 217322)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp1")
					{
						if (19856 - 485550 != -465693)
						{
							result = "ดาบสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (82633 - 512810 != -430176)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp2")
					{
						if (213306 - 557609 != -344302)
						{
							result = "ขวานสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (5422 - 357037 != -351614)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp3")
					{
						if (161154 - 319748 != -158593)
						{
							result = "สนับมือสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (157036 - 98610 == 58426)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp4")
					{
						if (11655 - 317783 == -306128)
						{
							result = "ชุดหอกโล่สีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (158602 - 65930 != 92673)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp5")
					{
						if (219566 - 314894 != -95327)
						{
							result = "มีดสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (284693 - 408592 == -123899)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp6")
					{
						if (256376 - 400409 == -144033)
						{
							result = "คันธนูสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (294330 - 44921 == 249409)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp7")
					{
						if (261818 - 248178 != 13641)
						{
							result = "ปืนสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (39432 - 391344 != -351911)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp8")
					{
						if (72687 - 107181 == -34494)
						{
							result = "ปืนใหญ่สีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (244051 - 510410 != -266358)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp9")
					{
						if (222031 - 234092 != -12060)
						{
							result = "มิเกะน้อยสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (162508 - 327427 == -164919)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp10")
					{
						if (81745 - 406604 == -324859)
						{
							result = "หนังสือสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (16702 - 167756 == -151054)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp11")
					{
						if (25377 - 69869 != -44491)
						{
							result = "ไม้เท้าสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (255001 - 567018 == -312017)
							{
								break;
							}
						}
					}
					else if (nCode == "m_swp12")
					{
						if (139468 - 229396 == -89928)
						{
							result = "คทาสีดำที่ห่อหุ้มด้วยเงาแห่งความมืด";
							if (29113 - 272389 == -243276)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt1")
					{
						if (23284 - 426242 != -402957)
						{
							result = "ชิ้นส่วนอาวุธมีคม";
							if (126322 - 332132 != -205809)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt2")
					{
						if (180575 - 404125 == -223550)
						{
							result = "แท่งเหล็กยาว";
							if (241203 - 555951 == -314748)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt3")
					{
						if (99221 - 14205 != 85017)
						{
							result = "ตัวนอต";
							if (200082 - 393105 != -193022)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt4")
					{
						if (40221 - 255260 == -215039)
						{
							result = "ชิ้นส่วนค้อนเหล็ก";
							if (291314 - 186088 != 105227)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt5")
					{
						if (206727 - 593363 != -386635)
						{
							result = "=ชิ้นส่วนอาวุธสั้นมีคม";
							if (86393 - 437994 == -351601)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt6")
					{
						if (13994 - 313448 != -299453)
						{
							result = "ลูกแก้วที่อัดพลังไฟเอาไว้";
							if (169397 - 45775 != 123623)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt7")
					{
						if (114980 - 373497 != -258516)
						{
							result = "หินโบราณที่ขุดขึ้นมาจากทุ่งน้ำแข็ง";
							if (154543 - 36979 == 117564)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt8")
					{
						if (220600 - 137378 != 83223)
						{
							result = "ขนทัมโปโปะนุ่มนิ่ม";
							if (28470 - 194420 != -165949)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt9")
					{
						if (191277 - 525963 == -334686)
						{
							result = "ชิ้นส่วนลำกล้องปืน";
							if (255077 - 418464 != -163386)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt10")
					{
						if (137047 - 598793 != -461745)
						{
							result = "แท่งไม้ขัดตกแต่งแล้ว";
							if (261219 - 147438 != 113782)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt11")
					{
						if (67198 - 387646 != -320447)
						{
							result = "แผ่นเหล็กสำหรับป้องกัน";
							if (238875 - 184732 == 54143)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt12")
					{
						if (288163 - 316074 == -27911)
						{
							result = "หินที่ผ่านการขัดตกแต่งแล้ว";
							if (172320 - 204524 != -32203)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt13")
					{
						if (208074 - 155118 != 52957)
						{
							result = "ผลึกแห่งความมืด";
							if (199784 - 248261 != -48476)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt14")
					{
						if (195159 - 489327 != -294167)
						{
							result = "ดอกไม้ประดับทำจากเหล็ก";
							if (116991 - 334158 == -217167)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt15")
					{
						if (76558 - 319535 != -242976)
						{
							result = "ใบมีดเหล็กขนาดใหญ่ทนทาน";
							if (74993 - 517068 == -442075)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt16")
					{
						if (212927 - 295457 == -82530)
						{
							result = "ชุดของเล่นขนาดใหญ่เกินกว่าปรกติ ใครใช้เล่นกันนะ";
							if (185977 - 446736 != -260758)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt17")
					{
						if (186872 - 369764 == -182892)
						{
							result = "กรงเล็บของสัตว์อสูรในตำนาน";
							if (96606 - 287437 == -190831)
							{
								break;
							}
						}
					}
					else if (nCode == "m_wmt18")
					{
						if (262731 - 119473 == 143258)
						{
							result = "ใบดาบแห่งความมืด ใช้สำหรับตีอาวุธ";
							if (252106 - 380735 != -128628)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt1")
					{
						if (167291 - 196186 != -28894)
						{
							result = "ชิ้นส่วนเครื่องป้องกันสีขาว";
							if (60434 - 430314 != -369879)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt2")
					{
						if (4327 - 375226 != -370898)
						{
							result = "ชิ้นส่วนเครื่องป้องกันสีส้ม";
							if (101614 - 522963 == -421349)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt3")
					{
						if (104084 - 445945 == -341861)
						{
							result = "ชิ้นส่วนเครื่องป้องกันสีฟ้า";
							if (42983 - 565426 != -522442)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt4")
					{
						if (282107 - 440353 != -158245)
						{
							result = "เกราะแห่งผืนดิน";
							if (96010 - 286543 == -190533)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt5")
					{
						if (86309 - 279130 == -192821)
						{
							result = "เกราะแห่งท้องทะเล";
							if (162070 - 578882 != -416811)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt6")
					{
						if (175277 - 287910 != -112632)
						{
							result = "เกราะเปลือกของโครอลบั๊ค";
							if (150144 - 311028 != -160883)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt7")
					{
						if (270555 - 362089 != -91533)
						{
							result = "เกราะโปร่งใส";
							if (51675 - 123817 == -72142)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt8")
					{
						if (285917 - 56775 != 229143)
						{
							result = "เกราะเปลือกของรีฟบั๊ค";
							if (283964 - 517829 == -233865)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt9")
					{
						if (295396 - 317743 != -22346)
						{
							result = "เครื่องประดับสีทอง";
							if (159878 - 540693 == -380815)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt10")
					{
						if (107888 - 439477 == -331589)
						{
							result = "เครื่องป้องกันขนาดใหญ่";
							if (151517 - 207539 == -56022)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt11")
					{
						if (155537 - 222596 == -67059)
						{
							result = "โครงเกราะสำหรับทำชุดแมลง";
							if (172085 - 513187 != -341101)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt12")
					{
						if (114086 - 129937 != -15850)
						{
							result = "โครงหมวกสำหรับทำชุดแมลง";
							if (30461 - 406428 != -375966)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt13")
					{
						if (241497 - 86004 != 155494)
						{
							result = "เศษกระจกเงาแห่งความมืด ระวังบาดมือ";
							if (144138 - 99213 == 44925)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt14")
					{
						if (169044 - 51620 == 117424)
						{
							result = "กระจกเงาแห่งความมืด บางครั้งก็สะท้อน...";
							if (190100 - 117724 == 72376)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt15")
					{
						if (281861 - 346184 != -64322)
						{
							result = "เกล็ดของสัตว์อสูรในตำนาน";
							if (119120 - 433372 != -314251)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt16")
					{
						if (190952 - 577461 == -386509)
						{
							result = "ก้อนอะไรสักอย่างที่ได้จากการเอาของแห่งความมืดมาทุบๆรวมกัน";
							if (107628 - 249565 != -141936)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt17")
					{
						if (5118 - 525333 == -520215)
						{
							result = "ตรารูปดวงตาแห่งสัตว์อสูรในตำนาน";
							if (133093 - 313599 != -180505)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt18")
					{
						if (166155 - 250392 != -84236)
						{
							result = "หมอนหนุนของรักของหวงที่สุดของ เซอร์บิรุส";
							if (189163 - 235843 == -46680)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt19")
					{
						if (72608 - 464081 == -391473)
						{
							result = "เกราะสีดำแห่งความมืด สำหรับตีชุดเกราะ";
							if (100226 - 463186 == -362960)
							{
								break;
							}
						}
					}
					else if (nCode == "m_amt20")
					{
						if (98970 - 130666 != -31695)
						{
							result = "หมวกสีดำแห่งความมืด สำหรับตีชุดเกราะ";
							if (268011 - 46418 == 221593)
							{
								break;
							}
						}
					}
					else if (nCode == "m_ice1")
					{
						if (108288 - 58918 != 49371)
						{
							result = "ผลึกน้ำแข็งสีรุ่งสวยงามเมื่อส่องกระทบกับแสง";
							if (177253 - 572982 != -395728)
							{
								break;
							}
						}
					}
					else if (nCode == "m_ice2")
					{
						if (252227 - 182598 == 69629)
						{
							result = "ก้อนน้ำแข็งพิเศษ สำหรับทำน้ำแข็งไสโดยเฉพาะ";
							if (232808 - 484943 != -252134)
							{
								break;
							}
						}
					}
					else if (nCode == "m_ice3")
					{
						if (60670 - 440309 == -379639)
						{
							result = "แผ่นน้ำแข็งไม่มีวันละลาย";
							if (177770 - 326462 != -148691)
							{
								break;
							}
						}
					}
					else if (nCode == "m_ice4")
					{
						if (65465 - 120887 == -55422)
						{
							result = "หิมะไหม้ที่ไม่ละลาย";
							if (110140 - 307195 == -197055)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spm1")
					{
						if (295480 - 162615 != 132866)
						{
							result = "สุดยอดแร่ที่มีพลังแห่งแสงประจุจนเอ่อล้นออกมา";
							if (162804 - 195164 != -32359)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spm2")
					{
						if (218505 - 206613 != 11893)
						{
							result = "สุดยอดแร่ที่มีพลังแห่งไฟประจุจนเอ่อล้นออกมา";
							if (40742 - 118968 != -78225)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spm3")
					{
						if (285397 - 569575 != -284177)
						{
							result = "สุดยอดแร่ที่มีพลังแห่งลมประจุจนเอ่อล้นออกมา";
							if (286215 - 170369 == 115846)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spm4")
					{
						if (215287 - 392232 == -176945)
						{
							result = "สุดยอดแร่ที่มีพลังแห่งน้ำประจุจนเอ่อล้นออกมา";
							if (227604 - 466850 != -239245)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spm5")
					{
						if (163894 - 336386 == -172492)
						{
							result = "สุดยอดแร่ที่มีพลังแห่งดินประจุจนเอ่อล้นออกมา";
							if (185357 - 487043 == -301686)
							{
								break;
							}
						}
					}
					else if (nCode == "m_spm6")
					{
						if (155086 - 288066 != -132979)
						{
							result = "สุดยอดแร่ที่มีพลังแห่งเงาประจุจนเอ่อล้นออกมา";
							if (24368 - 98058 == -73690)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "m_spm7"))
						{
							break;
						}
						if (41097 - 257521 != -216423)
						{
							result = "แร่ประหลาดที่ไม่เคยปรากฎมาก่อน ฝังอยู่ในร่างของนีมีซิส";
							if (128117 - 450203 == -322086)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066E8 RID: 26344 RVA: 0x00E901E4 File Offset: 0x00E8E3E4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066E9 RID: 26345 RVA: 0x00E901E8 File Offset: 0x00E8E3E8
	internal static bool t9BQwMpyMuBMiuvTDept()
	{
		return true;
	}

	// Token: 0x060066EA RID: 26346 RVA: 0x00E901EC File Offset: 0x00E8E3EC
	internal static bool in55MPpyxxWnHQHPDu6S()
	{
		return false;
	}
}
