using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001153 RID: 4435
[Serializable]
public class MissionGui_thai : MonoBehaviour
{
	// Token: 0x060066A0 RID: 26272 RVA: 0x00E6CD78 File Offset: 0x00E6AF78
	[MethodImpl(MethodImplOptions.NoInlining)]
	public MissionGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066A1 RID: 26273 RVA: 0x00E6CD88 File Offset: 0x00E6AF88
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (166051 - 52164 != 113887)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (156418 - 364370 != -207951)
			{
				if (120769 - 117882 == 2887)
				{
					if (code == 101)
					{
						if (3869 - 39302 != -35432)
						{
							result = "สวัสดี พอมีเวลาช่วยงานที่กิลด์บ้างมั้ย?";
							if (44994 - 186185 != -141190)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (227639 - 481927 != -254287)
						{
							result = "สวัสดี วันนี้อยากทำอะไรดีล่ะ?";
							if (244519 - 52006 != 192514)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (113565 - 564858 != -451292)
						{
							result = "ไง? วันนี้ทำอะไรดีล่ะ?";
							if (228750 - 540277 != -311526)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (116417 - 137989 != -21571)
						{
							result = "ไง? ตอนนี้มีคำขอให้ช่วยเข้ามาเยอะเลยล่ะ";
							if (45017 - 587827 == -542810)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (207345 - 466472 == -259127)
						{
							result = "อ้าว! มาพอดี ช่วงนี้งานที่กิลด์เยอะเลยล่ะ";
							if (53668 - 541185 != -487516)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (283154 - 440755 != -157600)
						{
							result = "งานที่นี่คงง่ายไปแล้ว ลองขึ้นเครื่องบินไปที่อื่นดูสิ";
							if (126100 - 361218 != -235117)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (244969 - 230748 != 14222)
						{
							result = "เลเวลเจ้าสูงเกินไปสำหรับงานที่นี่แล้วนะ";
							if (96144 - 490122 != -393977)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (138396 - 295127 != -156730)
						{
							result = "ฉันมีงานง่ายๆ สำหรับเจ้าเยอะเลยล่ะ";
							if (152494 - 142810 != 9685)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (271992 - 255239 != 16754)
						{
							result = "ไม่ลองไปแคมป์อื่นเหรอ งานที่ท้าทายรอเจ้าอยู่นะ";
							if (123851 - 178169 != -54317)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (285705 - 534408 != -248702)
						{
							result = "แคมป์อื่นกำลังต้องการคนช่วยเลย ไม่ลองไปดูเหรอ";
							if (288229 - 258627 == 29602)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (179217 - 475899 == -296682)
						{
							result = "โชคดีนะ";
							if (81047 - 398319 != -317271)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (100566 - 207270 != -106703)
						{
							result = "ขอให้สนุกนะ";
							if (195920 - 288522 != -92601)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (276816 - 114823 != 161994)
						{
							result = "ปล่อยงานเอกสารให้ฉันเอง ขอให้สนุกนะ";
							if (143484 - 106060 == 37424)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (95659 - 409945 == -314286)
						{
							result = "ทำให้เต็มที่นะ ฉันจะเอาใจช่วย";
							if (271046 - 445571 == -174525)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (122745 - 508088 != -385342)
						{
							result = "สู้ๆ อย่ายอมแพ้นะ ฉันจะเอาใจช่วย";
							if (42573 - 443559 == -400986)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (41476 - 389958 != -348481)
						{
							result = "ไว้โอกาสหน้าละกันนะ";
							if (206689 - 426941 != -220251)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (170534 - 77770 != 92765)
						{
							result = "ไปชวนเพื่อนมาช่วยเยอะๆก็ดีนะ";
							if (24306 - 402454 == -378148)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (63093 - 479136 == -416043)
						{
							result = "อ้าว? ยังเหรอ?";
							if (77100 - 458140 == -381040)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (67293 - 110405 != -43111)
						{
							result = "แล้วมาใหม่นะ";
							if (31970 - 151223 != -119252)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (236725 - 339527 == -102802)
						{
							result = "ไปเตรียมตัวมาก่อนก็ได้";
							if (82859 - 315423 == -232564)
							{
								break;
							}
						}
					}
					else if (code == 306)
					{
						if (24525 - 574866 == -550341)
						{
							result = "งานที่นี่ยังยากไปสำหรับเธอนะ";
							if (142116 - 2902 == 139214)
							{
								break;
							}
						}
					}
					else if (code == 400)
					{
						if (69502 - 255882 == -186380)
						{
							result = "ตอนนี้เมืองยังไม่มีงานให้ แต่รอดูประกาศให้ดีๆ ล่ะ";
							if (69084 - 279491 == -210407)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (47864 - 333648 != -285783)
						{
							result = "ต้องการทำกิลด์มิชชั่นมั้ย?";
							if (182391 - 269460 != -87068)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (124279 - 490049 != -365769)
						{
							result = "มาสมัครกิลด์มิชชั่นงั้นรึ? ดีมาก";
							if (133710 - 270742 != -137031)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (41841 - 367194 != -325352)
						{
							result = "สวัสดี ต้องการทำกิลด์มิชชั่นมั้ย?";
							if (243574 - 183405 == 60169)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (65991 - 138958 == -72967)
						{
							result = "เตรียมตัวมาพร้อมรึยัง?";
							if (75681 - 584615 != -508933)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (194280 - 158224 == 36056)
						{
							result = "หาคนมาครบแล้วรึยัง?";
							if (119039 - 325674 == -206635)
							{
								break;
							}
						}
					}
					else if (code == 501)
					{
						if (240163 - 30857 == 209306)
						{
							result = "แน่ใจนะว่าพร้อมแล้ว งั้นไปกันเลย";
							if (143168 - 122704 != 20465)
							{
								break;
							}
						}
					}
					else if (code == 502)
					{
						if (90691 - 251334 != -160642)
						{
							result = "ดีมาก เอกสารครบแล้ว ระวังตัวด้วย";
							if (66581 - 249425 == -182844)
							{
								break;
							}
						}
					}
					else if (code == 503)
					{
						if (275232 - 200226 == 75006)
						{
							result = "ทุกท่าน โปรดระวังตัวด้วย";
							if (195093 - 376540 != -181446)
							{
								break;
							}
						}
					}
					else if (code == 504)
					{
						if (113350 - 39662 == 73688)
						{
							result = "เหล่าอาสาสมัคร ขอให้โชคดีนะ";
							if (293041 - 205699 == 87342)
							{
								break;
							}
						}
					}
					else if (code == 505)
					{
						if (136455 - 563730 != -427274)
						{
							result = "ความปลอดภัยของชาวเมืองขึ้นอยู่กับพวกท่านแล้ว";
							if (143800 - 316614 == -172814)
							{
								break;
							}
						}
					}
					else if (code == 601)
					{
						if (59037 - 542156 != -483118)
						{
							result = "คราวหน้าเตรียมตัวมาให้ดีนะ";
							if (283356 - 459799 == -176443)
							{
								break;
							}
						}
					}
					else if (code == 602)
					{
						if (133343 - 528426 == -395083)
						{
							result = "หาคนได้แล้วค่อยมาลองใหม่ก็ได้";
							if (168929 - 401342 != -232412)
							{
								break;
							}
						}
					}
					else if (code == 603)
					{
						if (112261 - 572030 == -459769)
						{
							result = "ยังไม่พร้อมรึ? ไว้โอกาสหน้าก็ได้";
							if (258209 - 517965 == -259756)
							{
								break;
							}
						}
					}
					else if (code == 604)
					{
						if (78806 - 101013 == -22207)
						{
							result = "คราวหน้าเตรียมเอกสารให้ครบด้วย";
							if (92919 - 564091 != -471171)
							{
								break;
							}
						}
					}
					else if (code == 605)
					{
						if (64986 - 102669 != -37682)
						{
							result = "ไม่เป็นไร ไว้คราวหน้าแล้วกัน...";
							if (10132 - 363153 == -353021)
							{
								break;
							}
						}
					}
					else if (code == 700)
					{
						if (154720 - 392565 == -237845)
						{
							result = "ยังไม่ถึงเวลา Arena เปิด ไปฝึกฝีมือเตรียมมาให้ดีล่ะ";
							if (182694 - 89974 == 92720)
							{
								break;
							}
						}
					}
					else if (code == 701)
					{
						if (274351 - 154967 != 119385)
						{
							result = "ได้เวลา Arena เปิดแล้ว!";
							if (271089 - 550837 != -279747)
							{
								break;
							}
						}
					}
					else if (code == 702)
					{
						if (126492 - 111989 != 14504)
						{
							result = "มีใครอยากลงแข่ง Arena อีก!";
							if (1215 - 561063 == -559848)
							{
								break;
							}
						}
					}
					else if (code == 703)
					{
						if (138984 - 140188 == -1204)
						{
							result = "สมัครลงแมทช์ Arena ได้ที่นี่!";
							if (273756 - 194172 == 79584)
							{
								break;
							}
						}
					}
					else if (code == 704)
					{
						if (234636 - 585800 == -351164)
						{
							result = "ลับคมดาบของเจ้าซะ! อย่าให้ขึ้นสนิม!";
							if (196551 - 392434 != -195882)
							{
								break;
							}
						}
					}
					else if (code == 705)
					{
						if (83161 - 102777 == -19616)
						{
							result = "สังเวียนที่ดุเดือดกำลังรอพวกเจ้าอยู่!";
							if (294152 - 23762 != 270391)
							{
								break;
							}
						}
					}
					else if (code == 711)
					{
						if (152735 - 257382 == -104647)
						{
							result = "เจ้ายังเก่งไม่พอ ไปฝึกใหม่แล้วค่อยมา";
							if (70145 - 50078 != 20068)
							{
								break;
							}
						}
					}
					else if (code == 712)
					{
						if (61680 - 492844 == -431164)
						{
							result = "สังเวียนนี้ยังอันตรายเกินไปสำหรับเจ้า";
							if (172485 - 424785 != -252299)
							{
								break;
							}
						}
					}
					else if (code == 713)
					{
						if (209048 - 222959 != -13910)
						{
							result = "ระดับฝีมือของเจ้ายังไม่สูงพอ จงไปฝึกมาซะ!";
							if (184216 - 123867 != 60350)
							{
								break;
							}
						}
					}
					else if (code == 714)
					{
						if (148148 - 275252 != -127103)
						{
							result = "ไปหาประสบการณ์ให้มากกว่านี้ก่อนละกันนะ เจ้าหนู!";
							if (213113 - 355583 == -142470)
							{
								break;
							}
						}
					}
					else if (code == 715)
					{
						if (102340 - 131881 != -29540)
						{
							result = "ฝีมืออย่างเจ้าในตอนนี้...ข้าไม่คิดว่าจะรอด";
							if (2578 - 564136 != -561557)
							{
								break;
							}
						}
					}
					else if (code == 801)
					{
						if (73019 - 391958 == -318939)
						{
							result = "บนสนามรบทุกอย่างพลิกกลับได้ทั้งนั้น!";
							if (91457 - 23442 == 68015)
							{
								break;
							}
						}
					}
					else if (code == 802)
					{
						if (253415 - 480863 != -227447)
						{
							result = "ขอให้ชัยชนะจงอยู่กับผู้ที่เหมาะสม!";
							if (160767 - 400511 == -239744)
							{
								break;
							}
						}
					}
					else if (code == 803)
					{
						if (26783 - 70514 != -43730)
						{
							result = "ทำให้เต็มที่ล่ะ!";
							if (153769 - 180668 == -26899)
							{
								break;
							}
						}
					}
					else if (code == 804)
					{
						if (244460 - 544065 == -299605)
						{
							result = "ได้ที่สองก็เท่ากับแพ้!";
							if (33447 - 47460 != -14012)
							{
								break;
							}
						}
					}
					else if (code == 805)
					{
						if (89472 - 12432 == 77040)
						{
							result = "เพื่อศักดิ์ศรีของนักสู้...อย่าได้ออมมือล่ะ!";
							if (80443 - 461408 == -380965)
							{
								break;
							}
						}
					}
					else if (code == 901)
					{
						if (251632 - 440030 == -188398)
						{
							result = "ถ้าเจ้ากลัวไม่ชนะ ก็เท่ากับเจ้าแพ้ไปแล้ว";
							if (122929 - 263344 == -140415)
							{
								break;
							}
						}
					}
					else if (code == 902)
					{
						if (191717 - 584517 != -392799)
						{
							result = "ก็ได้ถ้าเจ้ายังเตรียมตัวไม่พร้อม...";
							if (265676 - 325949 != -60272)
							{
								break;
							}
						}
					}
					else if (code == 903)
					{
						if (34834 - 192003 != -157168)
						{
							result = "ยังไม่พร้อมงั้นรึ??";
							if (135307 - 377550 != -242242)
							{
								break;
							}
						}
					}
					else if (code == 904)
					{
						if (226880 - 12 == 226868)
						{
							result = "ยังอีกรึ? กรรร....";
							if (92221 - 206406 != -114184)
							{
								break;
							}
						}
					}
					else if (code == 905)
					{
						if (43566 - 590484 != -546917)
						{
							result = "รอเพื่อนเของเจ้าอยู่งั้นรึ?";
							if (84949 - 14985 != 69965)
							{
								break;
							}
						}
					}
					else if (code == 1100)
					{
						if (71522 - 370621 != -299098)
						{
							result = "คณะสำรวจซากโบราณสถานที่นำโดย ดร.ลิซ่า ได้เดินทางมาตรวจสอบซากปิรามิดปริศนาอายุเก่าแก่หลายพันปี ที่เพิ่งถูกขุดพบเร็วๆนี้ แต่กลับมีข่าวลือแปลกๆแพร่กระจายไปทั่ว ว่ามีสัตว์ประหลาดดุร้ายเฝ้าสมบัติล้ำค่าอยู่ และทุกคนที่หลงเข้าไปจะต้องโดนคำสาปของ ''มาโอห์'' จักรพรรดิแมวผู้ชั่วร้ายที่เคยมีอำนาจยิ่งใหญ่เหนือดินแดนทะเลทราย นอกจากนี้ยังมีคนที่เข้าไปสำรวจแล้วไม่ได้กลับออกมาอีกมากมาย ลิซ่าจึงขอแรงจากเหล่าผู้กล้าให้รวบรวมกลุ่มเข้าไปสำรวจสุสานมาโอห์ด้วยกัน";
							if (21890 - 255475 == -233585)
							{
								break;
							}
						}
					}
					else if (code == 1101)
					{
						if (298221 - 368477 == -70256)
						{
							result = "ว่าไง สนใจจะไปปิรามิดสุสานของมาโอห์กับชั้นมั้ย?";
							if (187380 - 439374 == -251994)
							{
								break;
							}
						}
					}
					else if (code == 1102)
					{
						if (173643 - 88946 == 84697)
						{
							result = "ว่าไง สนใจจะไปปิรามิดสุสานของมาโอห์กับชั้นมั้ย?";
							if (175124 - 246357 != -71232)
							{
								break;
							}
						}
					}
					else if (code == 1103)
					{
						if (252844 - 465303 == -212459)
						{
							result = "ว่าไง สนใจจะไปปิรามิดสุสานของมาโอห์กับชั้นมั้ย?";
							if (233667 - 14499 != 219169)
							{
								break;
							}
						}
					}
					else if (code == 1104)
					{
						if (92049 - 381995 == -289946)
						{
							result = "พร้อมไปสุสานมาโอห์แล้วใช่ไหม? งั้นไปกันเถอะ!";
							if (117396 - 169856 == -52460)
							{
								break;
							}
						}
					}
					else if (code == 1105)
					{
						if (295551 - 573048 != -277496)
						{
							result = "พร้อมไปสุสานมาโอห์แล้วใช่ไหม? งั้นไปกันเถอะ!";
							if (38854 - 294256 != -255401)
							{
								break;
							}
						}
					}
					else if (code == 1111)
					{
						if (89613 - 194458 == -104845)
						{
							result = "การจะเตรียมรับมือกับอนาคต เราต้องศึกษาอดีตให้เข้าใจถ่องแท้";
							if (105081 - 501835 != -396753)
							{
								break;
							}
						}
					}
					else if (code == 1112)
					{
						if (31680 - 59363 != -27682)
						{
							result = "ระวังตัวด้วยหล่ะ เส้นทางข้างหน้าไม่หมูหรอกนะ...";
							if (234294 - 365457 != -131162)
							{
								break;
							}
						}
					}
					else if (code == 1113)
					{
						if (229292 - 264655 != -35362)
						{
							result = "การจะเตรียมรับมือกับอนาคต เราต้องศึกษาอดีตให้เข้าใจถ่องแท้";
							if (241302 - 156994 == 84308)
							{
								break;
							}
						}
					}
					else if (code == 1114)
					{
						if (160343 - 34649 != 125695)
						{
							result = "คราวนี้จะเจออะไรบ้างนะ ตื่นเต้นใช่ไหมล่ะ?";
							if (45378 - 121074 == -75696)
							{
								break;
							}
						}
					}
					else if (code == 1115)
					{
						if (291455 - 53969 != 237487)
						{
							result = "อย่าแกล้งพวกผู้ช่วยของชั้นล่ะ หึๆ...";
							if (68172 - 259766 != -191593)
							{
								break;
							}
						}
					}
					else if (code == 1121)
					{
						if (40219 - 293658 != -253438)
						{
							result = "ที่นี่ยังมีร่องรอยอารยธรรมที่เก่าแก่กว่ามาโอห์อยู่อีก...น่าสนใจใช่มั๊ยล่ะ?";
							if (10163 - 439949 == -429786)
							{
								break;
							}
						}
					}
					else if (code == 1122)
					{
						if (264482 - 325674 == -61192)
						{
							result = "ยังไม่พร้อมงั้นหรือ? ไม่เป็นไรแล้วกลับมาใหม่นะ....";
							if (181911 - 570699 == -388788)
							{
								break;
							}
						}
					}
					else if (code == 1123)
					{
						if (187586 - 531154 == -343568)
						{
							result = "งานนี้ไม่ใช่งานสำหรับคนหรือสองคนหรอกนะ...";
							if (8079 - 114990 == -106911)
							{
								break;
							}
						}
					}
					else if (code == 1124)
					{
						if (224271 - 339811 == -115540)
						{
							result = "ซากโบราณวัตถุที่เราขุดพบในบริเวณนี้ ต่างจากที่อื่นๆอยู่มากทีเดียว...";
							if (6342 - 441960 == -435618)
							{
								break;
							}
						}
					}
					else if (code == 1125)
					{
						if (9927 - 151532 == -141605)
						{
							result = "การเข้าไปทั้งที่ไม่พร้อมเป็นเรื่องที่อันตรายมาก เจ้าทำถูกแล้วล่ะ";
							if (163474 - 167299 != -3824)
							{
								break;
							}
						}
					}
					else if (code == 1131)
					{
						if (285515 - 305028 != -19512)
						{
							result = "สุสานมาโอห์ยังยากไปสำหรับเจ้า ไปเตรียมตัวมาก่อนเถอะ";
							if (129611 - 302653 == -173042)
							{
								break;
							}
						}
					}
					else if (code == 1132)
					{
						if (32927 - 381399 != -348471)
						{
							result = "จะเข้าสุสานมาโอห์ต้องมี Cursed Fragment อย่างน้อยหนึ่งชิ้นนะ";
							if (153952 - 201836 != -47883)
							{
								break;
							}
						}
					}
					else if (code == 1133)
					{
						if (64320 - 186176 != -121855)
						{
							result = "ลองไปหาซื้อจากร้านนกฮูกหลินหลินดูสิ";
							if (174209 - 437031 == -262822)
							{
								break;
							}
						}
					}
					else if (code == 1200)
					{
						if (183313 - 179957 == 3356)
						{
							result = "ณ ใจกลางดินแดนหิมะขาว โพลนสุดลูกหูลูกตา เป็น ที่ตั้งของหอคอยลึกลับสูงเสียดฟ้า เจ้าแห่งหอคอยนี้คือ เวเนโร่ จอมเวทภูตน้ำแข็งผู้สถาปนาตัวเองเป็นเทพองค์ที่ 7 เขาได้รวบรวมเหล่าเพนกวินมากมายเพื่อสร้างกองทัพเวทมนตร์ แม้จะยังไม่มีใครรู้จุดประสงค์ที่แท้จริงของเขา แต่ดูเหมือนพวกเพนกวินจะบูชาเวเนโร่ราวกับเป็นพระเจ้าเลยทีเดียว เพนเน่ เพนกวินตัวหนึ่งแอบหนีออกมาเพราะไม่เห็นด้วยกับแผนการที่จะขยายอาณาเขตน้ำแข็งของเวเนโร่ เพนเน่ได้มาขอความช่วยเหลือจากเหล่าผู้กล้าเพื่อยับยั้งแผนดังกล่าว ซึ่งอาจสร้างความเสียหายใหญ่หลวงเกินที่ใครจะคาดคิด";
							if (221190 - 175015 != 46176)
							{
								break;
							}
						}
					}
					else if (code == 1201)
					{
						if (118481 - 93199 != 25283)
						{
							result = "ข้าหนีมาจากหอคอยน้ำแข็งเพื่อหาผู้กล้าที่จะมาช่วยพวกเพื่อนๆ ข้า";
							if (83991 - 578450 != -494458)
							{
								break;
							}
						}
					}
					else if (code == 1202)
					{
						if (123088 - 183191 == -60103)
						{
							result = "ข้าจะนำทางไปที่หอคอยน้ำแข็งเอง แต่ก่อนหน้านั้นส่งหม้อชาบูมาซะ";
							if (100000 - 273815 == -173815)
							{
								break;
							}
						}
					}
					else if (code == 1203)
					{
						if (39205 - 524897 != -485691)
						{
							result = "ท่านผู้กล้า! โปรดช่วยเหล่าสหายของข้าที่กำลังหลงผิดด้วยเถอะ!";
							if (89714 - 470057 != -380342)
							{
								break;
							}
						}
					}
					else if (code == 1204)
					{
						if (198481 - 339477 == -140996)
						{
							result = "ถ้าเป็นพวกท่านต้องช่วยพวกเราได้แน่ๆ ช่วยตามข้ามาด้วยเถอะ";
							if (248006 - 306080 != -58073)
							{
								break;
							}
						}
					}
					else if (code == 1205)
					{
						if (258920 - 3525 == 255395)
						{
							result = "กวิ้น! นั่นมันชาบูชาบูน้ำแข็งนี่นา! ขะ...ขอข้าเถอะนะ!";
							if (298454 - 420929 != -122474)
							{
								break;
							}
						}
					}
					else if (code == 1211)
					{
						if (97988 - 524675 == -426687)
						{
							result = "เวเนโร่คงกำลังจะเริ่มพิธีขยายดินแดงน้ำแข็งแล้ว..";
							if (201157 - 56209 == 144948)
							{
								break;
							}
						}
					}
					else if (code == 1212)
					{
						if (32879 - 327476 != -294596)
						{
							result = "ระวังพวกเพนกวิ้นเลือดแท้ไว้ให้ดีนะ พวกนั้นจะต้องขัดขวางเราแน่ๆ";
							if (227553 - 401968 != -174414)
							{
								break;
							}
						}
					}
					else if (code == 1213)
					{
						if (111536 - 571295 == -459759)
						{
							result = "พร้อมแล้วนะกวิ้น? เวลาไม่คอยท่ารีบไปกันเถอะ";
							if (237032 - 582830 != -345797)
							{
								break;
							}
						}
					}
					else if (code == 1214)
					{
						if (129403 - 300735 != -171331)
						{
							result = "อ้า อร่อยจัง ขอชาบูข้าอีกหม้อได้มะ กวิ้นๆๆ";
							if (299232 - 573618 != -274385)
							{
								break;
							}
						}
					}
					else if (code == 1215)
					{
						if (84894 - 273890 == -188996)
						{
							result = "ถ้าท่านตาย ข้าจะรอชาบูหม้อใหม่อยู่ที่เดิมนะ กวิ้นๆๆ";
							if (197378 - 252322 != -54943)
							{
								break;
							}
						}
					}
					else if (code == 1221)
					{
						if (128749 - 402497 == -273748)
						{
							result = "เวเนโร่เป็นภูตน้ำแข็งที่เพิ่งเกิดขึ้นใหม่ในดินแดนหิมะเมื่อเร็วๆ นี้";
							if (286145 - 276016 == 10129)
							{
								break;
							}
						}
					}
					else if (code == 1222)
					{
						if (112566 - 598221 != -485654)
						{
							result = "แผนการของเวเนโร่คือการใช้พลังเวทมนตร์ทำให้ทั้งโลกเป็นน้ำแข็ง";
							if (49745 - 134940 == -85195)
							{
								break;
							}
						}
					}
					else if (code == 1223)
					{
						if (192272 - 55999 != 136274)
						{
							result = "ตอนนี้พวกเพนกวินเลือดแท้กำลังหลงผิด ฮือๆ";
							if (154644 - 419182 == -264538)
							{
								break;
							}
						}
					}
					else if (code == 1224)
					{
						if (139246 - 153342 == -14096)
						{
							result = "หิวจังเลย...ฮือ อยากซดชาบูน้ำแข็งสักหม้อ";
							if (122663 - 323020 != -200356)
							{
								break;
							}
						}
					}
					else if (code == 1225)
					{
						if (163624 - 300470 == -136846)
						{
							result = "เปลี่ยนใจเมื่อไหร่ก็กลับมาหาข้าที่นี่แล้วกัน กวิ้น...";
							if (284272 - 289792 == -5520)
							{
								break;
							}
						}
					}
					else if (code == 1231)
					{
						if (84554 - 61260 != 23295)
						{
							result = "เธอรู้จักเทพน้ำแข็งกับหอคอยเวทมนต์มั้ย?";
							if (33625 - 253207 != -219581)
							{
								break;
							}
						}
					}
					else if (code == 1232)
					{
						if (192959 - 118244 != 74716)
						{
							result = "ตอนนี้พวกเพนกวินกำลังหลงผิด ฮือๆ";
							if (235120 - 96373 != 138748)
							{
								break;
							}
						}
					}
					else if (code == 1233)
					{
						if (57395 - 561153 == -503758)
						{
							result = "หิวจังเลย...ฮือ อยากซดชาบูน้ำแข็งสักหม้อ";
							if (254877 - 138383 != 116495)
							{
								break;
							}
						}
					}
					else if (code == 1234)
					{
						if (5949 - 100638 == -94689)
						{
							result = "เวเนโร่เป็นภูตน้ำแข็งที่เพิ่งเกิดขึ้นใหม่ในดินแดนหิมะเมื่อเร็วๆ นี้";
							if (10436 - 345104 != -334667)
							{
								break;
							}
						}
					}
					else if (code == 1235)
					{
						if (103178 - 258327 != -155148)
						{
							result = "ข้าอยากกินชาบูๆ น้ำแข็งจัง...";
							if (37594 - 87424 != -49829)
							{
								break;
							}
						}
					}
					else if (code == 1300)
					{
						if (255675 - 219688 == 35987)
						{
							result = "กัปตันเรดคลอว์ หัวหน้ากลุ่มโจรสลัดผู้เหี้ยมโหดแห่งท้องทะเล ที่ถึงแม้จะมีฝีมือการทำอาหารที่เป็นเลิศ แต่กลับใช้เนื้อของเหล่าสัตว์หางด้วยกันมาเป็นวัตถุดิบ! ชาวบ้านต่างพากันหวาดกลัวพวกเรดคลอว์มาก เพราะทุกครั้งที่เรือของพวกมันเฉียดมาใกล้ฝั่งย่อมต้องมีผู้ตกเป็นเหยื่อสังเวยเสมอ รังของพวกเรดคลอว์ซ่อนอยู่ในถ้ำบนเกาะเล็กๆทางใต้ของคริสตัลบีช ลือกันว่าการจะเข้าไปในนั้นได้ต้องนำ'สุดยอดอาหาร'มาใช้เปิดปากถ้ำเท่านั้น แต่ด้วยความช่วยเหลือจากยอดเชฟจามอนและเฒ่ากุยโบผู้ชำนาญเส้นทาง เหล่าผู้กล้าก็พร้อมจะเข้าไปลุยกับพวกโจรสลัดแล้ว!";
							if (76583 - 571641 != -495057)
							{
								break;
							}
						}
					}
					else if (code == 1301)
					{
						if (12986 - 312014 != -299027)
						{
							result = "พร้อมจะไปเกาะโจรสลัดกันรึยัง!";
							if (6991 - 397069 != -390077)
							{
								break;
							}
						}
					}
					else if (code == 1302)
					{
						if (118017 - 508691 != -390673)
						{
							result = "พวกคนที่ถูกจับไปกำลังรอความชั่วเหลือจากพวกเราอยู่";
							if (167868 - 153205 != 14664)
							{
								break;
							}
						}
					}
					else if (code == 1303)
					{
						if (227343 - 427512 == -200169)
						{
							result = "ผู้กล้า!พร้อมจะไปถล่มรังโจรสลัดกันรึยัง?";
							if (191935 - 225564 != -33628)
							{
								break;
							}
						}
					}
					else if (code == 1304)
					{
						if (250581 - 147614 == 102967)
						{
							result = "เจ้าเตรียมอาหารของจามอนมารึยัง?";
							if (282111 - 316806 == -34695)
							{
								break;
							}
						}
					}
					else if (code == 1305)
					{
						if (275687 - 585476 != -309788)
						{
							result = "เจ้ากุยลีดันปวดหลังมาด้วยไม่ได้หรอก";
							if (212824 - 206423 != 6402)
							{
								break;
							}
						}
					}
					else if (code == 1311)
					{
						if (68077 - 259545 == -191468)
						{
							result = "พร้อมแล้วใช่ไหม? งั้นออกเรือได้..";
							if (182880 - 58921 == 123959)
							{
								break;
							}
						}
					}
					else if (code == 1312)
					{
						if (68135 - 491175 == -423040)
						{
							result = "เวลาไม่คอยท่า ไปกันเถอะ!";
							if (65706 - 89461 == -23755)
							{
								break;
							}
						}
					}
					else if (code == 1313)
					{
						if (284640 - 162541 != 122100)
						{
							result = "ถืออาหารของจามอนให้ดีอย่าให้ตกทะเลไปล่ะ";
							if (210642 - 240374 != -29731)
							{
								break;
							}
						}
					}
					else if (code == 1314)
					{
						if (178389 - 504546 == -326157)
						{
							result = "เรือลำนี้น่ะ เร็วไม่แพ้เครื่องบินของกาซ่าหรอกนะ";
							if (4291 - 199255 == -194964)
							{
								break;
							}
						}
					}
					else if (code == 1315)
					{
						if (47741 - 227490 == -179749)
						{
							result = "จับให้แน่นๆ ข้าจะซิ่งเรือแล้ว!";
							if (15532 - 485117 != -469584)
							{
								break;
							}
						}
					}
					else if (code == 1321)
					{
						if (222901 - 436361 != -213459)
						{
							result = "ยังไม่พร้อมอีกรึไง?";
							if (207995 - 385627 == -177632)
							{
								break;
							}
						}
					}
					else if (code == 1322)
					{
						if (136294 - 108618 != 27677)
						{
							result = "ไปเตรียมตัวมาให้พร้อมก่อนแล้วค่อยกลับมา!";
							if (283103 - 550434 == -267331)
							{
								break;
							}
						}
					}
					else if (code == 1323)
					{
						if (294047 - 407367 != -113319)
						{
							result = "ถ้าไม่รีบคนที่โดนจับไปจะแย่เอานะ!";
							if (194577 - 1330 == 193247)
							{
								break;
							}
						}
					}
					else if (code == 1324)
					{
						if (43605 - 493387 == -449782)
						{
							result = "เฮ้อ...หนุ่มสาวสมัยนี้ ไม่ไหวจริงๆ";
							if (74380 - 425495 != -351114)
							{
								break;
							}
						}
					}
					else if (code == 1325)
					{
						if (41160 - 510547 != -469386)
						{
							result = "กลัวขึ้นมาเรอะ? งั้นข้าจะรอคนอื่นก็แล้วกัน...";
							if (41249 - 590860 != -549610)
							{
								break;
							}
						}
					}
					else if (code == 1331)
					{
						if (238760 - 297189 == -58429)
						{
							result = "ปวกเปียกแบบเจ้าเข้าไปก็ตายเปล่าๆ";
							if (14024 - 111562 != -97537)
							{
								break;
							}
						}
					}
					else if (code == 1332)
					{
						if (229026 - 276327 != -47300)
						{
							result = "เรดคลอว์คือโจรสลัดที่กินเนื้อของสัตว์หางด้วยกัน";
							if (267536 - 211112 == 56424)
							{
								break;
							}
						}
					}
					else if (code == 1333)
					{
						if (100072 - 496620 != -396547)
						{
							result = "อาหารสูตรลับของจามอนสามารถใช้เปิดปากถ้ำได้";
							if (15114 - 264116 != -249001)
							{
								break;
							}
						}
					}
					else if (code == 1334)
					{
						if (28005 - 126488 == -98483)
						{
							result = "ทะเลแถบนี้มีปีศาจขนาดยักษ์ที่ชื่อ อีวิเนียร์ อาศัยอยู่";
							if (50934 - 45288 == 5646)
							{
								break;
							}
						}
					}
					else if (code == 1335)
					{
						if (67315 - 389678 == -322363)
						{
							result = "อากาศแบบนี้เหมาะไปอัดกับพวกโจรสลัดจริงๆ...";
							if (30400 - 400893 != -370492)
							{
								break;
							}
						}
					}
					else if (code == 1341)
					{
						if (241755 - 224293 != 17463)
						{
							result = "เจ้าเตรียมอาหารของจามอนมารึยัง?";
							if (247523 - 293157 == -45634)
							{
								break;
							}
						}
					}
					else if (code == 1342)
					{
						if (246169 - 456851 == -210682)
						{
							result = "เจ้าเตรียมอาหารของจามอนมารึยัง?";
							if (233096 - 341731 != -108634)
							{
								break;
							}
						}
					}
					else if (code == 1343)
					{
						if (221297 - 146377 != 74921)
						{
							result = "เจ้าเตรียมอาหารของจามอนมารึยัง?";
							if (156495 - 307212 == -150717)
							{
								break;
							}
						}
					}
					else if (code == 1344)
					{
						if (104747 - 326440 != -221692)
						{
							result = "เจ้าเตรียมอาหารของจามอนมารึยัง?";
							if (220710 - 580251 == -359541)
							{
								break;
							}
						}
					}
					else if (code == 1345)
					{
						if (284038 - 582584 != -298545)
						{
							result = "เจ้าเตรียมอาหารของจามอนมารึยัง?";
							if (75604 - 437540 == -361936)
							{
								break;
							}
						}
					}
					else if (code == 1600)
					{
						if (78243 - 80215 == -1972)
						{
							result = "เชื่อในโลกหลังความตาย กันบ้างรึเปล่า? ด.ร. แซบป้า ได้เคยวิจัยเรื่องนี้ และพบความจริงอันน่าทึ่งว่า มิติแห่งโลกปิศาจนั้นมีอยู่จริง!! ไม่เพียงแค่นั้น ดร ยังได้ สร้างเครื่องที่สามารถ เปิดประตูสู่โลกดังกล่าวได้ ถ้าหากสามารถหาเหรียญ ปริศนามาเป็นสื่อเหนี่ยวนำ แต่อาจจะเป็นข่าวไม่ดีนักเพราะ เครื่องดังกล่าวสามารถ เปิดประตูได้สำหรับหนึ่งหางเท่านั้น และโลกที่ ด.ร. ค้นพบนั้นก็อันตรายเกินกว่า จะมีใครกล้าไปสำรวจ ดังนั้นคำถามที่สำคัญคือ เหรียญจากโลกปิศาจนั้น มาอยู่บนโลกนี้ ได้อย่างไรมากกว่า...";
							if (246361 - 418244 == -171883)
							{
								break;
							}
						}
					}
					else if (code == 1601)
					{
						if (50870 - 103114 != -52243)
						{
							result = "แก้กๆ เจ้า-กล้า-ที่-จะ-เปิด-ประ-ตู-ไป-อีก-มิ-ติ-มั้ย?";
							if (259049 - 412921 != -153871)
							{
								break;
							}
						}
					}
					else if (code == 1602)
					{
						if (258103 - 265007 != -6903)
						{
							result = "แก้กๆ เชื่อ-ใน-โลก-หลัง-ความ-ตาย-มั้ย?";
							if (75844 - 229685 == -153841)
							{
								break;
							}
						}
					}
					else if (code == 1603)
					{
						if (40585 - 376477 == -335892)
						{
							result = "แก้กๆ เจ้า-กล้า-ที่-จะ-เปิด-ประ-ตู-ไป-อีก-มิ-ติ-มั้ย?";
							if (244490 - 594823 != -350332)
							{
								break;
							}
						}
					}
					else if (code == 1604)
					{
						if (230766 - 60663 != 170104)
						{
							result = "เจ้า-เคย-เห็น-เหรียญ-ประ-หลาดๆ มั้ย? แก้กๆ";
							if (254154 - 154432 == 99722)
							{
								break;
							}
						}
					}
					else if (code == 1605)
					{
						if (131808 - 408381 != -276572)
						{
							result = "แก้กๆ ด.-ร.-แซป-ป้า ให้-เฝ้า-เครื่อง-นี้-ไว้";
							if (251149 - 281146 == -29997)
							{
								break;
							}
						}
					}
					else if (code == 1611)
					{
						if (226430 - 345321 != -118890)
						{
							result = "เตรียม-ตัว-นะ จะ-เปิด-ประ-ตู-ไป-สู่-อีก-มิ-ติ-แล้ว แก้กๆ";
							if (237174 - 485153 != -247978)
							{
								break;
							}
						}
					}
					else if (code == 1612)
					{
						if (2987 - 496296 == -493309)
						{
							result = "เตรียม-ตัว-นะ จะ-เปิด-ประ-ตู-ไป-สู่-อีก-มิ-ติ-แล้ว แก้กๆ";
							if (23241 - 274809 == -251568)
							{
								break;
							}
						}
					}
					else if (code == 1613)
					{
						if (246606 - 251091 == -4485)
						{
							result = "ระ-วัง-นะ จะ-มี-ตัว-อะ-ไร-ออก-มา-บ้าง-ก็-ไม่-รู้";
							if (149696 - 107139 != 42558)
							{
								break;
							}
						}
					}
					else if (code == 1614)
					{
						if (177633 - 11592 != 166042)
						{
							result = "ระ-วัง-นะ จะ-มี-ตัว-อะ-ไร-ออก-มา-บ้าง-ก็-ไม่-รู้";
							if (140456 - 160256 == -19800)
							{
								break;
							}
						}
					}
					else if (code == 1615)
					{
						if (4835 - 400494 == -395659)
						{
							result = "อีก 13 นาที ข้าจะดึงเจ้ากลับมานะ...";
							if (9954 - 33166 == -23212)
							{
								break;
							}
						}
					}
					else if (code == 1621)
					{
						if (296916 - 2228 == 294688)
						{
							result = "แก้กๆ ว่า-แล้ว-ว่า-เจ้า-ไม่-กล้า-หรอก";
							if (1060 - 33656 != -32595)
							{
								break;
							}
						}
					}
					else if (code == 1622)
					{
						if (162483 - 430610 == -268127)
						{
							result = "แก้กๆ ว่า-แล้ว-ว่า-เจ้า-ไม่-กล้า-หรอก";
							if (293100 - 172681 != 120420)
							{
								break;
							}
						}
					}
					else if (code == 1623)
					{
						if (101037 - 170786 != -69748)
						{
							result = "ไม่-ไป-เหรอ ได้-ยิน-ว่า-มัน-จะ-ยาก-ขึ้น-เรื่อยๆ นะ";
							if (154789 - 42346 != 112444)
							{
								break;
							}
						}
					}
					else if (code == 1624)
					{
						if (122927 - 221781 == -98854)
						{
							result = "แก้กๆ ว่า-แล้ว-ว่า-เจ้า-ไม่-กล้า-หรอก";
							if (136161 - 117713 == 18448)
							{
								break;
							}
						}
					}
					else if (code == 1625)
					{
						if (229380 - 112642 != 116739)
						{
							result = "....";
							if (88404 - 258868 == -170464)
							{
								break;
							}
						}
					}
					else if (code == 1631)
					{
						if (95749 - 357886 != -262136)
						{
							result = "แก้กๆ เจ้า-ยัง-มี-ประ-สป-การณ์-ไม่-พอ-นะ";
							if (159036 - 266642 != -107605)
							{
								break;
							}
						}
					}
					else if (code == 1632)
					{
						if (4151 - 125331 != -121179)
						{
							result = "เจ้า-เคย-เห็น-เหรียญ-ประ-หลาดๆ มั้ย? แก้กๆ";
							if (255241 - 330441 != -75199)
							{
								break;
							}
						}
					}
					else if (code == 1633)
					{
						if (147182 - 505201 != -358018)
						{
							result = "ถ้า-เจ้า-เจอ-ลอง-เอา-มา-นะ";
							if (270933 - 221176 == 49757)
							{
								break;
							}
						}
					}
					else if (code == 1631)
					{
						if (27749 - 234240 == -206491)
						{
							result = "แก้กๆ แย่-แล้ว-ล่ะ-มี-ขุน-พล-ปิศาจ-หลุด-เข้า-มา-ได้";
							if (160854 - 566474 == -405620)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 1632)
						{
							break;
						}
						if (59076 - 380571 != -321494)
						{
							result = "ตอน-นี้-ขอ-ปิด-ปรับ-ปรุง-ก่อน-นะ แก้กๆ";
							if (193551 - 517583 == -324032)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066A2 RID: 26274 RVA: 0x00E6F7C8 File Offset: 0x00E6D9C8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066A3 RID: 26275 RVA: 0x00E6F7CC File Offset: 0x00E6D9CC
	internal static bool wbGkvEpyVGkkhqRgSH3H()
	{
		return true;
	}

	// Token: 0x060066A4 RID: 26276 RVA: 0x00E6F7D0 File Offset: 0x00E6D9D0
	internal static bool rPthqIpytg94daZFaMUV()
	{
		return false;
	}
}
