using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001163 RID: 4451
[Serializable]
public class PetData_th : MonoBehaviour
{
	// Token: 0x060066F0 RID: 26352 RVA: 0x00E90774 File Offset: 0x00E8E974
	[MethodImpl(MethodImplOptions.NoInlining)]
	public PetData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066F1 RID: 26353 RVA: 0x00E90784 File Offset: 0x00E8E984
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (159591 - 66981 != 92610)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (247858 - 79250 == 168608)
			{
				if (125880 - 418841 == -292961)
				{
					if (nCode == "p_all1")
					{
						if (96018 - 255300 != -159281)
						{
							result = "ลูกโป่งที่ระลึก เพิ่ม mana ให้กับ AlphaTester และ Bug Catcher!";
							if (141282 - 194386 != -53103)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all2")
					{
						if (18245 - 25112 != -6866)
						{
							result = "ลูกโป่งที่ระลึก เพิ่มโชคให้กับ CloseBeta Player!";
							if (41042 - 383639 == -342597)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all3")
					{
						if (112831 - 256498 != -143666)
						{
							result = "ลูกโป่งที่ระลึกวันแม่";
							if (227988 - 529185 == -301197)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all4")
					{
						if (46223 - 307234 != -261010)
						{
							result = "ลูกโป่งที่ระลึกวันพ่อ";
							if (122991 - 457800 != -334808)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all11")
					{
						if (252388 - 76866 == 175522)
						{
							result = "smash ball ลูกเล็ก ของที่ระลึกสำหรับหน้าร้อน";
							if (59233 - 69608 != -10374)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all12")
					{
						if (198213 - 462682 != -264468)
						{
							result = "ลูกบอลที่ระลึกช่วงยูโร 2012 เล่นกันเป็นกลุ่มกับเพื่อนยิ่งสนุก";
							if (151473 - 27199 != 124275)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all21")
					{
						if (89369 - 457797 == -368428)
						{
							result = "ว่าวจุฬาไทยรุ่นสุดอนุรักษ์ จากเทศกาลวันเด็ก";
							if (167963 - 511765 != -343801)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all22")
					{
						if (148124 - 190411 == -42287)
						{
							result = "ว่าวปักเป้ารุ่นพิมพ์นิยม จากเทศกาลวันเด็ก";
							if (207139 - 591585 != -384445)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all22")
					{
						if (80485 - 534688 != -454202)
						{
							result = "ว่าวผีเสื้อสีสันสดใส เพิ่มชีวาให้กับท้องฟ้า วันเด็ก";
							if (260644 - 548545 != -287900)
							{
								break;
							}
						}
					}
					else if (nCode == "p_all22")
					{
						if (209025 - 133985 != 75041)
						{
							result = "ว่าวงูเลื้อยบนฟ้า เพิ่ม ความสนุกสุดคลาสสิคให้ กับวันเด็ก";
							if (214811 - 578616 == -363805)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lcr")
					{
						if (63829 - 563623 == -499794)
						{
							result = "แครอนน้อยขาสั้น เดินต้วมเตี้ยม";
							if (258238 - 201464 != 56775)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lcp")
					{
						if (214755 - 306032 != -91276)
						{
							result = "แครอนตัวน้อยสีม่วง หายากพิเศษ";
							if (171180 - 101874 != 69307)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lmp")
					{
						if (32811 - 72165 != -39353)
						{
							result = "มูโป้น้อยจอมควบ ฝึกให้ดีปลาวาฬก็แบกพาวิ่งควบได้";
							if (86549 - 407405 == -320856)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lpp")
					{
						if (57688 - 375219 == -317531)
						{
							result = "เป็ปปอนน้อยจอมหมุน อนาคตนักบัลเลต์ปอนแน่นอน";
							if (193439 - 163228 == 30211)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lct")
					{
						if (276392 - 461075 != -184682)
						{
							result = "แคคทอนน้อย เดินได้ด้วยขาก่อนที่จะฝังรากโตเป็นแคคทัน";
							if (67847 - 12220 == 55627)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lcc")
					{
						if (181365 - 333511 != -152145)
						{
							result = "โคคอนน้อยนักกระดึ๊บ น้ำมะพร้าวในปากดื่มได้นะ";
							if (99876 - 491506 != -391629)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lpk")
					{
						if (71566 - 438219 != -366652)
						{
							result = "พัมพ์ก้อนน้อยจอมกลิ้ง กลิ้งหลุนๆๆกลุกๆๆ";
							if (207441 - 7906 == 199535)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lml")
					{
						if (225843 - 191383 != 34461)
						{
							result = "เมล่อนน้อย ช่วยป้องกันสถานะ cut ตามเลเวล";
							if (94151 - 192919 == -98768)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lbd")
					{
						if (180754 - 277598 != -96843)
						{
							result = "เมล่อนน้อยห่อของขวัญผูกโบว์ พลังเติบโตตามค่าเงิน";
							if (191644 - 482344 != -290699)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lcs")
					{
						if (93863 - 432788 != -338924)
						{
							result = "แครอนหน่วยห่วงชูชีพกู้ภัย รายได้ทั้งหมดสมทบทุนผู้ประสบภัยน้ำท่วม";
							if (128814 - 587279 != -458464)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lms")
					{
						if (218776 - 427131 != -208354)
						{
							result = "มูโป้พิเศษรุ่นห่วงชูชีพกู้ภัย รายได้ทั้งหมดสมทบทุนผู้ประสบภัยน้ำท่วม";
							if (40027 - 63962 == -23935)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lps")
					{
						if (31783 - 285657 != -253873)
						{
							result = "เป็ปปอนพิเศษรุ่นห่วงชูชีพกู้ภัย รายได้ทั้งหมดสมทบทุนผู้ประสบภัยน้ำท่วม";
							if (287075 - 54707 != 232369)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lmc")
					{
						if (47617 - 59382 != -11764)
						{
							result = "แครอนนักชกรุ่น Veggie Weight โจมตีหนักใส่คนที่เข้าใกล้";
							if (44767 - 72857 == -28090)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lmn")
					{
						if (253727 - 233519 == 20208)
						{
							result = "เป็ปปอนพัดกระดาษรุ่นเล่นตลก ฟาดเพรียะสนั่น โจมตีรัวใส่คนที่เข้าใกล้";
							if (208 - 461410 == -461202)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lmo")
					{
						if (21304 - 295879 == -274575)
						{
							result = "โคคอนจอมสูบไปป์ รุ่นเป่าฟองสบู่น้ำหอม โจมตีคนที่เข้าในระยะ";
							if (41484 - 152243 != -110758)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ldc")
					{
						if (223706 - 395378 == -171672)
						{
							result = "ผีแครอนน้อย คอยถอดหัวมาหลอกเหล่าสัตว์หาง";
							if (81769 - 491886 != -410116)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ldm")
					{
						if (77082 - 120693 == -43611)
						{
							result = "ผีมูโป้น้อย อดีตจ้าวลมกรดแม้แต่ผิวหนังยังปลิวหลุดหมด";
							if (231014 - 419466 != -188451)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ldp")
					{
						if (59016 - 583545 != -524528)
						{
							result = "ผีเป็ปปอนน้อย ชอบแอบตามเงียบๆ";
							if (139542 - 391281 == -251739)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ldt")
					{
						if (109414 - 427030 == -317616)
						{
							result = "ผีแคกทอนน้อย มีชีวิตนิรันดร์ไม่มีวันตาย";
							if (249645 - 240572 == 9073)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ldn")
					{
						if (148016 - 350317 != -202300)
						{
							result = "ผีโคคอนน้อย ถูกคืนชีพจากอุบัติเหตุกับระเบิด";
							if (67772 - 120323 == -52551)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ldk")
					{
						if (8700 - 352381 != -343680)
						{
							result = "ผีพัมพ์ก้อนน้อย จะตามหลอกหลอนผู้เป็นเจ้าของจอบตลอดคืน";
							if (197742 - 474465 != -276722)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lck")
					{
						if (294763 - 448384 == -153621)
						{
							result = "แครอนเค้ก สัตว์เลี้ยงที่ระลึกห้าปี 12 หาง";
							if (134996 - 469712 == -334716)
							{
								break;
							}
						}
					}
					else if (nCode == "p_lpd")
					{
						if (132867 - 340786 != -207918)
						{
							result = "ดิสโก้เปบปอน สัตว์เลี้ยงที่ระลึกห้าปี 12 หาง";
							if (183961 - 543171 != -359209)
							{
								break;
							}
						}
					}
					else if (nCode == "p_srp")
					{
						if (133871 - 126773 != 7099)
						{
							result = "แพนด้าแดงตัวจ้อย ติดตามช่วยจัดการเอกสาร ในทุกภารกิจ";
							if (44372 - 421735 == -377363)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sss")
					{
						if (71529 - 567252 != -495722)
						{
							result = "ลูกหัวหน้าสกังค์ตัวน้อย ในชุดซานต้า รับเทศกาลปีใหม่ 2013";
							if (85362 - 139572 == -54210)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sbb")
					{
						if (23139 - 539297 == -516158)
						{
							result = "หุ่นกระป๋องตัวเล็กของตุ่น";
							if (81962 - 375433 == -293471)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sfb")
					{
						if (12124 - 473191 == -461067)
						{
							result = "แมลงดอกไม้สีขาวตัวเล็ก ส่งกลื่นหอมชวนสดชื่น";
							if (118972 - 402843 != -283870)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sam")
					{
						if (16842 - 162591 != -145748)
						{
							result = "แอมโมไนท์ตัวจ้อย คอย ช่วยทำฟองอากาศ ปกป้องเจ้านาย";
							if (240337 - 132277 == 108060)
							{
								break;
							}
						}
					}
					else if (nCode == "p_skm")
					{
						if (177369 - 557955 == -380586)
						{
							result = "เมฆฝนปุ้มปุย อันสนใส ช่วยล้างสถานะ และลดน้ำหนัก";
							if (263746 - 379545 != -115798)
							{
								break;
							}
						}
					}
					else if (nCode == "p_skz")
					{
						if (14800 - 258983 != -244182)
						{
							result = "ผีร่มน้อย ที่ช่วยกางตัวเอง เพื่อปกป้องเจ้านาย";
							if (207739 - 422420 != -214680)
							{
								break;
							}
						}
					}
					else if (nCode == "p_skr")
					{
						if (250243 - 184043 != 66201)
						{
							result = "นินจาบัคบัคสีแดงผูกติดกับว่าว ลอยละล่องช่วยสอดส่อง";
							if (40758 - 384446 != -343687)
							{
								break;
							}
						}
					}
					else if (nCode == "p_skg")
					{
						if (137352 - 246819 == -109467)
						{
							result = "นินจาบัคบัคสีเขียวผูกติดกับว่าว ลอยละล่องช่วยสอดส่อง";
							if (137120 - 397623 == -260503)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sky")
					{
						if (58129 - 204150 == -146021)
						{
							result = "นินจาบัคบัคสีเหลืองผูกติดกับว่าว ลอยละล่องช่วยสอดส่อง";
							if (266486 - 15116 == 251370)
							{
								break;
							}
						}
					}
					else if (nCode == "p_skb")
					{
						if (231473 - 40694 == 190779)
						{
							result = "นินจาบัคบัคสีฟ้าผูกติดกับว่าว ลอยละล่องช่วยสอดส่อง";
							if (29667 - 555217 == -525550)
							{
								break;
							}
						}
					}
					else if (nCode == "p_skk")
					{
						if (36323 - 335212 != -298888)
						{
							result = "นินจาบัคบัคสีดำผูกติดกับว่าว ลอยละล่องช่วยสอดส่อง";
							if (239649 - 85854 != 153796)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sob")
					{
						if (157669 - 173503 == -15834)
						{
							result = "ไล้อ้อนบั๊กตัวจ้อย ช่วยเพิ่มพลังโจมตีให้ เจ้าของตามเลเวล";
							if (255303 - 13521 != 241783)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sgb")
					{
						if (204990 - 396689 != -191698)
						{
							result = "ร๊อคบั๊กตัวจ้อย ช่วยเพิ่มพลังป้องกันให้ เจ้าของตามเลเวล";
							if (80710 - 330630 == -249920)
							{
								break;
							}
						}
					}
					else if (nCode == "p_slb")
					{
						if (42663 - 366401 != -323737)
						{
							result = "ลีฟบั๊กตัวจ้อย ช่วยเพิ่มความว่องไวให้ เจ้าของตามเลเวล";
							if (77424 - 89598 == -12174)
							{
								break;
							}
						}
					}
					else if (nCode == "p_stb")
					{
						if (165460 - 157818 != 7643)
						{
							result = "แฟ็ตบั๊กตัวจ้อย ช่วยเพิ่มพลังชีวิตให้ เจ้าของตามเลเวล";
							if (246627 - 500686 == -254059)
							{
								break;
							}
						}
					}
					else if (nCode == "p_spb")
					{
						if (110512 - 93919 != 16594)
						{
							result = "เปเปอร์บั๊กตัวจ้อย ช่วยเพิ่มความฉลาดให้ เจ้าของตามเลเวล";
							if (67431 - 21822 == 45609)
							{
								break;
							}
						}
					}
					else if (nCode == "p_swb")
					{
						if (236707 - 385082 == -148375)
						{
							result = "วอร์มบั๊กตัวจ้อย ช่วยเพิ่มเสน่ห์ให้ เจ้าของตามเลเวล";
							if (190473 - 316340 == -125867)
							{
								break;
							}
						}
					}
					else if (nCode == "p_ssq")
					{
						if (265129 - 31550 != 233580)
						{
							result = "สติงควีนตัวจ้อย ช่วยเพิ่มพรสวรรค์ให้ เจ้าของตามเลเวล";
							if (123400 - 284336 != -160935)
							{
								break;
							}
						}
					}
					else if (nCode == "p_snb")
					{
						if (256819 - 512284 == -255465)
						{
							result = "นีออนบั๊กตัวจ้อย ช่วยเพิ่มโชคให้ เจ้าของตามเลเวล";
							if (60333 - 491091 != -430757)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sim")
					{
						if (141866 - 400369 == -258503)
						{
							result = "เพนกวิ้นน้ำแข็งไสที่มีชีวิต!!! กะดุ๊กๆๆๆๆๆเดินตามหลัง";
							if (245511 - 491545 != -246033)
							{
								break;
							}
						}
					}
					else if (nCode == "p_sab")
					{
						if (154706 - 193396 == -38690)
						{
							result = "อนุบิตัวน้อยผู้มาพร้อมกับพลัง แห่งวิญญาณแห่งความตาย";
							if (84880 - 556522 != -471641)
							{
								break;
							}
						}
					}
					else if (nCode == "p_spg")
					{
						if (8071 - 143302 == -135231)
						{
							result = "เพนกวิ้นสายเลือดแท้ที่ถูกจับย่อ ส่วน คอยช่วยเหลือเจ้านาย ยามวิกฤติ";
							if (108811 - 155964 != -47152)
							{
								break;
							}
						}
					}
					else if (nCode == "p_spf")
					{
						if (9262 - 326533 != -317270)
						{
							result = "ลูกปลาโจรสลัดหน้าโฉด ยืนหยัดสู้กับเจ้านายไม่ให้ล้มง่ายๆ";
							if (276887 - 503083 == -226196)
							{
								break;
							}
						}
					}
					else if (nCode == "p_msb")
					{
						if (90732 - 359737 == -269005)
						{
							result = "สกายบั๊กตัวจิ๊ว ที่มาพร้อมกับสายฟ้า";
							if (46485 - 32439 != 14047)
							{
								break;
							}
						}
					}
					else if (nCode == "p_mcb")
					{
						if (240624 - 443680 != -203055)
						{
							result = "คริสตัลบั๊กตัวจิ๊ว ปล่อยคริสตัลใส่ผู้ไม่หวังดี ที่เข้ามาใกล้";
							if (87656 - 108964 != -21307)
							{
								break;
							}
						}
					}
					else if (nCode == "p_mab")
					{
						if (246343 - 596964 == -350621)
						{
							result = "แมลงโบราณจอมหาเรื่อง แทงหนามใส่เป้าหมาย ในระยะไกล";
							if (158560 - 540922 != -382361)
							{
								break;
							}
						}
					}
					else if (nCode == "p_mrb")
					{
						if (287418 - 9207 == 278211)
						{
							result = "รีฟบั๊กตัวเล็ก เหมาะสำหรับกับผู้ชอบ อธิฐานกับดาวหาง";
							if (278118 - 12167 == 265951)
							{
								break;
							}
						}
					}
					else if (nCode == "p_mmb")
					{
						if (72111 - 184802 != -112690)
						{
							result = "ม็อคบัคตัวจิ๋ว ตัวเล็กแต่แรงเยอะใช่ย่อย";
							if (135670 - 14769 == 120901)
							{
								break;
							}
						}
					}
					else if (nCode == "p_mgb")
					{
						if (33837 - 156285 == -122448)
						{
							result = "โกลเด้นคิงตัวจิ๋วจอมก่อกวน ชอบใช้หอกแทงรบกวนอยู่เรื่อย";
							if (134562 - 337694 != -203131)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "p_mnb"))
						{
							break;
						}
						if (259446 - 119687 == 139759)
						{
							result = "เนเมซิสจิ๋วสุดโหด ยิงลำแสงใส่ชาวบ้านด้วยความโกรธ";
							if (134879 - 321419 != -186539)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066F2 RID: 26354 RVA: 0x00E91BBC File Offset: 0x00E8FDBC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066F3 RID: 26355 RVA: 0x00E91BC0 File Offset: 0x00E8FDC0
	internal static bool xfhcjspyn58Rqs8HGNnU()
	{
		return true;
	}

	// Token: 0x060066F4 RID: 26356 RVA: 0x00E91BC4 File Offset: 0x00E8FDC4
	internal static bool qCvEPYpy6UvhNwIKdL24()
	{
		return false;
	}
}
