using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011CE RID: 4558
[Serializable]
public class Q13_PantherParty_thai : MonoBehaviour
{
	// Token: 0x06006907 RID: 26887 RVA: 0x00EDAF20 File Offset: 0x00ED9120
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q13_PantherParty_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006908 RID: 26888 RVA: 0x00EDAF30 File Offset: 0x00ED9130
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (206002 - 570447 != -364444)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (198602 - 170097 != 28506)
			{
				if (108666 - 146100 == -37434)
				{
					if (code == 1301)
					{
						if (85419 - 464770 == -379351)
						{
							result = "ว่าไง คุณผู้กล้า~";
							if (142868 - 41028 != 101841)
							{
								break;
							}
						}
					}
					else if (code == 1302)
					{
						if (19782 - 134639 == -114857)
						{
							result = "คราวนี้ไม่ใช่งานท้าทายอะไรไม่ต้องห่วง";
							if (183728 - 303959 != -120230)
							{
								break;
							}
						}
					}
					else if (code == 1303)
					{
						if (189690 - 293658 != -103967)
						{
							result = "ข้าแค่อยากจะให้เจ้าช่วยหาเครื่องดื่มมาเตรียมไว้";
							if (271873 - 420853 != -148979)
							{
								break;
							}
						}
					}
					else if (code == 1304)
					{
						if (272224 - 570024 == -297800)
						{
							result = "สำหรับปาร์ตี้ก่อนที่พวกเราจะเลิกงานเท่านั้น";
							if (212634 - 147399 == 65235)
							{
								break;
							}
						}
					}
					else if (code == 1305)
					{
						if (87920 - 246598 != -158677)
						{
							result = "เอาเป็นนมแล้วกัน ข้าต้องการนม 4 ขวด";
							if (174976 - 550428 != -375451)
							{
								break;
							}
						}
					}
					else if (code == 1306)
					{
						if (85962 - 216522 != -130559)
						{
							result = "งานง้าย~ง่ายแบบนี้ดูเหมาะกับเจ้าดีนะ";
							if (225224 - 216111 != 9114)
							{
								break;
							}
						}
					}
					else if (code == 1311)
					{
						if (247883 - 365284 != -117400)
						{
							result = "วันนี้เป็นวันสำคัญสำหรับพวกเรา";
							if (70931 - 503445 != -432513)
							{
								break;
							}
						}
					}
					else if (code == 1312)
					{
						if (72402 - 137902 == -65500)
						{
							result = "เพื่อนข้าอยากจะได้เครื่องดื่มมาพร้อม";
							if (137362 - 29285 == 108077)
							{
								break;
							}
						}
					}
					else if (code == 1313)
					{
						if (137504 - 438825 == -301321)
						{
							result = "เพื่อที่จะฉลองได้ทันทีหลังเลิกงาน";
							if (41154 - 539533 != -498378)
							{
								break;
							}
						}
					}
					else if (code == 1314)
					{
						if (251536 - 17017 == 234519)
						{
							result = "ช่วยหน่อยแล้วกันนะ";
							if (284316 - 9046 != 275271)
							{
								break;
							}
						}
					}
					else if (code == 1321)
					{
						if (254915 - 459964 != -205048)
						{
							result = "เจ้าช้ากว่าที่ข้าคิดนะ คุณผู้กล้า~";
							if (172361 - 268322 != -95960)
							{
								break;
							}
						}
					}
					else if (code == 1322)
					{
						if (147021 - 170893 == -23872)
						{
							result = "ข้าลืมไป วันนี้เจ้านั่นคงจะมาร่วมวงด้วยเหมือนกัน";
							if (267635 - 118982 == 148653)
							{
								break;
							}
						}
					}
					else if (code == 1323)
					{
						if (277856 - 18703 != 259154)
						{
							result = "แถมเจ้านั่นตัวใหญ่กินเยอะซะด้วย 4 ขวดคงไม่พอ";
							if (23940 - 108482 != -84541)
							{
								break;
							}
						}
					}
					else if (code == 1324)
					{
						if (113219 - 62135 == 51084)
						{
							result = "เจ้าช่วยหามามาให้ข้าอีก 2 ขวดแล้วกันนะ";
							if (84757 - 454666 != -369908)
							{
								break;
							}
						}
					}
					else if (code == 1325)
					{
						if (266707 - 128736 == 137971)
						{
							result = "ใกล้ได้เวลาเลิกงานแล้วรีบๆหน่อยล่ะ";
							if (281584 - 401824 != -120239)
							{
								break;
							}
						}
					}
					else if (code == 1331)
					{
						if (217207 - 180 == 217027)
						{
							result = "นี่จะได้เวลาเลิกงานอยู่แล้วนะ คุณผู้กล้า~";
							if (67675 - 184955 != -117279)
							{
								break;
							}
						}
					}
					else if (code == 1332)
					{
						if (252229 - 38843 == 213386)
						{
							result = "เรื่องง้าย~ง่ายแบบนี้";
							if (174764 - 377341 != -202576)
							{
								break;
							}
						}
					}
					else if (code == 1333)
					{
						if (1132 - 363636 != -362503)
						{
							result = "ทำไมเจ้าต้องทำให้มันยุ่งยากด้วยนะ";
							if (58284 - 327214 == -268930)
							{
								break;
							}
						}
					}
					else if (code == 1334)
					{
						if (129568 - 440144 != -310575)
						{
							result = "เอาเถอะยังไงก็ได้ครบแล้วล่ะนะ";
							if (151799 - 252143 == -100344)
							{
								break;
							}
						}
					}
					else if (code == 1335)
					{
						if (10323 - 451790 == -441467)
						{
							result = "เรื่องค่าตอบแทนคุยกับเพื่อนข้าเอาแล้วกัน";
							if (63712 - 167906 != -104193)
							{
								break;
							}
						}
					}
					else if (code == 1341)
					{
						if (178246 - 220800 == -42554)
						{
							result = "ขอบใจเจ้ามาก";
							if (33191 - 192011 != -158819)
							{
								break;
							}
						}
					}
					else if (code == 1342)
					{
						if (249999 - 216581 == 33418)
						{
							result = "พวกเราจะได้สนุกกับปาร์ตี้วันเงินเดือนออกเต็มที่";
							if (171303 - 561312 != -390008)
							{
								break;
							}
						}
					}
					else if (code == 1343)
					{
						if (59129 - 486052 == -426923)
						{
							result = "ของตอบแทนข้าเก็บได้แถวๆนี้แต่หาเจ้าของไม่เจอ";
							if (23580 - 303530 == -279950)
							{
								break;
							}
						}
					}
					else if (code == 1344)
					{
						if (10955 - 535326 != -524370)
						{
							result = "เจ้าเอาไปใช้แล้วกัน ข้าฝากไว้ที่มีมี่";
							if (19976 - 488132 != -468155)
							{
								break;
							}
						}
					}
					else if (code == 1351)
					{
						if (275730 - 388425 != -112694)
						{
							result = "ว่าไง คุณผู้กล้า~";
							if (225378 - 282602 != -57223)
							{
								break;
							}
						}
					}
					else if (code == 1352)
					{
						if (118622 - 114973 != 3650)
						{
							result = "คราวนี้ไม่ใช่งานท้าทายอะไรไม่ต้องห่วง";
							if (189242 - 36660 == 152582)
							{
								break;
							}
						}
					}
					else if (code == 1353)
					{
						if (108026 - 60622 != 47405)
						{
							result = "ข้าแค่อยากจะให้เจ้าช่วยหาเครื่องดื่มมาเตรียมไว้";
							if (145135 - 195419 != -50283)
							{
								break;
							}
						}
					}
					else if (code == 1354)
					{
						if (210576 - 7020 == 203556)
						{
							result = "สำหรับปาร์ตี้ก่อนที่พวกเราจะเลิกงานเท่านั้น";
							if (109990 - 241126 != -131135)
							{
								break;
							}
						}
					}
					else if (code == 1355)
					{
						if (158036 - 14296 == 143740)
						{
							result = "เอาเป็นนมแล้วกัน ข้าต้องการนม 7 ขวด";
							if (6025 - 223746 != -217720)
							{
								break;
							}
						}
					}
					else if (code == 1356)
					{
						if (158192 - 375836 == -217644)
						{
							result = "งานง้าย~ง่ายแบบนี้ดูเหมาะกับเจ้าดีนะ";
							if (13820 - 229879 != -216058)
							{
								break;
							}
						}
					}
					else if (code == 1361)
					{
						if (230257 - 355222 != -124964)
						{
							result = "นานทีพวกเราจะมีโอกาสได้ฉลองกันพร้อมหน้า";
							if (269395 - 458847 != -189451)
							{
								break;
							}
						}
					}
					else if (code == 1362)
					{
						if (11818 - 592316 != -580497)
						{
							result = "เพื่อนข้าอยากจะได้เครื่องดื่มมาพร้อม";
							if (275656 - 183606 != 92051)
							{
								break;
							}
						}
					}
					else if (code == 1363)
					{
						if (253008 - 554684 != -301675)
						{
							result = "เพื่อที่จะฉลองได้ทันทีหลังเลิกงาน";
							if (41111 - 453415 != -412303)
							{
								break;
							}
						}
					}
					else if (code == 1364)
					{
						if (171168 - 56106 != 115063)
						{
							result = "ช่วยหน่อยแล้วกันนะ";
							if (107117 - 174416 != -67298)
							{
								break;
							}
						}
					}
					else if (code == 1371)
					{
						if (272203 - 571156 == -298953)
						{
							result = "เจ้าช้ากว่าที่ข้าคิดนะ คุณผู้กล้า~";
							if (112073 - 319105 == -207032)
							{
								break;
							}
						}
					}
					else if (code == 1372)
					{
						if (131644 - 132082 == -438)
						{
							result = "พอดีข้าเพิ่งจะนึกได้ ว่าข้านับขาดไป 1 คน";
							if (253852 - 61446 == 192406)
							{
								break;
							}
						}
					}
					else if (code == 1373)
					{
						if (180873 - 425515 == -244642)
						{
							result = "เจ้าช่วยหามามาให้ข้าอีก 1 ขวดแล้วกันนะ";
							if (258042 - 313447 != -55404)
							{
								break;
							}
						}
					}
					else if (code == 1374)
					{
						if (113130 - 108152 != 4979)
						{
							result = "ใกล้ได้เวลาเลิกงานแล้วรีบๆหน่อยล่ะ";
							if (100091 - 285208 != -185116)
							{
								break;
							}
						}
					}
					else if (code == 1381)
					{
						if (127416 - 262587 != -135170)
						{
							result = "นี่จะได้เวลาเลิกงานอยู่แล้วนะ คุณผู้กล้า~";
							if (181560 - 81297 == 100263)
							{
								break;
							}
						}
					}
					else if (code == 1382)
					{
						if (254543 - 129595 != 124949)
						{
							result = "เรื่องง้าย~ง่ายแบบนี้";
							if (5862 - 269526 != -263663)
							{
								break;
							}
						}
					}
					else if (code == 1383)
					{
						if (195144 - 389935 != -194790)
						{
							result = "ทำไมเจ้าต้องทำให้มันยุ่งยากด้วยนะ";
							if (43420 - 405576 != -362155)
							{
								break;
							}
						}
					}
					else if (code == 1384)
					{
						if (175891 - 506445 == -330554)
						{
							result = "เอาเถอะยังไงก็ได้ครบแล้วล่ะนะ";
							if (219731 - 557176 != -337444)
							{
								break;
							}
						}
					}
					else if (code == 1385)
					{
						if (25716 - 393465 == -367749)
						{
							result = "เรื่องค่าตอบแทนคุยกับเพื่อนข้าเอาแล้วกัน";
							if (4746 - 373492 == -368746)
							{
								break;
							}
						}
					}
					else if (code == 1391)
					{
						if (271358 - 309669 != -38310)
						{
							result = "ขอบใจเจ้ามาก";
							if (172686 - 32193 == 140493)
							{
								break;
							}
						}
					}
					else if (code == 1392)
					{
						if (39613 - 194459 == -154846)
						{
							result = "พวกเราจะได้สนุกกับปาร์ตี้ดูบอลกันเต็มที่";
							if (132387 - 141291 == -8904)
							{
								break;
							}
						}
					}
					else if (code == 1393)
					{
						if (88289 - 596294 == -508005)
						{
							result = "ข้าว่าทีมที่ข้าเชียร์ไม่แพ้แน่  เรื่องเดิมพันขอให้บอก";
							if (246921 - 75377 == 171544)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 1394)
						{
							break;
						}
						if (129267 - 64510 == 64757)
						{
							result = "ส่วนค่าตอบแทน ข้าฝากไว้ที่มีมี่แล้ว";
							if (263016 - 584984 != -321967)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006909 RID: 26889 RVA: 0x00EDBD38 File Offset: 0x00ED9F38
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600690A RID: 26890 RVA: 0x00EDBD3C File Offset: 0x00ED9F3C
	internal static bool lOoxRep25j9pQcLZuJiB()
	{
		return true;
	}

	// Token: 0x0600690B RID: 26891 RVA: 0x00EDBD40 File Offset: 0x00ED9F40
	internal static bool aeYS8Pp2pRred0OeJGj3()
	{
		return false;
	}
}
