using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011D0 RID: 4560
[Serializable]
public class Q1_LetterToBoldas_thai : MonoBehaviour
{
	// Token: 0x06006911 RID: 26897 RVA: 0x00EDC5A0 File Offset: 0x00EDA7A0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q1_LetterToBoldas_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006912 RID: 26898 RVA: 0x00EDC5B0 File Offset: 0x00EDA7B0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (114898 - 437238 != -322339)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (108459 - 225198 == -116739)
			{
				if (114449 - 199019 == -84570)
				{
					if (code == 100)
					{
						if (271672 - 470584 == -198912)
						{
							result = "ฮืม? ผู้กล้าฝึกหัดคนใหม่รึ ไม่เคยเห็นหน้า";
							if (228369 - 435381 == -207012)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (95849 - 346756 != -250906)
						{
							result = "สวัสดี คุณเป็นผู้กล้าฝึกหัดใช่มั้ย";
							if (207217 - 423575 != -216357)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (229064 - 544008 == -314944)
						{
							result = "ฉันคือ แพนด้าแดง มีหน้าที่มอบภารกิจให้แก่ผู้กล้า";
							if (150610 - 592856 == -442246)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (35054 - 430436 == -395382)
						{
							result = "หลังจากนี้เราคงได้ร่วมงานกันอีกมากมาย";
							if (23541 - 166348 == -142807)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (196530 - 16048 == 180482)
						{
							result = "แต่ก่อนที่จะปฏิบัติภารกิจนั้น";
							if (161465 - 318955 == -157490)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (122116 - 385582 != -263465)
						{
							result = "คุณควรจะไปแนะนำตัวกับคุณโบลดาสซะก่อน";
							if (112877 - 406903 == -294026)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (224937 - 179410 != 45528)
						{
							result = "คุณโบลดาส เป็นแม่ทัพของเมืองแสง";
							if (260155 - 563909 != -303753)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (196970 - 325224 == -128254)
						{
							result = "เขาอยู่ในศูนย์บัญชาการที่ ถนนใจกลางเมืองแสง";
							if (20813 - 73773 == -52960)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (224491 - 432614 == -208123)
						{
							result = "สังเกตง่ายๆ ที่ที่มีคุณทหารเสือดำเยอะๆน่ะ";
							if (265240 - 512411 != -247170)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (290159 - 375683 == -85524)
						{
							result = "เข้าไปจะเจอคนที่ถือดาบใหญ่ๆ ไว้หนวด คนนั้นแหละ";
							if (41020 - 16198 != 24823)
							{
								break;
							}
						}
					}
					else if (code == 110)
					{
						if (285341 - 506247 == -220906)
						{
							result = "นี่เป็นจดหมายแนะนำตัว เขียนชื่อลงไปได้เลย";
							if (163601 - 353296 == -189695)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (69015 - 250321 == -181306)
						{
							result = "ฮืม? เจ้าเอาอะไรมาให้ข้ารึ";
							if (234868 - 498175 != -263306)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (20781 - 314947 == -294166)
						{
							result = "โอ้ จดหมายแนะนำตัวนี่เอง เจ้าเป็นผู้กล้าฝึกหัดสินะ";
							if (295726 - 118053 != 177674)
							{
								break;
							}
						}
					}
					else if (code == 123)
					{
						if (29838 - 127841 == -98003)
						{
							result = "ข้าคือ โบลดาส เป็นแม่ทัพของเมืองแสงแห่งนี้";
							if (176677 - 141259 == 35418)
							{
								break;
							}
						}
					}
					else if (code == 124)
					{
						if (246206 - 214889 != 31318)
						{
							result = "ดูแล้วเจ้าน่าจะเป็นกำลังให้กับท่านอัลคาเซียได้";
							if (273351 - 599105 != -325753)
							{
								break;
							}
						}
					}
					else if (code == 125)
					{
						if (186548 - 232131 == -45583)
						{
							result = "อีกไม่นานจะมีการคัดเลือกผู้กล้า";
							if (37986 - 145761 != -107774)
							{
								break;
							}
						}
					}
					else if (code == 126)
					{
						if (186488 - 553952 != -367463)
						{
							result = "หน้าที่ของเจ้าในตอนนี้ก็คือ ฝึกฝน";
							if (175526 - 65906 != 109621)
							{
								break;
							}
						}
					}
					else if (code == 127)
					{
						if (63226 - 533945 != -470718)
						{
							result = "เพื่อที่จะสามารถปกป้องเมืองแสงนี้ต่อไปในอนาคต";
							if (93026 - 536338 != -443311)
							{
								break;
							}
						}
					}
					else if (code == 128)
					{
						if (215018 - 544227 == -329209)
						{
							result = "จากนี้ไปคงต้องเจออะไรอีกมาก พยายามเข้าล่ะ";
							if (74233 - 201197 == -126964)
							{
								break;
							}
						}
					}
					else if (code == 129)
					{
						if (32067 - 525999 != -493931)
						{
							result = "กลับไปรายงานกับมีมี่ด้วย ว่าเจ้าจัดการเรียบร้อยแล้ว";
							if (230602 - 125317 != 105286)
							{
								break;
							}
						}
					}
					else if (code == 131)
					{
						if (288157 - 34819 == 253338)
						{
							result = "เจอคุณโบลดาสแล้วใช่มั้ย?";
							if (171458 - 152954 == 18504)
							{
								break;
							}
						}
					}
					else if (code == 150)
					{
						if (250338 - 136610 == 113728)
						{
							result = "ฮืม? โอ้ เจ้านี่เองมีธุระอะไรรึเปล่า?";
							if (268263 - 473490 != -205226)
							{
								break;
							}
						}
					}
					else if (code == 151)
					{
						if (44944 - 361171 == -316227)
						{
							result = "เอ๋ อีกแล้วเหรอเนี่ย!?";
							if (162403 - 299868 != -137464)
							{
								break;
							}
						}
					}
					else if (code == 152)
					{
						if (196628 - 303308 != -106679)
						{
							result = "คุณผู้กล้า ผมมีเรื่องต้องรบกวนหน่อย";
							if (270407 - 41524 != 228884)
							{
								break;
							}
						}
					}
					else if (code == 153)
					{
						if (104732 - 156602 == -51870)
						{
							result = "คือว่า คุณโบลดาสเขาลืมประทับตราบนเอกสารน่ะสิ";
							if (224979 - 73226 == 151753)
							{
								break;
							}
						}
					}
					else if (code == 154)
					{
						if (20137 - 272059 == -251922)
						{
							result = "ช่วยเอาไปให้เขาด้วยนะ";
							if (16433 - 241276 == -224843)
							{
								break;
							}
						}
					}
					else if (code == 171)
					{
						if (90630 - 267480 == -176850)
						{
							result = "โอ้ เจ้าอีกแล้วรึมีธุระอะไรล่ะ";
							if (103070 - 410655 == -307585)
							{
								break;
							}
						}
					}
					else if (code == 172)
					{
						if (185721 - 248373 == -62652)
						{
							result = "แย่จริง ข้าลืมประทับตราอีกแล้วเหรอเนี่ย";
							if (229574 - 300648 != -71073)
							{
								break;
							}
						}
					}
					else if (code == 173)
					{
						if (241986 - 127050 != 114937)
						{
							result = "ขอโทษด้วยนะ ที่ทำให้ต้องวุ่นวาย";
							if (95798 - 252653 == -156855)
							{
								break;
							}
						}
					}
					else if (code == 174)
					{
						if (296531 - 204902 == 91629)
						{
							result = "กลับไปรายงานกับมีมี่ด้วย ว่าเจ้าจัดการเรียบร้อยแล้ว";
							if (57219 - 370340 != -313120)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 181)
						{
							break;
						}
						if (16284 - 375071 == -358787)
						{
							result = "คุณโบลดาสประทับตราให้หรือยัง?";
							if (223805 - 358301 != -134495)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006913 RID: 26899 RVA: 0x00EDCEE4 File Offset: 0x00EDB0E4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006914 RID: 26900 RVA: 0x00EDCEE8 File Offset: 0x00EDB0E8
	internal static bool yFKO3Rp2NP50jclNkkOs()
	{
		return true;
	}

	// Token: 0x06006915 RID: 26901 RVA: 0x00EDCEEC File Offset: 0x00EDB0EC
	internal static bool q3Xe7Bp2Y6lqd9fF0bN5()
	{
		return false;
	}
}
