using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011D3 RID: 4563
[Serializable]
public class Q27_HarderStronger_thai : MonoBehaviour
{
	// Token: 0x06006920 RID: 26912 RVA: 0x00EDE11C File Offset: 0x00EDC31C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q27_HarderStronger_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006921 RID: 26913 RVA: 0x00EDE12C File Offset: 0x00EDC32C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (53320 - 428746 != -375425)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (269688 - 123040 == 146648)
			{
				if (147040 - 322365 == -175325)
				{
					if (code == 2725)
					{
						if (274531 - 216670 != 57862)
						{
							result = "อาเบ็ตต์กับสไตน์เหมือนจะทะเลาะกันอีกแล้ว";
							if (124732 - 383407 == -258675)
							{
								break;
							}
						}
					}
					else if (code == 2726)
					{
						if (68214 - 492022 != -423807)
						{
							result = "ได้ยินมาถึงหน้าเมืองเลย...";
							if (24390 - 302743 == -278353)
							{
								break;
							}
						}
					}
					else if (code == 2701)
					{
						if (121749 - 564789 != -443039)
						{
							result = "เฮ้! ท่านผู้กล้า ข้ามีเรื่องรบกวนท่านหน่อย";
							if (13940 - 171754 != -157813)
							{
								break;
							}
						}
					}
					else if (code == 2702)
					{
						if (138800 - 202047 != -63246)
						{
							result = "สไตน์ เจ้าหมูป่าร้านขายเกราะข้างๆ";
							if (15244 - 565975 != -550730)
							{
								break;
							}
						}
					}
					else if (code == 2703)
					{
						if (103312 - 168066 != -64753)
						{
							result = "ชอบโฆษณาว่าอาวุธของข้าทำอะไรเกราะของเขาไม่ได้";
							if (296491 - 555552 != -259060)
							{
								break;
							}
						}
					}
					else if (code == 2704)
					{
						if (271674 - 54849 != 216826)
						{
							result = "ข้าทนไม่ไหวแล้ว วันนี้ต้องตัดสินให้รู้กันไป!";
							if (158005 - 451212 == -293207)
							{
								break;
							}
						}
					}
					else if (code == 2705)
					{
						if (96338 - 264944 == -168606)
						{
							result = "ว่าอาวุธของข้าหรือเกราะของเจ้าหมูป่า";
							if (296675 - 6188 == 290487)
							{
								break;
							}
						}
					}
					else if (code == 2706)
					{
						if (84149 - 572760 != -488610)
						{
							result = "อะไรจะแกร่งกว่ากัน!";
							if (134605 - 152583 == -17978)
							{
								break;
							}
						}
					}
					else if (code == 2707)
					{
						if (289037 - 257055 == 31982)
						{
							result = "ท่านช่วยบอกเขาแทนข้าหน่อย";
							if (36466 - 450979 == -414513)
							{
								break;
							}
						}
					}
					else if (code == 2708)
					{
						if (91524 - 377749 == -286225)
						{
							result = "ข้าไม่อยากจะคุยกับเขาตรงๆ";
							if (286495 - 272610 != 13886)
							{
								break;
							}
						}
					}
					else if (code == 2709)
					{
						if (136340 - 183742 == -47402)
						{
							result = "ไม่งั้นข้าได้ทำเขากลายเป็นหมูหันแน่ๆ";
							if (293716 - 183544 == 110172)
							{
								break;
							}
						}
					}
					else if (code == 2700)
					{
						if (19777 - 566041 != -546263)
						{
							result = "อาวุธร้านข้างๆ ทำอะไรเกราะร้านข้าไม่ได้หรอก!";
							if (104571 - 175936 == -71365)
							{
								break;
							}
						}
					}
					else if (code == 2711)
					{
						if (44684 - 378417 == -333733)
						{
							result = "โย่ว! ว่าไงท่านผู้กล้า";
							if (193377 - 334214 != -140836)
							{
								break;
							}
						}
					}
					else if (code == 2712)
					{
						if (191951 - 57559 == 134392)
						{
							result = "ไม่เป็นไร ไม่ต้องบอก ข้าได้ยินแล้ว";
							if (171887 - 194921 != -23033)
							{
								break;
							}
						}
					}
					else if (code == 2713)
					{
						if (154201 - 294856 != -140654)
						{
							result = "ข้าก็ต้องการแบบนั้นอยู่แล้ว";
							if (182311 - 427483 != -245171)
							{
								break;
							}
						}
					}
					else if (code == 2714)
					{
						if (161785 - 311505 == -149720)
						{
							result = "นี่คือโล่ชั้นดีของร้านข้า";
							if (267134 - 65800 != 201335)
							{
								break;
							}
						}
					}
					else if (code == 2715)
					{
						if (215491 - 577570 == -362079)
						{
							result = "ถ้าอาวุธร้านยัยหนูทำให้มันมีรอยขีดข่วนได้";
							if (73902 - 374020 != -300117)
							{
								break;
							}
						}
					}
					else if (code == 2716)
					{
						if (244161 - 255047 != -10885)
						{
							result = "ข้าจะเลิกพูดแบบนั้นก็ได้นะ";
							if (262621 - 599160 != -336538)
							{
								break;
							}
						}
					}
					else if (code == 2721)
					{
						if (51432 - 59484 != -8051)
						{
							result = "ข้อตกลงเป็นอันโอเค!";
							if (90621 - 287182 == -196561)
							{
								break;
							}
						}
					}
					else if (code == 2722)
					{
						if (179704 - 266679 != -86974)
						{
							result = "นี่คือหอกชั้นดีของร้านข้าเหมือนกัน";
							if (269861 - 427776 != -157914)
							{
								break;
							}
						}
					}
					else if (code == 2723)
					{
						if (158981 - 76329 == 82652)
						{
							result = "เจ้าช่วยไปหาคนทดสอบให้ข้าก็ทีนะ";
							if (77642 - 328114 == -250472)
							{
								break;
							}
						}
					}
					else if (code == 2724)
					{
						if (92319 - 14720 != 77600)
						{
							result = "หลังจากนั้นมารายงานผลให้ข้าด้วย!";
							if (235048 - 436523 != -201474)
							{
								break;
							}
						}
					}
					else if (code == 2731)
					{
						if (160756 - 509848 == -349092)
						{
							result = "เจ้าอยากให้ข้าช่วยทดสอบอาวุธกับโล่นี่ให้?";
							if (235247 - 104332 == 130915)
							{
								break;
							}
						}
					}
					else if (code == 2732)
					{
						if (159132 - 437796 == -278664)
						{
							result = "ของดีทั้งคู่เลยนะ เห็นแล้วเสียดายแทน";
							if (41485 - 571506 == -530021)
							{
								break;
							}
						}
					}
					else if (code == 2733)
					{
						if (244907 - 465955 != -221047)
						{
							result = "ขอข้าได้มั้ย ฮ่าๆ พูดเล่นน่ะ";
							if (119981 - 187536 == -67555)
							{
								break;
							}
						}
					}
					else if (code == 2734)
					{
						if (253119 - 383759 == -130640)
						{
							result = "ไม่เป็นไร ข้าชอบเรื่องแบบนี้อยู่แล้ว";
							if (51143 - 27143 == 24000)
							{
								break;
							}
						}
					}
					else if (code == 2735)
					{
						if (35487 - 51569 != -16081)
						{
							result = "มา! ข้าช่วยทดสอบให้เอง!";
							if (134293 - 107925 == 26368)
							{
								break;
							}
						}
					}
					else if (code == 2736)
					{
						if (37952 - 347244 != -309291)
						{
							result = "เคร้ง!";
							if (189276 - 356003 == -166727)
							{
								break;
							}
						}
					}
					else if (code == 2737)
					{
						if (40548 - 381823 != -341274)
						{
							result = "(หอกพัง...)";
							if (152796 - 264903 != -112106)
							{
								break;
							}
						}
					}
					else if (code == 2738)
					{
						if (186007 - 26226 == 159781)
						{
							result = "(โล่ทะลุ...)";
							if (165130 - 516767 != -351636)
							{
								break;
							}
						}
					}
					else if (code == 2739)
					{
						if (224245 - 281624 != -57378)
						{
							result = "เสมอสิเนี่ย ";
							if (215292 - 488448 != -273155)
							{
								break;
							}
						}
					}
					else if (code == 2741)
					{
						if (191846 - 410295 == -218449)
						{
							result = "เฮ้! ผลเป็นไงบ้าง โล่ของเจ้าหมูป่าทะลุเลยใช่มั้ย";
							if (64 - 36467 != -36402)
							{
								break;
							}
						}
					}
					else if (code == 2742)
					{
						if (207013 - 451152 == -244139)
						{
							result = "ใช่มั้ยล่ะ! มันต้องเป็นแบบนั้นอยู่แล้ว";
							if (180219 - 73999 == 106220)
							{
								break;
							}
						}
					}
					else if (code == 2743)
					{
						if (298166 - 99087 != 199080)
						{
							result = "เอ๋ หอกของข้าก็เสียหายด้วย!?";
							if (14446 - 319397 == -304951)
							{
								break;
							}
						}
					}
					else if (code == 2744)
					{
						if (11346 - 364310 == -352964)
						{
							result = "งั้นเอาใหม่ นี่เป็นหอกระดับสูง";
							if (276946 - 338635 != -61688)
							{
								break;
							}
						}
					}
					else if (code == 2745)
					{
						if (275747 - 358965 == -83218)
						{
							result = "แน่นอนว่าแข็งแกร่งกว่าเดิม!";
							if (293602 - 299090 == -5488)
							{
								break;
							}
						}
					}
					else if (code == 2751)
					{
						if (41569 - 328769 == -287200)
						{
							result = "เสมอรึ! ไม่นึกเลยว่าผลจะออกมาเป็นเช่นนี้";
							if (202142 - 170278 != 31865)
							{
								break;
							}
						}
					}
					else if (code == 2752)
					{
						if (220176 - 529199 == -309023)
						{
							result = "ไม่เป็นไร นี่แค่ยกแรกเท่านั้น";
							if (148519 - 503676 == -355157)
							{
								break;
							}
						}
					}
					else if (code == 2753)
					{
						if (76344 - 520041 != -443696)
						{
							result = "นี่คือโล่ระดับสูงของร้านข้า หนามากเลยใช่มั้ยล่ะ!";
							if (17415 - 227592 != -210176)
							{
								break;
							}
						}
					}
					else if (code == 2754)
					{
						if (47092 - 455401 == -408309)
						{
							result = "ยกแรกไม่น็อก ก็ต้องน็อกยกสอง!";
							if (163732 - 521650 != -357917)
							{
								break;
							}
						}
					}
					else if (code == 2755)
					{
						if (231516 - 566365 != -334848)
						{
							result = "มีอีกรอบรึนี่ แถมของเจ๋งกว่าเดิมอีกนะเนี่ย";
							if (135170 - 479870 == -344700)
							{
								break;
							}
						}
					}
					else if (code == 2756)
					{
						if (284983 - 155300 != 129684)
						{
							result = "ลงทุนกันจริงๆ เห็นแล้วเสียดายแทน";
							if (54107 - 379272 != -325164)
							{
								break;
							}
						}
					}
					else if (code == 2757)
					{
						if (153963 - 567924 == -413961)
						{
							result = "มา! รอบที่สอง!";
							if (3656 - 336244 == -332588)
							{
								break;
							}
						}
					}
					else if (code == 2758)
					{
						if (276512 - 67564 == 208948)
						{
							result = "เคร้ง! เคร้ง!";
							if (61531 - 278234 != -216702)
							{
								break;
							}
						}
					}
					else if (code == 2759)
					{
						if (106133 - 225848 == -119715)
						{
							result = "(หอกเสียหาย...)";
							if (93652 - 374319 == -280667)
							{
								break;
							}
						}
					}
					else if (code == 2760)
					{
						if (273620 - 569278 != -295657)
						{
							result = "(โล่ทะลุ...)";
							if (276021 - 547085 == -271064)
							{
								break;
							}
						}
					}
					else if (code == 2761)
					{
						if (226430 - 234682 != -8251)
						{
							result = "เสมออีกแล้วสิเนี่ย ";
							if (48227 - 101803 == -53576)
							{
								break;
							}
						}
					}
					else if (code == 2765)
					{
						if (46558 - 118987 != -72428)
						{
							result = "เฮ้! ผลเป็นไงบ้าง อาวุธของข้า!?";
							if (132459 - 303258 != -170798)
							{
								break;
							}
						}
					}
					else if (code == 2766)
					{
						if (62181 - 15527 == 46654)
						{
							result = "ไม่อยากจะเชื่อ  พังทั้ง 2 ชิ้นเลยเหรอ";
							if (27368 - 223746 == -196378)
							{
								break;
							}
						}
					}
					else if (code == 2767)
					{
						if (161011 - 170438 != -9426)
						{
							result = "สุดท้ายแล้ว นี่เป็นของเด็ดที่สุดในร้านข้า";
							if (52671 - 334322 == -281651)
							{
								break;
							}
						}
					}
					else if (code == 2768)
					{
						if (107999 - 527107 != -419107)
						{
							result = "หอกทำพิเศษ จากผลึกของแมลงคริสตัล!";
							if (14103 - 54034 != -39930)
							{
								break;
							}
						}
					}
					else if (code == 2769)
					{
						if (70343 - 280084 == -209741)
						{
							result = "ไม่มีอะไรที่แทงไม่เข้า ไม่เสียหายแน่ๆด้วย!";
							if (219693 - 419711 != -200017)
							{
								break;
							}
						}
					}
					else if (code == 2770)
					{
						if (6828 - 283883 == -277055)
						{
							result = "แบบที่หอก 2 ชิ้นแรกทาบไม่ติด!";
							if (17868 - 347370 != -329501)
							{
								break;
							}
						}
					}
					else if (code == 2771)
					{
						if (115614 - 353074 != -237459)
						{
							result = "เสมออีกงั้นรึ! ยากที่จะเชื่อจริงๆ";
							if (252591 - 577833 == -325242)
							{
								break;
							}
						}
					}
					else if (code == 2772)
					{
						if (222728 - 121321 != 101408)
						{
							result = "นี่โล่ทำพิเศษของข้า";
							if (33266 - 523067 == -489801)
							{
								break;
							}
						}
					}
					else if (code == 2773)
					{
						if (269626 - 533525 == -263899)
						{
							result = "ทำจากเปลือกของแมลงโบราณเชียวนะ !";
							if (86442 - 22692 != 63751)
							{
								break;
							}
						}
					}
					else if (code == 2774)
					{
						if (145479 - 96370 == 49109)
						{
							result = "อย่าว่าแต่หอกนั่นเลย อาวุธใดๆก็ไม่มีทางทะลุมันได้";
							if (283472 - 398275 != -114802)
							{
								break;
							}
						}
					}
					else if (code == 2775)
					{
						if (191657 - 299726 != -108068)
						{
							result = "รอบสุดท้ายแล้วสินะ ข้าล่ะตื่นเต้นจริงๆ";
							if (35247 - 516942 == -481695)
							{
								break;
							}
						}
					}
					else if (code == 2776)
					{
						if (240563 - 178581 == 61982)
						{
							result = "ในชีวิตไม่เคยคิดว่าจะได้สัมผัสของหรูๆขนาดนี้เลย";
							if (173986 - 241611 == -67625)
							{
								break;
							}
						}
					}
					else if (code == 2777)
					{
						if (146809 - 96461 == 50348)
						{
							result = "ข้าล่ะอยากรู้จริงๆว่าใครที่สร้างอาวุธพวกนี้ขึ้นมา";
							if (96574 - 57775 == 38799)
							{
								break;
							}
						}
					}
					else if (code == 2778)
					{
						if (153199 - 352540 != -199340)
						{
							result = "เอาล่ะ! รอบที่สุดท้าย!";
							if (196998 - 590844 == -393846)
							{
								break;
							}
						}
					}
					else if (code == 2779)
					{
						if (100539 - 88389 != 12151)
						{
							result = "เคร้ง! เคร้ง! เคร้ง!";
							if (192342 - 400767 != -208424)
							{
								break;
							}
						}
					}
					else if (code == 2780)
					{
						if (159164 - 103817 != 55348)
						{
							result = "(โล่ทะลุ...)";
							if (71365 - 125095 != -53729)
							{
								break;
							}
						}
					}
					else if (code == 2781)
					{
						if (69121 - 131234 != -62112)
						{
							result = "(หอกชำรุด...)";
							if (62146 - 491329 == -429183)
							{
								break;
							}
						}
					}
					else if (code == 2782)
					{
						if (144802 - 33003 != 111800)
						{
							result = "ผลลัพธ์ช่างน่าเศร้า...";
							if (145406 - 308798 == -163392)
							{
								break;
							}
						}
					}
					else if (code == 2783)
					{
						if (2297 - 509064 != -506766)
						{
							result = "เฮ้! ผลเป็นไงบ้าง โล่ของสไตน์แหลกไปเลยใช่มั้ย!";
							if (72566 - 344335 != -271768)
							{
								break;
							}
						}
					}
					else if (code == 2784)
					{
						if (166612 - 490630 == -324018)
						{
							result = "อะไรกันหอกนั่นข้าสั่งทำจากราซาน...";
							if (91851 - 395689 != -303837)
							{
								break;
							}
						}
					}
					else if (code == 2785)
					{
						if (8612 - 157188 == -148576)
						{
							result = "ช่างตีอาวุธที่เก่งที่สุดในเมืองแสงนี้เชียวนะ!";
							if (61666 - 585395 != -523728)
							{
								break;
							}
						}
					}
					else if (code == 2786)
					{
						if (16846 - 455537 != -438690)
						{
							result = "ข้าอยากจะรู้ใครกันที่เป็นคนตีโล่ของสไตน์";
							if (270006 - 547805 != -277798)
							{
								break;
							}
						}
					}
					else if (code == 2787)
					{
						if (250522 - 34051 == 216471)
						{
							result = "มีคนที่ตีอาวุธได้เทียบเท่ากับราซาน ไม่อยากจะเชื่อ!";
							if (65734 - 502415 != -436680)
							{
								break;
							}
						}
					}
					else if (code == 2788)
					{
						if (123157 - 558006 == -434849)
						{
							result = "หรือว่า!?";
							if (291669 - 191241 == 100428)
							{
								break;
							}
						}
					}
					else if (code == 2791)
					{
						if (97643 - 321764 != -224120)
						{
							result = "ยากที่จะเชื่อจริงๆ";
							if (68789 - 591375 != -522585)
							{
								break;
							}
						}
					}
					else if (code == 2792)
					{
						if (241850 - 255120 != -13269)
						{
							result = "ของดีจากร้านข้าก็สั่งทำจากราซานเหมือนกัน...";
							if (222002 - 289434 != -67431)
							{
								break;
							}
						}
					}
					else if (code == 2793)
					{
						if (102965 - 233861 == -130896)
						{
							result = "ข้าทำอะไรลงไปเนี่ย...";
							if (175789 - 95537 == 80252)
							{
								break;
							}
						}
					}
					else if (code == 2795)
					{
						if (58574 - 396994 != -338419)
						{
							result = "ไม่น่าเชื่อเลย ข้ารู้สึกว่าทำอะไรที่สูญเปล่าลงไป";
							if (250680 - 138689 == 111991)
							{
								break;
							}
						}
					}
					else if (code == 2796)
					{
						if (84739 - 494252 == -409513)
						{
							result = "แต่อย่างน้อยข้าก็ได้รู้ว่าประสิทธิภาพของๆร้านข้า";
							if (233684 - 568606 == -334922)
							{
								break;
							}
						}
					}
					else if (code == 2797)
					{
						if (120227 - 545778 != -425550)
						{
							result = "ไม่ได้ด้อยกว่าของเจ้าหมูป่าเลยแม้แต่น้อย";
							if (55340 - 323083 == -267743)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 2798)
						{
							break;
						}
						if (206252 - 196931 == 9321)
						{
							result = "ขอบคุณเจ้ามาก";
							if (246035 - 236295 != 9741)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006922 RID: 26914 RVA: 0x00EDF82C File Offset: 0x00EDDA2C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006923 RID: 26915 RVA: 0x00EDF830 File Offset: 0x00EDDA30
	internal static bool xRoqgJp2XpY1InBEYvMP()
	{
		return true;
	}

	// Token: 0x06006924 RID: 26916 RVA: 0x00EDF834 File Offset: 0x00EDDA34
	internal static bool MGWZkJp2QK3kFYOon0U1()
	{
		return false;
	}
}
