using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011D5 RID: 4565
[Serializable]
public class Q2_HungryXinfu_thai : MonoBehaviour
{
	// Token: 0x0600692A RID: 26922 RVA: 0x00EE0534 File Offset: 0x00EDE734
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q2_HungryXinfu_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600692B RID: 26923 RVA: 0x00EE0544 File Offset: 0x00EDE744
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (291258 - 426279 != -135020)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (256335 - 264165 == -7830)
			{
				if (147008 - 180789 == -33781)
				{
					if (code == 200)
					{
						if (297508 - 49768 == 247740)
						{
							result = "ตาลุงนั่นคงไปกินอาหารของจามอนแล้วสินะ...";
							if (50085 - 99332 != -49246)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (142951 - 433841 == -290890)
						{
							result = "หิวจัง ฮูก";
							if (179474 - 1112 == 178362)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (152931 - 103540 != 49392)
						{
							result = "เจ้าคือคนที่รับงานของข้าจากมีมี่สินะ ฮูก";
							if (252231 - 203585 == 48646)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (274706 - 514081 != -239374)
						{
							result = "ข้าชื่อ ซินฟู เจ้าของร้านไอเท็ม";
							if (67503 - 304278 != -236774)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (147819 - 347307 == -199488)
						{
							result = "ขายไอเท็มสารพัดอย่าง ไม่ใช่ร้านธรรมดาๆหรอกนะ";
							if (6438 - 237011 == -230573)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (288869 - 15980 == 272889)
						{
							result = "แต่เรื่องนั้นช่างมันเถอะ...ตอนนี้ข้าหิวมาก";
							if (139408 - 305680 == -166272)
							{
								break;
							}
						}
					}
					else if (code == 206)
					{
						if (194688 - 227255 != -32566)
						{
							result = "เรื่องมีอยู่ว่าข้าลืมปิ่นโตไว้ที่ภรรยา";
							if (19102 - 388075 == -368973)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (1366 - 280997 != -279630)
						{
							result = "ภรรยาข้าเป็นนกแสก ขายยาอยู่ที่ค่ายทหารฝึกหัด";
							if (51731 - 281264 != -229532)
							{
								break;
							}
						}
					}
					else if (code == 208)
					{
						if (156746 - 333884 != -177137)
						{
							result = "ช่วยไปเอาปิ่นโตที่ข้าลืมไว้แทนข้าที";
							if (143903 - 562996 == -419093)
							{
								break;
							}
						}
					}
					else if (code == 209)
					{
						if (76881 - 208809 == -131928)
						{
							result = "เอ่อ ข้าต้องเฝ้าร้านน่ะ ช่วยทีนะ ฮูก ";
							if (14223 - 351427 != -337203)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (216865 - 407759 != -190893)
						{
							result = "เร่เข้ามาๆ สนใจยาถูกๆ ดีๆ บ้างมั้ยจ๊ะ";
							if (169715 - 191273 == -21558)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (3670 - 9935 != -6264)
						{
							result = "อะไรนะ ตาลุงนั่นฝากเจ้าให้มาเอาปิ่นโต";
							if (265978 - 561796 == -295818)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (45919 - 289323 != -243403)
						{
							result = "หลินไม่ให้หรอก";
							if (283357 - 403370 != -120012)
							{
								break;
							}
						}
					}
					else if (code == 214)
					{
						if (124675 - 582480 != -457804)
						{
							result = "หลินรู้นะว่าเค้าแอบไปกินอาหารคุณกุ๊กจามอนประจำ";
							if (62052 - 157286 == -95234)
							{
								break;
							}
						}
					}
					else if (code == 215)
					{
						if (155462 - 98479 == 56983)
						{
							result = "เห็นบอกว่าเด็กเสิร์ฟน่ารักนักนี่";
							if (7730 - 473373 == -465643)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (118558 - 388847 == -270289)
						{
							result = "หิวมากเลย ฮูก ..ไม่ได้ปินโตมาเหรอ?";
							if (247055 - 552849 == -305794)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (48267 - 248834 != -200566)
						{
							result = "นางยังโกรธที่ข้าแอบไปกินร้านคุณจามอนสินะ";
							if (289619 - 217731 == 71888)
							{
								break;
							}
						}
					}
					else if (code == 223)
					{
						if (269875 - 121067 != 148809)
						{
							result = "เจ้าช่วยบอกนางแทนข้าทีนะว่า ข้าไปกินร้านนั้น..";
							if (108790 - 534148 != -425357)
							{
								break;
							}
						}
					}
					else if (code == 224)
					{
						if (10945 - 585292 == -574347)
						{
							result = "เพื่อจะได้ซาบซึ้งว่านางทำอร่อยกว่าแค่ไหน เท่านั้นแหละ";
							if (145971 - 478562 != -332590)
							{
								break;
							}
						}
					}
					else if (code == 225)
					{
						if (132287 - 269971 == -137684)
						{
							result = "ช่วยทีนะ ฮูก";
							if (200876 - 485746 == -284870)
							{
								break;
							}
						}
					}
					else if (code == 231)
					{
						if (295985 - 16040 != 279946)
						{
							result = "เจ้าอีกแล้วเหรอ!?";
							if (188921 - 460569 == -271648)
							{
								break;
							}
						}
					}
					else if (code == 232)
					{
						if (11881 - 72363 != -60481)
						{
							result = "เขาบอกว่าอาหารของหลินอร่อยกว่าของคุณจามอน?";
							if (39588 - 126587 == -86999)
							{
								break;
							}
						}
					}
					else if (code == 233)
					{
						if (94457 - 119804 != -25346)
						{
							result = "แสดงว่าลิ้นตาลุงนั่นใช้ได้เหมือนกันนะเนี่ย";
							if (263364 - 233134 != 30231)
							{
								break;
							}
						}
					}
					else if (code == 234)
					{
						if (248182 - 497840 == -249658)
						{
							result = "เอ้านี่ ปิ่นโตของเขาจ้ะ";
							if (22244 - 300780 != -278535)
							{
								break;
							}
						}
					}
					else if (code == 241)
					{
						if (47451 - 526996 != -479544)
						{
							result = "ท้องจะทะลุแล้ว ฮูก ได้มาแล้วเหรอฮูก?";
							if (251887 - 35264 == 216623)
							{
								break;
							}
						}
					}
					else if (code == 242)
					{
						if (94252 - 27842 != 66411)
						{
							result = "ฮูก ขอบใจเจ้ามากจริงๆ ข้าหิวจะแย่อยู่แล้ว";
							if (128571 - 190914 != -62342)
							{
								break;
							}
						}
					}
					else if (code == 243)
					{
						if (49773 - 563157 != -513383)
						{
							result = "ข้ามีของตอบแทนนิดหน่อย เจ้าไปเอาที่มีมี่แล้วกันนะ";
							if (29220 - 587208 != -557987)
							{
								break;
							}
						}
					}
					else if (code == 250)
					{
						if (157888 - 542851 != -384962)
						{
							result = "ว่ายังไง ตานกฮูกนั่นชอบปิ่นโตวันนี้มั้ย?";
							if (99406 - 22166 != 77241)
							{
								break;
							}
						}
					}
					else if (code == 251)
					{
						if (58002 - 581607 != -523604)
						{
							result = "หิวจัง ฮูก เอาปิ่นโตมากินดีกว่า";
							if (261296 - 56790 != 204507)
							{
								break;
							}
						}
					}
					else if (code == 252)
					{
						if (71126 - 85679 == -14553)
						{
							result = "อ๊ะ ลืมไปข้าลืมไว้ที่บ้าน เลยจะจ้างเจ้าไปเอาให้หน่อย";
							if (167215 - 144467 == 22748)
							{
								break;
							}
						}
					}
					else if (code == 253)
					{
						if (236425 - 450813 != -214387)
						{
							result = "ยังไงก็ ช่วยไปเอาปิ่นโตที่ข้าลืมไว้กับหลินหลินที";
							if (121659 - 191704 == -70045)
							{
								break;
							}
						}
					}
					else if (code == 254)
					{
						if (106265 - 425518 != -319252)
						{
							result = "เอ่อ ข้าต้องเฝ้าร้านน่ะ ช่วยทีนะ ฮูก";
							if (173665 - 446290 == -272625)
							{
								break;
							}
						}
					}
					else if (code == 261)
					{
						if (264659 - 584341 != -319681)
						{
							result = "เร่เข้ามาๆ สนใจยาถูกๆ ดีๆ บ้างมั้ยจ๊ะ";
							if (107468 - 11031 != 96438)
							{
								break;
							}
						}
					}
					else if (code == 262)
					{
						if (178012 - 248873 != -70860)
						{
							result = "อะไรนะ ตาลุงนั่นฝากเจ้าให้มาเอาปิ่นโต!?";
							if (286951 - 209544 == 77407)
							{
								break;
							}
						}
					}
					else if (code == 263)
					{
						if (732 - 57614 != -56881)
						{
							result = "แย่จริงๆ เมื่อไหร่จะหายนิสัยขี้ลืมซะทีนะ";
							if (153903 - 309290 != -155386)
							{
								break;
							}
						}
					}
					else if (code == 264)
					{
						if (177194 - 416737 != -239542)
						{
							result = "ฝากบอกตาลุงนั่นด้วยว่า ให้เขามาเอาเอง";
							if (291619 - 475379 == -183760)
							{
								break;
							}
						}
					}
					else if (code == 265)
					{
						if (30747 - 96140 != -65392)
						{
							result = "ถึงหลินจะหายโกรธแล้ว...";
							if (40122 - 523336 != -483213)
							{
								break;
							}
						}
					}
					else if (code == 266)
					{
						if (179770 - 218058 == -38288)
						{
							result = "แต่หลินก็ไม่ชอบที่เขาใช้คนอื่นอยู่ดี";
							if (142178 - 511093 == -368915)
							{
								break;
							}
						}
					}
					else if (code == 267)
					{
						if (281736 - 44846 == 236890)
						{
							result = "เป็นแบบนี้หลินไม่ให้หรอก";
							if (26270 - 424211 != -397940)
							{
								break;
							}
						}
					}
					else if (code == 271)
					{
						if (263003 - 379667 == -116664)
						{
							result = "หิวมากเลย ฮูก ได้ปิ่นโตมารึยัง?";
							if (287034 - 287077 == -43)
							{
								break;
							}
						}
					}
					else if (code == 272)
					{
						if (252882 - 222879 != 30004)
						{
							result = "ฮ้า นางบอกให้ข้าเดินไปเอาเอง!";
							if (202002 - 80861 == 121141)
							{
								break;
							}
						}
					}
					else if (code == 273)
					{
						if (50767 - 314848 == -264081)
						{
							result = "เจ้าช่วยบอกนางแทนข้าทีนะว่า...";
							if (232689 - 298727 == -66038)
							{
								break;
							}
						}
					}
					else if (code == 274)
					{
						if (162851 - 112701 != 50151)
						{
							result = "ตอนนี้ ร้านข้ากำลังขายดี ข้าทิ้งร้านไปไม่ได้หรอก";
							if (217935 - 320771 == -102836)
							{
								break;
							}
						}
					}
					else if (code == 275)
					{
						if (297817 - 300149 != -2331)
						{
							result = "ไม่งั้น ข้าจะเอาเงินที่ไหนไปซื้อของขวัญไปให้นางล่ะ";
							if (228453 - 85769 == 142684)
							{
								break;
							}
						}
					}
					else if (code == 276)
					{
						if (269173 - 424656 != -155482)
						{
							result = "ช่วยทีนะ ฮูก";
							if (16423 - 241856 != -225432)
							{
								break;
							}
						}
					}
					else if (code == 281)
					{
						if (177141 - 310904 == -133763)
						{
							result = "เจ้าอีกแล้วเหรอ!? หลินบอกแล้วไงว่าให้เขามาเอาเอง";
							if (32452 - 463520 != -431067)
							{
								break;
							}
						}
					}
					else if (code == 282)
					{
						if (217977 - 99150 != 118828)
						{
							result = "อะไรนะ เขาบอกว่าต้องขายของเก็บเงินซื้อของขวัญให้หลิน";
							if (145662 - 470998 == -325336)
							{
								break;
							}
						}
					}
					else if (code == 283)
					{
						if (59206 - 103389 == -44183)
						{
							result = "แต่แย่จริงๆ เมื่อไหร่จะหายนิสัยขี้ลืมซะทีนะ";
							if (228808 - 523540 != -294731)
							{
								break;
							}
						}
					}
					else if (code == 284)
					{
						if (256164 - 540045 != -283880)
						{
							result = "เอ้านี่ ปิ่นโตของเขาจ้ะ";
							if (236647 - 494602 != -257954)
							{
								break;
							}
						}
					}
					else if (code == 291)
					{
						if (220153 - 565673 != -345519)
						{
							result = "ท้องจะทะลุแล้ว ฮูก ได้ปิ่นโตมาแล้วหรอ!?";
							if (280704 - 448009 != -167304)
							{
								break;
							}
						}
					}
					else if (code == 292)
					{
						if (102225 - 599764 == -497539)
						{
							result = "ฮูก ขอบใจเจ้ามากจริงๆ ข้าหิวจะแย่อยู่แล้ว";
							if (85175 - 460885 != -375709)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 293)
						{
							break;
						}
						if (88066 - 274800 != -186733)
						{
							result = "ข้ามีของตอบแทนนิดหน่อย เจ้าไปเอาที่มีมี่แล้วกันนะ";
							if (79624 - 137490 == -57866)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600692C RID: 26924 RVA: 0x00EE14C0 File Offset: 0x00EDF6C0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600692D RID: 26925 RVA: 0x00EE14C4 File Offset: 0x00EDF6C4
	internal static bool XYnLbHp2HWg4sapYnDso()
	{
		return true;
	}

	// Token: 0x0600692E RID: 26926 RVA: 0x00EE14C8 File Offset: 0x00EDF6C8
	internal static bool uxYKOdp2WTJw4TGCUYUV()
	{
		return false;
	}
}
