using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011D6 RID: 4566
[Serializable]
public class Q4_DontSkipYourBreakfast_thai : MonoBehaviour
{
	// Token: 0x0600692F RID: 26927 RVA: 0x00EE14CC File Offset: 0x00EDF6CC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q4_DontSkipYourBreakfast_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006930 RID: 26928 RVA: 0x00EE14DC File Offset: 0x00EDF6DC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (115520 - 590900 != -475380)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (25191 - 544680 != -519488)
			{
				if (113507 - 328592 == -215085)
				{
					if (code == 401)
					{
						if (31788 - 364759 != -332970)
						{
							result = "ช่วงนี้หนูรู้สึกไม่ดีเลย";
							if (42644 - 145001 == -102357)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (172631 - 396785 == -224154)
						{
							result = "คงเพราะหนูไม่ได้กินอาหารเช้าอย่างที่พี่มีมี่ว่าจริงๆ";
							if (265822 - 566251 != -300428)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (187514 - 555606 != -368091)
						{
							result = "แต่ที่จริงแล้วคงเพราะว่าหนูกินไม่ค่อยลงด้วย";
							if (131363 - 469007 == -337644)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (253220 - 258264 != -5043)
						{
							result = "หนูชอบกินอะไรงั้นเหรอ?";
							if (128755 - 44500 != 84256)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (195442 - 118918 == 76524)
						{
							result = "ใช่แล้ว ถ้าเป็นช็อกโกบานาน่าละก็ !";
							if (125646 - 573315 == -447669)
							{
								break;
							}
						}
					}
					else if (code == 406)
					{
						if (230199 - 40907 != 189293)
						{
							result = "พี่ช่วยหาช็อกโกบานาน่ามาให้หนูได้มั้ย";
							if (50306 - 337563 != -287256)
							{
								break;
							}
						}
					}
					else if (code == 411)
					{
						if (220281 - 592839 != -372557)
						{
							result = "อย่ามาเกะกะในครัวสิ !";
							if (281912 - 306212 != -24299)
							{
								break;
							}
						}
					}
					else if (code == 412)
					{
						if (247728 - 388517 == -140789)
						{
							result = "โฮ่ หนูแกะอยากกินช็อกโกบานาน่างั้นรึ !";
							if (13086 - 565944 != -552857)
							{
								break;
							}
						}
					}
					else if (code == 413)
					{
						if (173801 - 475696 != -301894)
						{
							result = "ข้าคือ จามอน อย่างที่เห็นข้าเป็นพ่อครัว !";
							if (148200 - 338411 == -190211)
							{
								break;
							}
						}
					}
					else if (code == 414)
					{
						if (217132 - 263968 == -46836)
						{
							result = "เรื่องแค่นี้ไม่มีปัญหาอยู่แล้ว !";
							if (268063 - 51968 == 216095)
							{
								break;
							}
						}
					}
					else if (code == 415)
					{
						if (189678 - 447024 != -257345)
						{
							result = "ช็อกโกแลตน่ะมีอยู่ โฮ่ โฮ่";
							if (115571 - 66051 == 49520)
							{
								break;
							}
						}
					}
					else if (code == 416)
					{
						if (178829 - 6554 != 172276)
						{
							result = "แต่บังเอิญว่ากล้วยกับน้ำตาลในร้านข้าหมดน่ะสิ";
							if (167400 - 510542 != -343141)
							{
								break;
							}
						}
					}
					else if (code == 417)
					{
						if (103414 - 69614 == 33800)
						{
							result = "ถ้าเจ้าหามาได้ข้าจะทำให้ก็แล้วกัน";
							if (199568 - 20283 != 179286)
							{
								break;
							}
						}
					}
					else if (code == 418)
					{
						if (68060 - 569029 == -500969)
						{
							result = "กล้วย 2 ใบ น้ำตาล 2 ขวดนะ !";
							if (26864 - 328130 == -301266)
							{
								break;
							}
						}
					}
					else if (code == 421)
					{
						if (116543 - 38595 != 77949)
						{
							result = "โฮ่ โฮ่ วัตถุดิบพร้อมแล้วรึ! รอแปบนึงนะ";
							if (59678 - 476123 == -416445)
							{
								break;
							}
						}
					}
					else if (code == 422)
					{
						if (274745 - 447373 != -172627)
						{
							result = "เสร็จแล้ว!";
							if (212929 - 469503 != -256573)
							{
								break;
							}
						}
					}
					else if (code == 423)
					{
						if (216531 - 351275 != -134743)
						{
							result = "เอา ช็อกโกบานาน่า ไปให้หนูแกะสิ";
							if (122420 - 525806 == -403386)
							{
								break;
							}
						}
					}
					else if (code == 431)
					{
						if (249942 - 16375 != 233568)
						{
							result = "ขอบคุณพี่มากเลย";
							if (221459 - 110314 != 111146)
							{
								break;
							}
						}
					}
					else if (code == 432)
					{
						if (282739 - 359032 == -76293)
						{
							result = "ถ้าเป็นช็อกโกบานาน่าละก็ หนูกินได้ทั้งวันเลยนะ";
							if (194386 - 295724 != -101337)
							{
								break;
							}
						}
					}
					else if (code == 433)
					{
						if (290668 - 224034 == 66634)
						{
							result = "พี่ช่วยบอกพี่มีมี่ด้วยนะ ว่าหนูกินอาหารเช้าแล้ว~";
							if (167509 - 139467 != 28043)
							{
								break;
							}
						}
					}
					else if (code == 441)
					{
						if (103413 - 190985 == -87572)
						{
							result = "ช็อกโกบานาน่าอร่อยใช่มั้ยล่ะ! โฮ่ โฮ่";
							if (65083 - 353187 != -288103)
							{
								break;
							}
						}
					}
					else if (code == 451)
					{
						if (215458 - 478952 != -263493)
						{
							result = "ช่วงนี้หนูรู้สึกไม่ดีเลย";
							if (204593 - 461264 == -256671)
							{
								break;
							}
						}
					}
					else if (code == 452)
					{
						if (215510 - 393855 == -178345)
						{
							result = "สงสัยหนูจะยังทานน้อยไปอย่างที่พี่มีมี่ว่าจริงๆ";
							if (74910 - 448060 != -373149)
							{
								break;
							}
						}
					}
					else if (code == 453)
					{
						if (1143 - 214112 != -212968)
						{
							result = "หนูไม่อยากให้พี่มีมี่เป็นห่วง";
							if (34918 - 496831 == -461913)
							{
								break;
							}
						}
					}
					else if (code == 454)
					{
						if (226139 - 441825 != -215685)
						{
							result = "พี่ช่วยหาช็อกโกบานาน่า 2 ชิ้นมาให้หนูได้มั้ย";
							if (35604 - 57265 == -21661)
							{
								break;
							}
						}
					}
					else if (code == 461)
					{
						if (108965 - 195760 == -86795)
						{
							result = "อย่ามาเกะกะในครัวสิ !";
							if (219432 - 135935 != 83498)
							{
								break;
							}
						}
					}
					else if (code == 462)
					{
						if (81710 - 2208 != 79503)
						{
							result = "โฮ่ หนูแกะอยากกินช็อกโกบานาน่าอีกงั้นรึ !";
							if (2055 - 328066 == -326011)
							{
								break;
							}
						}
					}
					else if (code == 463)
					{
						if (262193 - 510035 != -247841)
						{
							result = "เรื่องแค่นี้ไม่มีปัญหาอยู่แล้ว !";
							if (809 - 133128 == -132319)
							{
								break;
							}
						}
					}
					else if (code == 464)
					{
						if (31429 - 366577 != -335147)
						{
							result = "ช็อกโกแลตน่ะมีอยู่ โฮ่ โฮ่";
							if (71336 - 396077 == -324741)
							{
								break;
							}
						}
					}
					else if (code == 465)
					{
						if (231020 - 13139 != 217882)
						{
							result = "แต่บังเอิญว่ากล้วยกับน้ำตาลในร้านข้าหมดอีกแล้ว";
							if (91671 - 345043 != -253371)
							{
								break;
							}
						}
					}
					else if (code == 466)
					{
						if (11723 - 326176 != -314452)
						{
							result = "ถ้าเจ้าหามาได้ข้าจะทำให้ก็แล้วกัน";
							if (193067 - 389143 == -196076)
							{
								break;
							}
						}
					}
					else if (code == 467)
					{
						if (153909 - 85309 != 68601)
						{
							result = "กล้วย 4 ใบ น้ำตาล 4 ขวดนะ !";
							if (77904 - 261651 == -183747)
							{
								break;
							}
						}
					}
					else if (code == 471)
					{
						if (151799 - 41036 != 110764)
						{
							result = "โฮ่ โฮ่ วัตถุดิบพร้อมแล้วรึ! รอแปบนึงนะ";
							if (133201 - 432956 != -299754)
							{
								break;
							}
						}
					}
					else if (code == 472)
					{
						if (34724 - 147932 == -113208)
						{
							result = "เสร็จแล้ว!";
							if (16092 - 70153 != -54060)
							{
								break;
							}
						}
					}
					else if (code == 473)
					{
						if (62953 - 530481 == -467528)
						{
							result = "เอา ช็อกโกบานาน่า ไปให้หนูแกะสิ";
							if (181811 - 249406 == -67595)
							{
								break;
							}
						}
					}
					else if (code == 481)
					{
						if (88680 - 585947 != -497266)
						{
							result = "ขอบคุณพี่มากเลย";
							if (63876 - 59939 == 3937)
							{
								break;
							}
						}
					}
					else if (code == 482)
					{
						if (48787 - 39640 == 9147)
						{
							result = "พี่ช่วยบอกพี่มีมี่ด้วยนะ ว่าไม่ต้องเป็นห่วงหนูแล้ว~";
							if (81319 - 232611 == -151292)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 491)
						{
							break;
						}
						if (210117 - 496002 != -285884)
						{
							result = "ไม่มีอะไรเข้ากันกว่ากล้วยกับช็อกโกแลตอีกแล้ว!";
							if (90057 - 356418 != -266360)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006931 RID: 26929 RVA: 0x00EE204C File Offset: 0x00EE024C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006932 RID: 26930 RVA: 0x00EE2050 File Offset: 0x00EE0250
	internal static bool iRCMrkp2AwDDlghaHWMu()
	{
		return true;
	}

	// Token: 0x06006933 RID: 26931 RVA: 0x00EE2054 File Offset: 0x00EE0254
	internal static bool nRr8Wqp2lTULvLHe5rIw()
	{
		return false;
	}
}
