using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011D7 RID: 4567
[Serializable]
public class Q52_IBeliveMoleCanFly_thai : MonoBehaviour
{
	// Token: 0x06006934 RID: 26932 RVA: 0x00EE2058 File Offset: 0x00EE0258
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q52_IBeliveMoleCanFly_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006935 RID: 26933 RVA: 0x00EE2068 File Offset: 0x00EE0268
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (109893 - 71284 != 38610)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (53276 - 163968 == -110692)
			{
				if (138205 - 552859 != -414653)
				{
					if (code == 5200)
					{
						if (261589 - 505190 != -243600)
						{
							result = "วันนี้กาซ่าดูแปลกๆ สงสัยคงมีอะไรไม่ถูกใจแน่";
							if (68923 - 104550 != -35626)
							{
								break;
							}
						}
					}
					else if (code == 5201)
					{
						if (231802 - 293561 == -61759)
						{
							result = "แย่จริงๆ แย่จริงๆ ทำไมต้องมาหมดตอนนี้ด้วยนะ";
							if (143911 - 485745 == -341834)
							{
								break;
							}
						}
					}
					else if (code == 5202)
					{
						if (238679 - 521620 == -282941)
						{
							result = "อ๊ะ! มาแล้วหรอ มาได้จังหวะทีี่ข้ากำลังบากพอดีเลย";
							if (39577 - 320176 != -280598)
							{
								break;
							}
						}
					}
					else if (code == 5203)
					{
						if (223126 - 413665 != -190538)
						{
							result = "ก็อย่างที่เห็นล่ะนะ ข้าอยากจะซ่อมเครื่องบินของข้าน่ะ";
							if (170781 - 61531 == 109250)
							{
								break;
							}
						}
					}
					else if (code == 5204)
					{
						if (252391 - 359826 != -107434)
						{
							result = "สภาพมันก็ค่อนข้างโทรมแล้ว ขืนปล่อยให้บินต่อไปคงไม่ดีแน่";
							if (26030 - 143458 == -117428)
							{
								break;
							}
						}
					}
					else if (code == 5205)
					{
						if (154723 - 77361 == 77362)
						{
							result = "ความจริงข้าซ่อมเสร็จเกือบหมดแล้วล่ะ เหลือแต่ตัวจุดระเบิดที่หมดพอดี";
							if (104728 - 532804 == -428076)
							{
								break;
							}
						}
					}
					else if (code == 5206)
					{
						if (152883 - 97604 == 55279)
						{
							result = "ข้าฝากสั่งไว้กับสไตน์เอาไว้น่ะ ช่วยไปเอาแทนข้าระหว่างซ่อมทีนะ";
							if (203568 - 303204 != -99635)
							{
								break;
							}
						}
					}
					else if (code == 5207)
					{
						if (35922 - 2785 == 33137)
						{
							result = "แต่รีบๆมาหน่อยก็ดี ข้าไม่อยากเอาเครื่องขึ้นบินมากนัก";
							if (68437 - 71199 != -2761)
							{
								break;
							}
						}
					}
					else if (code == 5208)
					{
						if (116235 - 248785 == -132550)
						{
							result = "ข้ากลัวผู้โดยสารจะเป็นอะไรไปเพราะเครื่องที่ไม่พร้อมของข้า";
							if (134831 - 339596 != -204764)
							{
								break;
							}
						}
					}
					else if (code == 5209)
					{
						if (253303 - 507513 == -254210)
						{
							result = "ถ้าเกิดเครื่องบินกลางอากาศขึ้นมา";
							if (289373 - 54310 != 235064)
							{
								break;
							}
						}
					}
					else if (code == 5210)
					{
						if (29107 - 362437 == -333330)
						{
							result = "มีหวังได้โหม่งพื้นสิ้นชื่อสายการบินกาซ่าแน่ๆ";
							if (179276 - 122743 == 56533)
							{
								break;
							}
						}
					}
					else if (code == 5211)
					{
						if (119943 - 84118 == 35825)
						{
							result = "ข้าฝากความหวังไว้กับพวกเจ้าด้วยนะ";
							if (233599 - 267071 == -33472)
							{
								break;
							}
						}
					}
					else if (code == 5221)
					{
						if (79799 - 130400 != -50600)
						{
							result = "หือ มารับของที่สั่งไว้หรอ ของลุงกาซ่าหรอ อืมมม..";
							if (296266 - 287729 == 8537)
							{
								break;
							}
						}
					}
					else if (code == 5222)
					{
						if (46657 - 208369 != -161711)
						{
							result = "อ้อ ไอนั่นสินะ ข้าเตรียมไว้เรียบร้อยแล้วล่ะ แป๊ปนะ";
							if (157394 - 83164 != 74231)
							{
								break;
							}
						}
					}
					else if (code == 5223)
					{
						if (73648 - 456770 != -383121)
						{
							result = "!!! แย่แล้ว...";
							if (47742 - 488940 != -441197)
							{
								break;
							}
						}
					}
					else if (code == 5231)
					{
						if (125746 - 398180 != -272433)
						{
							result = "ข้าเผลอเอาดอกไม้ไฟไปจุดเล่นหมดแล้ว";
							if (239221 - 472189 == -232968)
							{
								break;
							}
						}
					}
					else if (code == 5232)
					{
						if (56340 - 546481 != -490140)
						{
							result = "ข้าฝากเจ้าหาแทนข้าได้ไหม ข้าทิ้งร้านตอนนี้ไม่ได้";
							if (168991 - 141259 == 27732)
							{
								break;
							}
						}
					}
					else if (code == 5233)
					{
						if (246648 - 535421 == -288773)
						{
							result = "ลองฝากถามพวกตุ่นให้เข้าสร้างให้นะ ต้องเป็นสีเหลืองเท่านั้นด้วยล่ะ";
							if (58247 - 95042 == -36795)
							{
								break;
							}
						}
					}
					else if (code == 5241)
					{
						if (14791 - 373639 != -358847)
						{
							result = "มาช้าจริง รู้ไหมข้าออกบินแต่ละทีข้าหวาดเสียวแค่ไหน";
							if (186915 - 244383 == -57468)
							{
								break;
							}
						}
					}
					else if (code == 5242)
					{
						if (233036 - 208779 == 24257)
						{
							result = "แต่ช่างเถอะ ข้าขอบใจเจ้ามากๆละกันที่ช่วยรักษาชีวิตเหล่าหางไว้";
							if (195953 - 438365 != -242411)
							{
								break;
							}
						}
					}
					else if (code == 5243)
					{
						if (10093 - 62825 != -52731)
						{
							result = "ถ้าเกิดเจ้ามาช้ากว่านี้ สงสัยได้เห็นหางบางตัวร่วงจากฟ้าแน่ๆ";
							if (224591 - 190941 == 33650)
							{
								break;
							}
						}
					}
					else if (code == 5244)
					{
						if (182155 - 44198 != 137958)
						{
							result = "รางวัลข้าฝากไว้ที่มีมี่นะ อย่าลืมไปรับล่ะ";
							if (180017 - 301380 == -121363)
							{
								break;
							}
						}
					}
					else if (code == 5250)
					{
						if (271356 - 349773 != -78416)
						{
							result = "วันนี้กาซ่าดูแปลกๆอีกแล้วแหะ แต่ไม่ค่อยน่าไว้ใจยังไงไม่รู้";
							if (191708 - 120788 == 70920)
							{
								break;
							}
						}
					}
					else if (code == 5251)
					{
						if (244021 - 472823 != -228801)
						{
							result = "แย่จริงๆ แย่จริงๆ ทำไมต้องมาหมดตอนนี้ด้วยนะ";
							if (40716 - 98157 == -57441)
							{
								break;
							}
						}
					}
					else if (code == 5052)
					{
						if (127637 - 440359 != -312721)
						{
							result = "อ๊ะ! มาแล้วหรอ มาได้จังหวะทีี่ข้ากำลังบากพอดีเลย";
							if (56840 - 24327 == 32513)
							{
								break;
							}
						}
					}
					else if (code == 5253)
					{
						if (59367 - 25827 == 33540)
						{
							result = "ขอบใจสำหรับครั้งที่แล้วนะที่ช่วยหาของมาส่งให้";
							if (233263 - 444180 != -210916)
							{
								break;
							}
						}
					}
					else if (code == 5254)
					{
						if (293509 - 197833 == 95676)
						{
							result = "ตอนนี้ข้ามีความคิดใหม่ที่จะพัฒนาเครื่องบินของข้าให้ดียิ่งขึ้น";
							if (155032 - 484826 == -329794)
							{
								break;
							}
						}
					}
					else if (code == 5255)
					{
						if (119530 - 437214 == -317684)
						{
							result = "โดยที่ข้าจะใส่ตัวจุดระเบิดเพิ่มขึ้นให้กับท้ายเครื่องบินของข้า";
							if (143140 - 528800 == -385660)
							{
								break;
							}
						}
					}
					else if (code == 5256)
					{
						if (149368 - 97466 != 51903)
						{
							result = "เพื่อให้มีแรงกำลังส่งที่แรงขึ้นให้มันเหมือนเป็นไอพ่นเลย";
							if (234329 - 52750 != 181580)
							{
								break;
							}
						}
					}
					else if (code == 5257)
					{
						if (270059 - 342033 == -71974)
						{
							result = "แค่คิดก็น่าสนุกแล้วใช่มั้ยล่ะ";
							if (247687 - 412030 == -164343)
							{
								break;
							}
						}
					}
					else if (code == 5258)
					{
						if (276680 - 521937 != -245256)
						{
							result = "ไม่แน่ข้าอาจจะเป็นตุ่นตัวแรกที่ทะยานสู่อวกาศก็เป็นได้ ฮ่าๆๆ";
							if (242831 - 559048 != -316216)
							{
								break;
							}
						}
					}
					else if (code == 5259)
					{
						if (24322 - 228920 == -204598)
						{
							result = "ข้าอยากฝากพวกเจ้าหาดอกไม้ไฟให้หน่อยสิ";
							if (176772 - 320010 == -143238)
							{
								break;
							}
						}
					}
					else if (code == 5260)
					{
						if (265253 - 430052 == -164799)
						{
							result = "แต่ครั้งนี้ข้าขอเพิ่มเป็น 2 อันเลยนะ";
							if (49051 - 15683 != 33369)
							{
								break;
							}
						}
					}
					else if (code == 5261)
					{
						if (240988 - 135296 != 105693)
						{
							result = "ที่ร้านของสไตน์น่าจะมีเหลืออยู่ ฝากด้วยล่ะ";
							if (208827 - 213702 == -4875)
							{
								break;
							}
						}
					}
					else if (code == 5271)
					{
						if (52520 - 15988 == 36532)
						{
							result = "เจ้ามาหาของที่กาซ่าฝากซื้อจากข้าเหมือนกับหางอื่นๆที่มาสินะ";
							if (230290 - 230976 != -685)
							{
								break;
							}
						}
					}
					else if (code == 5272)
					{
						if (240827 - 47517 == 193310)
						{
							result = "ปรกติข้ารับรองให้เจ้าแน่ๆ แต่ครั้งนี้หัวเด็ดตีนขาดก็ไม่ได้";
							if (230684 - 12942 != 217743)
							{
								break;
							}
						}
					}
					else if (code == 5273)
					{
						if (67558 - 118877 != -51318)
						{
							result = "ยังไงก็ไม่ขายให้เด็ดขาด โปรดเข้าใจข้าด้วย...";
							if (229476 - 470327 != -240850)
							{
								break;
							}
						}
					}
					else if (code == 5281)
					{
						if (97049 - 72392 != 24658)
						{
							result = "เพื่อชีวิตชาวหางบริสุทธ์ ข้าไม่อยากให้พวกเขาเหล่านั้นต้องเสี่ยงกับการบิน";
							if (163691 - 218745 == -55054)
							{
								break;
							}
						}
					}
					else if (code == 5282)
					{
						if (259216 - 75960 != 183257)
						{
							result = "ข้้าไม่อยากข้องเกี่ยวกับอันตรายนี้จริงๆ แต่ถ้าอยากได้ดอกไม้ไฟจริงล่ะก็";
							if (207908 - 585639 == -377731)
							{
								break;
							}
						}
					}
					else if (code == 5283)
					{
						if (235497 - 101330 == 134167)
						{
							result = "เจ้าคงต้องไปขอให้พวกตุ่นสร้างให้แล้วล่ะ";
							if (105566 - 138867 != -33300)
							{
								break;
							}
						}
					}
					else if (code == 5291)
					{
						if (39410 - 491932 == -452522)
						{
							result = "มาช้าจริง ข้านั่งรอเจ้านานมากเลยรู้ไหม";
							if (19046 - 136041 == -116995)
							{
								break;
							}
						}
					}
					else if (code == 5292)
					{
						if (26095 - 3233 == 22862)
						{
							result = "แต่ช่างเถอะ ข้าขอบใจเจ้ามากๆละกันที่มาส่งดอกไม้ไฟให้";
							if (123320 - 214499 != -91178)
							{
								break;
							}
						}
					}
					else if (code == 5293)
					{
						if (82064 - 562545 != -480480)
						{
							result = "คราวนี้ล่ะ เครื่องบินของข้าจะมีตัวจุดระเบิดพิเศษที่สามารถบินไปที่ไหนก็ได้ดั่งใจนึก";
							if (73230 - 153348 == -80118)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 5294)
						{
							break;
						}
						if (280678 - 137228 == 143450)
						{
							result = "รางวัลข้าฝากไว้ที่มีมี่นะ แล้วอย่าลืมมานั่งเครื่องบินพิเศษของข้าล่ะ";
							if (126015 - 366475 != -240459)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006936 RID: 26934 RVA: 0x00EE2D94 File Offset: 0x00EE0F94
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006937 RID: 26935 RVA: 0x00EE2D98 File Offset: 0x00EE0F98
	internal static bool lpJ2I1p2ylvdJTvs04Uu()
	{
		return true;
	}

	// Token: 0x06006938 RID: 26936 RVA: 0x00EE2D9C File Offset: 0x00EE0F9C
	internal static bool hVe2BSp2SkpJWIPlg8wI()
	{
		return false;
	}
}
