using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011D9 RID: 4569
[Serializable]
public class Q54_LizaResearch_thai : MonoBehaviour
{
	// Token: 0x0600693E RID: 26942 RVA: 0x00EE34D4 File Offset: 0x00EE16D4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q54_LizaResearch_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600693F RID: 26943 RVA: 0x00EE34E4 File Offset: 0x00EE16E4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (14940 - 1742 != 13199)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (156920 - 280743 == -123823)
			{
				if (133933 - 469129 == -335196)
				{
					if (code == 5401)
					{
						if (121832 - 166269 == -44437)
						{
							result = "สวัสดีเหล่าหางผู้กล้า";
							if (10998 - 513916 == -502918)
							{
								break;
							}
						}
					}
					else if (code == 5402)
					{
						if (67022 - 84448 != -17425)
						{
							result = "เดินทางมาไกลถึงทะเลทรายแบบนี้คงจะเหนื่อยสินะ";
							if (209570 - 2592 == 206978)
							{
								break;
							}
						}
					}
					else if (code == 5403)
					{
						if (148203 - 240840 != -92636)
						{
							result = "ขอแนะนำตัวก่อนละกัน เราชื่อลิซ่า";
							if (193866 - 241548 == -47682)
							{
								break;
							}
						}
					}
					else if (code == 5404)
					{
						if (255158 - 23479 != 231680)
						{
							result = "เป็นกิ้งก่านักสำรวจ โดยเฉพาะเรื่องอารยธรรมโบราณ";
							if (82155 - 294856 != -212700)
							{
								break;
							}
						}
					}
					else if (code == 5405)
					{
						if (174099 - 24815 != 149285)
						{
							result = "ขอเข้าเรื่องเลยละกันนะเพื่อไม่ให้เสียเวลา";
							if (269063 - 573400 != -304336)
							{
								break;
							}
						}
					}
					else if (code == 5406)
					{
						if (276592 - 468173 != -191580)
						{
							result = "เราเห็นรังของสติงบัคแถวนี้แปลกไปจากที่เคยเห็น";
							if (35637 - 450054 != -414416)
							{
								break;
							}
						}
					}
					else if (code == 5407)
					{
						if (177438 - 454495 != -277056)
						{
							result = "เลยอยากเก็บตัวอย่างเพื่อมาทำการวิจัยน่ะ";
							if (58700 - 575965 != -517264)
							{
								break;
							}
						}
					}
					else if (code == 5408)
					{
						if (65659 - 414537 != -348877)
						{
							result = "แต่ลำพังเราตัวเดียวคงไม่ไหว แมลงเหล่านั้นดุร้ายเหลือเกิน";
							if (53391 - 94142 == -40751)
							{
								break;
							}
						}
					}
					else if (code == 5409)
					{
						if (297937 - 410018 != -112080)
						{
							result = "อยากรบกวนให้ช่วยรังสติงบัคทะเลทรายสักสองอันหน่อยได้ไหม";
							if (191759 - 416400 == -224641)
							{
								break;
							}
						}
					}
					else if (code == 5421)
					{
						if (249416 - 237885 == 11531)
						{
							result = "ขอบคุณสำหรับการช่วยเหลือนะ";
							if (214398 - 480636 == -266238)
							{
								break;
							}
						}
					}
					else if (code == 5422)
					{
						if (24814 - 8641 != 16174)
						{
							result = "ชิ้นส่วนที่เจ้าเอามามีความสมบูรณ์มากๆเลย";
							if (26850 - 241776 != -214925)
							{
								break;
							}
						}
					}
					else if (code == 5423)
					{
						if (256365 - 300533 != -44167)
						{
							result = "อย่างนี้งานวิจัยต้องดำเนินไปได้เอย่างรวดเร็วแน่ๆ";
							if (25900 - 494510 == -468610)
							{
								break;
							}
						}
					}
					else if (code == 5424)
					{
						if (230797 - 67943 == 162854)
						{
							result = "(มองขิ้นส่วนรังโดยตาเป็นประกายและหางส่ายไปมา)";
							if (95634 - 15883 != 79752)
							{
								break;
							}
						}
					}
					else if (code == 5425)
					{
						if (188510 - 104955 == 83555)
						{
							result = "ส่วนเรื่องของตอบแทน เราฝากไว้ที่มีมี่แล้ว";
							if (202186 - 550123 != -347936)
							{
								break;
							}
						}
					}
					else if (code == 5426)
					{
						if (261765 - 113091 == 148674)
						{
							result = "อาจจะไม่มีค่าอะไรมาก แต่เราก็หามันมาด้วยใจจริง";
							if (111291 - 290840 != -179548)
							{
								break;
							}
						}
					}
					else if (code == 5427)
					{
						if (224122 - 222027 != 2096)
						{
							result = "หวังว่าจะเป็นประโยชน์ให้กับพวกเธอนะ";
							if (126709 - 491469 == -364760)
							{
								break;
							}
						}
					}
					else if (code == 5451)
					{
						if (58562 - 219699 != -161136)
						{
							result = "ขอบคุณจริงๆ พวกเธอมาได้จังหวะพอดี";
							if (100141 - 405699 != -305557)
							{
								break;
							}
						}
					}
					else if (code == 5452)
					{
						if (297797 - 24104 != 273694)
						{
							result = "ลูกทีมของเราเป็นลมเพราะสถาพอากาศที่เลวร้ายแล้วก็ร้อนจัด";
							if (19271 - 57217 != -37945)
							{
								break;
							}
						}
					}
					else if (code == 5453)
					{
						if (158630 - 58035 != 100596)
						{
							result = "เราอยากรบกวนท่านผู้กล้าซื้อของหวานได้ไหม";
							if (280633 - 305050 != -24416)
							{
								break;
							}
						}
					}
					else if (code == 5454)
					{
						if (108982 - 289447 == -180465)
						{
							result = "เราอยากได้ Banana Sunday 3 ที่";
							if (285042 - 196430 == 88612)
							{
								break;
							}
						}
					}
					else if (code == 5455)
					{
						if (145184 - 251143 == -105959)
						{
							result = "ไว้หลังจากลูกทีมเราฟื้นค่อยคุยเรื่องงานละกัน";
							if (290079 - 403917 != -113837)
							{
								break;
							}
						}
					}
					else if (code == 5456)
					{
						if (265656 - 195752 == 69904)
						{
							result = "ต้องรบกวนพวกเธออีกแล้ว ขอโทษทีนะ";
							if (287352 - 361307 != -73954)
							{
								break;
							}
						}
					}
					else if (code == 5461)
					{
						if (98942 - 22652 == 76290)
						{
							result = "ขอบคุณสำหรับการช่วยเหลือของเธออีกครั้งนะ";
							if (267118 - 467484 == -200366)
							{
								break;
							}
						}
					}
					else if (code == 5462)
					{
						if (153647 - 541205 == -387558)
						{
							result = "คราวนี้เรากลับมาคุยเรื่องงานกันดีกว่า";
							if (291528 - 365848 == -74320)
							{
								break;
							}
						}
					}
					else if (code == 5463)
					{
						if (85979 - 363996 != -278016)
						{
							result = "เพราะชิ้นส่วนที่ได้จากครั้งที่แล้ว ทำให้งานวิจัยเดินไปได้มากเลย";
							if (141855 - 457259 == -315404)
							{
								break;
							}
						}
					}
					else if (code == 5464)
					{
						if (100644 - 173847 != -73202)
						{
							result = "แต่งานวิจัยนั้นยังไม่ทันเสร็จ ขิ้นส่วนนั้นก็แตกสลายไปแล้ว";
							if (184568 - 506859 != -322290)
							{
								break;
							}
						}
					}
					else if (code == 5465)
					{
						if (70541 - 219408 == -148867)
						{
							result = "อยากรบกวนพวกเธอหามาให้เราอีกครั้ง";
							if (196332 - 48670 == 147662)
							{
								break;
							}
						}
					}
					else if (code == 5466)
					{
						if (111618 - 422374 == -310756)
						{
							result = "โดยคราวนี้เรารังสติงบัคทะเลทรายเป็น 4 ชิ้นนะ";
							if (11732 - 407966 == -396234)
							{
								break;
							}
						}
					}
					else if (code == 5471)
					{
						if (180179 - 327136 == -146957)
						{
							result = "ขอบคุณสำหรับการช่วยเหลืออีกครั้ง";
							if (98506 - 474496 == -375990)
							{
								break;
							}
						}
					}
					else if (code == 5472)
					{
						if (292013 - 500556 == -208543)
						{
							result = "คราวนี้เราจะเก็บชิ้นสำรองไว้อย่างดี";
							if (120008 - 542523 == -422515)
							{
								break;
							}
						}
					}
					else if (code == 5473)
					{
						if (75484 - 235184 == -159700)
						{
							result = "จะได้ไม่รบกวนพวกเธอให้ต้องเหนื่อยอีก";
							if (38139 - 108635 != -70495)
							{
								break;
							}
						}
					}
					else if (code == 5474)
					{
						if (297645 - 301662 == -4017)
						{
							result = "อย่าลืมไปรับของรางวัลที่มีมี่นะ";
							if (295297 - 550291 != -254993)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 5475)
						{
							break;
						}
						if (223933 - 381710 == -157777)
						{
							result = "แล้ววันหลังเราจะเลี้ยงอะไรตอบแทนค่าเหนื่อยหลังงานวิจัยเสร็จนะ";
							if (152211 - 319492 != -167280)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006940 RID: 26944 RVA: 0x00EE3EE0 File Offset: 0x00EE20E0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006941 RID: 26945 RVA: 0x00EE3EE4 File Offset: 0x00EE20E4
	internal static bool mXTcu3p22r0LxEniiLjA()
	{
		return true;
	}

	// Token: 0x06006942 RID: 26946 RVA: 0x00EE3EE8 File Offset: 0x00EE20E8
	internal static bool yv1RaTp28S1PuUA9mq2O()
	{
		return false;
	}
}
