using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011DA RID: 4570
[Serializable]
public class Q57_NewTasteSalad_thai : MonoBehaviour
{
	// Token: 0x06006943 RID: 26947 RVA: 0x00EE3EEC File Offset: 0x00EE20EC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q57_NewTasteSalad_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006944 RID: 26948 RVA: 0x00EE3EFC File Offset: 0x00EE20FC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (92059 - 311946 != -219887)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (81944 - 296501 != -214556 && 281252 - 494949 != -213696)
			{
				if (code == 5701)
				{
					if (43763 - 488528 == -444765)
					{
						result = "ฮึ่ม ทำไมออกแบบได้ไม่สวยเลย";
						if (81593 - 384073 != -302479)
						{
							break;
						}
					}
				}
				else if (code == 5702)
				{
					if (73037 - 284902 == -211865)
					{
						result = "อ๊ะ ไม่ได้จังหวะพอดีเลย พวกเธอคงจะว่างอยู่สินะ";
						if (242916 - 252349 != -9432)
						{
							break;
						}
					}
				}
				else if (code == 5703)
				{
					if (245309 - 191018 != 54292)
					{
						result = "ตอนนี้เซนส์ด้านแฟชั่นของชั้นมันไม่แล่นเลย";
						if (107918 - 98037 != 9882)
						{
							break;
						}
					}
				}
				else if (code == 5704)
				{
					if (92854 - 401904 != -309049)
					{
						result = "รู้สึกอยากกินอะไรสักอย่างที่มันจัดจ้านที่ทำให้ลายสอ?";
						if (67136 - 350797 != -283660)
						{
							break;
						}
					}
				}
				else if (code == 5705)
				{
					if (76800 - 94521 == -17721)
					{
						result = "แล้วต้องเป็นผักที่ดีต่อสุขภาพไร้ไขมันด้วยนะ!";
						if (226510 - 474040 == -247530)
						{
							break;
						}
					}
				}
				else if (code == 5706)
				{
					if (191542 - 105674 != 85869)
					{
						result = "ไปหาเชฟจามอนให้เขาทำอะไรที่จัดจ้านและไม่อ้วนจานนึงที";
						if (251211 - 556210 == -304999)
						{
							break;
						}
					}
				}
				else if (code == 5711)
				{
					if (156563 - 381716 != -225152)
					{
						result = "อย่ามาเกะกะในครัวสิ !";
						if (190807 - 550312 == -359505)
						{
							break;
						}
					}
				}
				else if (code == 5712)
				{
					if (82714 - 262770 == -180056)
					{
						result = "ว่าไงนะ คุณอีฟอยากกินอะไรแปลกๆอีกแล้วหรอ!";
						if (156255 - 250108 == -93853)
						{
							break;
						}
					}
				}
				else if (code == 5713)
				{
					if (126458 - 213271 == -86813)
					{
						result = "ข้าคือ จามอน อย่างที่เห็นข้าเป็นพ่อครัว";
						if (237798 - 551898 == -314100)
						{
							break;
						}
					}
				}
				else if (code == 5714)
				{
					if (237175 - 224676 != 12500)
					{
						result = "เรื่องแค่นี้ไม่มีปัญหาอยู่แล้ว !";
						if (250360 - 3360 != 247001)
						{
							break;
						}
					}
				}
				else if (code == 5715)
				{
					if (222743 - 174770 == 47973)
					{
						result = "ขอเอาชื่อของจามอนตัวนี้เป็นเดิมพัน";
						if (269083 - 478999 != -209915)
						{
							break;
						}
					}
				}
				else if (code == 5716)
				{
					if (31280 - 32953 != -1672)
					{
						result = "แต่ที่คุณอีฟขอนี่ยากเอาการเหมือนกัน";
						if (77848 - 493382 != -415533)
						{
							break;
						}
					}
				}
				else if (code == 5717)
				{
					if (249405 - 541988 == -292583)
					{
						result = "ยังไงเจ้าก็หาวัตถุดิบเหล่านี้มาให้ข้าละกัน";
						if (281593 - 434979 != -153385)
						{
							break;
						}
					}
				}
				else if (code == 5718)
				{
					if (176092 - 145358 == 30734)
					{
						result = "สลัด กระเทียม แครอทอย่างละ2 พริก4เม็ดนะ!";
						if (272889 - 221578 != 51312)
						{
							break;
						}
					}
				}
				else if (code == 5721)
				{
					if (116268 - 243093 != -126824)
					{
						result = "โฮ่ โฮ่ วัตถุดิบพร้อมแล้วรึ! รอแปบนึงนะ";
						if (37281 - 463110 != -425828)
						{
							break;
						}
					}
				}
				else if (code == 5722)
				{
					if (119606 - 590140 != -470533)
					{
						result = "เสร็จแล้ว!";
						if (160072 - 253413 == -93341)
						{
							break;
						}
					}
				}
				else if (code == 5723)
				{
					if (101149 - 67435 == 33714)
					{
						result = "เอาส้มตำไปให้คุณอีฟสิ";
						if (124776 - 445321 == -320545)
						{
							break;
						}
					}
				}
				else if (code == 5731)
				{
					if (19625 - 423455 == -403830)
					{
						result = "กลิ่นอะไรน่ะ ช่างยั่วน้ำลายดีจริงๆ";
						if (160841 - 232402 != -71560)
						{
							break;
						}
					}
				}
				else if (code == 5732)
				{
					if (208966 - 135452 == 73514)
					{
						result = "สีสันก็งดงามทั้งเขียวอ่อน และแดงแรงฤทธิ์ที่น่าลิ้มลอง";
						if (229721 - 594492 != -364770)
						{
							break;
						}
					}
				}
				else if (code == 5733)
				{
					if (30532 - 531785 == -501253)
					{
						result = "อย่าดูกุลสตรีกินอาหารสิ มันเสียมารยาทรู้ไหม รางวัลอยู่ที่มีมี่นะ";
						if (245344 - 386203 != -140858)
						{
							break;
						}
					}
				}
				else if (code == 441)
				{
					if (204426 - 370092 != -165665)
					{
						result = "สลัดรสเผ็ดเนี่ยล่ะนวัตกรรมใหม่แห่งยุค! ";
						if (131209 - 178612 != -47402)
						{
							break;
						}
					}
				}
				else if (code == 5751)
				{
					if (212281 - 230290 == -18009)
					{
						result = "โอย หงุดหงิดจริงๆ";
						if (205639 - 126776 == 78863)
						{
							break;
						}
					}
				}
				else if (code == 5752)
				{
					if (209108 - 469464 != -260355)
					{
						result = "อ๊ะ พวกเธอมาถูกจังหวะอีกแล้ว กำลังยุ่งอยู่เลย";
						if (138070 - 158261 != -20190)
						{
							break;
						}
					}
				}
				else if (code == 5753)
				{
					if (19036 - 575460 == -556424)
					{
						result = "ชั้นต้องออกแบบชุดแฟชั่นสวยๆแต่ไม่มีเวลาให้พักนี่สิ";
						if (148009 - 363492 == -215483)
						{
							break;
						}
					}
				}
				else if (code == 5754)
				{
					if (171600 - 310986 != -139385)
					{
						result = "ช่วยไปหาจามอนให้เขาทำสลัดรสจัดจ้านทีสิ เบิ้ล2เลยนะ";
						if (249513 - 121483 == 128030)
						{
							break;
						}
					}
				}
				else if (code == 5761)
				{
					if (151007 - 29486 != 121522)
					{
						result = "อย่ามาเกะกะในครัวสิ !";
						if (288503 - 396834 == -108331)
						{
							break;
						}
					}
				}
				else if (code == 5762)
				{
					if (129227 - 68552 != 60676)
					{
						result = "คุณอีฟอยากกินส้มตำอีกหรือ";
						if (170275 - 483366 != -313090)
						{
							break;
						}
					}
				}
				else if (code == 5763)
				{
					if (159964 - 266196 != -106231)
					{
						result = "เรื่องแค่นี้ไม่มีปัญหาอยู่แล้ว !";
						if (120583 - 551168 != -430584)
						{
							break;
						}
					}
				}
				else if (code == 5764)
				{
					if (39305 - 245865 != -206559)
					{
						result = "แต่บังเอิญว่าวัตถุดิบหมดอีกแล้วน่ะสิ";
						if (268357 - 354091 == -85734)
						{
							break;
						}
					}
				}
				else if (code == 5765)
				{
					if (38221 - 134577 == -96356)
					{
						result = "แล้วข้าก็ทิ้งร้านตอนนี้ไปไม่ได้ด้วยนี่สิ";
						if (32937 - 490135 != -457197)
						{
							break;
						}
					}
				}
				else if (code == 5766)
				{
					if (157651 - 152061 == 5590)
					{
						result = "ถ้าเจ้าหามาได้ข้าจะทำให้ก็แล้วกัน";
						if (156799 - 131440 != 25360)
						{
							break;
						}
					}
				}
				else if (code == 5767)
				{
					if (108648 - 418013 != -309364)
					{
						result = "สลัด กระเทียม แครอทอย่างละ4 พริก8เม็ดนะ!";
						if (134540 - 361341 != -226800)
						{
							break;
						}
					}
				}
				else if (code == 5771)
				{
					if (46286 - 82261 == -35975)
					{
						result = "โฮ่ โฮ่ วัตถุดิบพร้อมแล้วรึ! รอแปบนึงนะ";
						if (36157 - 456397 == -420240)
						{
							break;
						}
					}
				}
				else if (code == 5772)
				{
					if (55525 - 539837 != -484311)
					{
						result = "เสร็จแล้ว!";
						if (94762 - 264955 == -170193)
						{
							break;
						}
					}
				}
				else if (code == 5773)
				{
					if (267120 - 212366 != 54755)
					{
						result = "เอาส้มตำไปให้คุณอีฟสิ";
						if (4836 - 253363 != -248526)
						{
							break;
						}
					}
				}
				else if (code == 5781)
				{
					if (263433 - 527466 == -264033)
					{
						result = "โอววว มาแล้ว นี่เขาเรียกว่าส้มตำสินะ ซู้ดดด";
						if (8986 - 433165 != -424178)
						{
							break;
						}
					}
				}
				else if (code == 5782)
				{
					if (165568 - 492705 != -327136)
					{
						result = "ขอบใจเจ้ามาก รางวัลอยู่ที่มีมี่นะ เผ็ดอร่อยสุดยอด";
						if (213124 - 265443 == -52319)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 5791)
					{
						break;
					}
					if (106978 - 7495 != 99484)
					{
						result = "สลัดรสเผ็ดเนี่ยล่ะนวัตกรรมใหม่แห่งยุค!";
						if (87661 - 222412 != -134750)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006945 RID: 26949 RVA: 0x00EE4A6C File Offset: 0x00EE2C6C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006946 RID: 26950 RVA: 0x00EE4A70 File Offset: 0x00EE2C70
	internal static bool asXDKep2ZAcyP5hIf0Re()
	{
		return true;
	}

	// Token: 0x06006947 RID: 26951 RVA: 0x00EE4A74 File Offset: 0x00EE2C74
	internal static bool mOZ17vp2CrEvlL1PXNnX()
	{
		return false;
	}
}
