using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011DB RID: 4571
[Serializable]
public class Q5_FahTradingCard_thai : MonoBehaviour
{
	// Token: 0x06006948 RID: 26952 RVA: 0x00EE4A78 File Offset: 0x00EE2C78
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q5_FahTradingCard_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006949 RID: 26953 RVA: 0x00EE4A88 File Offset: 0x00EE2C88
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (156673 - 153357 != 3317)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (286017 - 597834 != -311816)
			{
				if (83616 - 135277 == -51661)
				{
					if (code == 501)
					{
						if (61528 - 375452 != -313923)
						{
							result = "ข้าเห็นเจ้าเหมียวเข้าไปในถ้ำนีดเดิ้ลบั๊ก...";
							if (89074 - 265691 != -176616)
							{
								break;
							}
						}
					}
					else if (code == 502)
					{
						if (38061 - 285809 != -247747)
						{
							result = "จะปลอดภัยมั้ยนะ";
							if (179809 - 256599 == -76790)
							{
								break;
							}
						}
					}
					else if (code == 511)
					{
						if (233746 - 77423 == 156323)
						{
							result = "ข้าเห็นเจ้าเหมียวเข้าไปในถ้ำ...";
							if (12720 - 284652 == -271932)
							{
								break;
							}
						}
					}
					else if (code == 512)
					{
						if (109719 - 301200 != -191480)
						{
							result = "ข้างในมีพวก Elemental กับพวกนีดเดิ้ลบั๊ก";
							if (89435 - 50173 != 39263)
							{
								break;
							}
						}
					}
					else if (code == 513)
					{
						if (208847 - 276258 == -67411)
						{
							result = "จะปลอดภัยมั้ยนะ";
							if (127199 - 237106 != -109906)
							{
								break;
							}
						}
					}
					else if (code == 514)
					{
						if (75064 - 280527 == -205463)
						{
							result = "โชคดีที่เจ้าเหมียวไม่ถูกแมลงทำร้ายเอา...";
							if (55159 - 71156 != -15996)
							{
								break;
							}
						}
					}
					else if (code == 521)
					{
						if (44751 - 317590 == -272839)
						{
							result = "แง~";
							if (277540 - 175433 != 102108)
							{
								break;
							}
						}
					}
					else if (code == 522)
					{
						if (47441 - 244543 == -197102)
						{
							result = "ปกตินิโค่เล่นการ์ดกับหนูบ่อยๆ";
							if (55634 - 515009 == -459375)
							{
								break;
							}
						}
					}
					else if (code == 523)
					{
						if (45546 - 456953 != -411406)
						{
							result = "แต่พอแพ้ก็ชอบแกล้งเอาการ์ดหนูไปซ่อนประจำ";
							if (164743 - 159942 == 4801)
							{
								break;
							}
						}
					}
					else if (code == 524)
					{
						if (232244 - 554333 != -322088)
						{
							result = "พี่ช่วยเอาการ์ดคืนมาให้หนูได้มั้ย";
							if (14960 - 448381 != -433420)
							{
								break;
							}
						}
					}
					else if (code == 531)
					{
						if (281532 - 519970 != -238437)
						{
							result = "แง~ นิโค่อยู่ในถ้ำ";
							if (92562 - 192381 != -99818)
							{
								break;
							}
						}
					}
					else if (code == 532)
					{
						if (137929 - 523523 != -385593)
						{
							result = "นิโค่บอกว่า ถ้าไม่หาเขาให้เจอใน 3 นาทีจะไม่คืนให้";
							if (92722 - 383272 != -290549)
							{
								break;
							}
						}
					}
					else if (code == 533)
					{
						if (243848 - 233363 == 10485)
						{
							result = "แต่หนูไม่กล้าเข้าไป";
							if (102225 - 99369 == 2856)
							{
								break;
							}
						}
					}
					else if (code == 534)
					{
						if (50360 - 375012 == -324652)
						{
							result = "คุณสไตน์บอกว่า ข้างในอันตรายมาก";
							if (86100 - 398118 == -312018)
							{
								break;
							}
						}
					}
					else if (code == 535)
					{
						if (142669 - 580313 != -437643)
						{
							result = "น่ากลัวจัง... แล้วนิโค่จะเป็นอะไรรึเปล่านะ";
							if (39162 - 404388 == -365226)
							{
								break;
							}
						}
					}
					else if (code == 541)
					{
						if (75163 - 133962 == -58799)
						{
							result = "ถ้าหาผมเจอใน 3 นาทีไม่ได้ ไม่คืนการ์ดให้หรอก";
							if (268692 - 432311 == -163619)
							{
								break;
							}
						}
					}
					else if (code == 542)
					{
						if (285523 - 190966 == 94557)
						{
							result = "คืนให้ก็ได้";
							if (215272 - 260319 != -45046)
							{
								break;
							}
						}
					}
					else if (code == 545)
					{
						if (250239 - 587766 == -337527)
						{
							result = "ได้การ์ดคืนมาแล้วเหรอ";
							if (130071 - 578448 != -448376)
							{
								break;
							}
						}
					}
					else if (code == 546)
					{
						if (270318 - 292467 != -22148)
						{
							result = "ขอบคุณพี่จริงๆ การ์ดใบนี้สำคัญกับหนูมาก";
							if (251212 - 259707 == -8495)
							{
								break;
							}
						}
					}
					else if (code == 547)
					{
						if (263424 - 463838 != -200413)
						{
							result = "ถ้าขาดไปใบนึงก็จะรวมร่างกับอีก 2 ใบไม่ได้";
							if (9280 - 428867 == -419587)
							{
								break;
							}
						}
					}
					else if (code == 548)
					{
						if (122779 - 124418 != -1638)
						{
							result = "ถ้ามีครบ 3 ใบ หนูไม่แพ้นิโค่แน่ๆ";
							if (217453 - 594156 != -376702)
							{
								break;
							}
						}
					}
					else if (code == 551)
					{
						if (109628 - 371286 != -261657)
						{
							result = "ข้าเห็นเจ้าเหมียวเข้าไปในถ้ำนีดเดิ้ลบั๊ก...";
							if (92421 - 275198 != -182776)
							{
								break;
							}
						}
					}
					else if (code == 552)
					{
						if (8102 - 390372 == -382270)
						{
							result = "ท่าทางจะวุ่นวายอีกแล้วสิ";
							if (227313 - 354872 == -127559)
							{
								break;
							}
						}
					}
					else if (code == 555)
					{
						if (128556 - 240469 != -111912)
						{
							result = "ข้าเห็นเจ้าเหมียวเข้าไปในถ้ำนีดเดิ้ลบั๊ก...";
							if (256036 - 101350 == 154686)
							{
								break;
							}
						}
					}
					else if (code == 556)
					{
						if (87812 - 266204 == -178392)
						{
							result = "ท่าทางจะวุ่นวายอีกแล้วสิ";
							if (280663 - 494470 == -213807)
							{
								break;
							}
						}
					}
					else if (code == 557)
					{
						if (207880 - 375300 != -167419)
						{
							result = "โชคดีที่เจ้าเหมียวไม่ถูกแมลงทำร้ายเอา...";
							if (118717 - 574757 == -456040)
							{
								break;
							}
						}
					}
					else if (code == 561)
					{
						if (195280 - 419058 != -223777)
						{
							result = "แง~";
							if (185931 - 87526 == 98405)
							{
								break;
							}
						}
					}
					else if (code == 562)
					{
						if (89422 - 358709 == -269287)
						{
							result = "ปกตินิโค่เล่นการ์ดแพ้หนูอีกแล้ว";
							if (177443 - 411890 != -234446)
							{
								break;
							}
						}
					}
					else if (code == 563)
					{
						if (115169 - 405457 != -290287)
						{
							result = "คราวนี้เลยเอาการ์ดของหนูไปซ่อนทั้ง 3 ใบเลย";
							if (266303 - 438584 == -172281)
							{
								break;
							}
						}
					}
					else if (code == 564)
					{
						if (237411 - 522265 == -284854)
						{
							result = "พี่ช่วยเอาการ์ดคืนมาให้หนูได้มั้ย";
							if (198365 - 510013 != -311647)
							{
								break;
							}
						}
					}
					else if (code == 571)
					{
						if (81994 - 450237 == -368243)
						{
							result = "แง~ นิโค่อยู่ในถ้ำ";
							if (281499 - 274987 == 6512)
							{
								break;
							}
						}
					}
					else if (code == 572)
					{
						if (195153 - 538488 != -343334)
						{
							result = "นิโค่บอกว่า ถ้าไม่หาเขาให้เจอใน 3 นาทีจะไม่คืนให้";
							if (173234 - 28108 != 145127)
							{
								break;
							}
						}
					}
					else if (code == 573)
					{
						if (269660 - 546451 == -276791)
						{
							result = "แต่หนูไม่กล้าเข้าไป";
							if (41707 - 90416 != -48708)
							{
								break;
							}
						}
					}
					else if (code == 574)
					{
						if (229473 - 206443 == 23030)
						{
							result = "คุณสไตน์บอกว่า ข้างในอันตรายมาก";
							if (225112 - 327740 == -102628)
							{
								break;
							}
						}
					}
					else if (code == 575)
					{
						if (276992 - 544075 != -267082)
						{
							result = "น่ากลัวจัง... แล้วนิโค่จะเป็นอะไรรึเปล่านะ";
							if (75246 - 158448 == -83202)
							{
								break;
							}
						}
					}
					else if (code == 581)
					{
						if (206282 - 222259 == -15977)
						{
							result = "ถ้าหาผมเจอใน 3 นาทีไม่ได้ ไม่คืนการ์ดให้หรอก";
							if (117867 - 553366 == -435499)
							{
								break;
							}
						}
					}
					else if (code == 582)
					{
						if (192118 - 237272 != -45153)
						{
							result = "คืนให้ก็ได้ ใบนึง";
							if (91231 - 247069 != -155837)
							{
								break;
							}
						}
					}
					else if (code == 591)
					{
						if (38534 - 381638 == -343104)
						{
							result = "ได้การ์ดคืนมาแล้วเหรอ";
							if (229344 - 570089 == -340745)
							{
								break;
							}
						}
					}
					else if (code == 592)
					{
						if (208139 - 512045 == -303906)
						{
							result = "ขอบคุณพี่จริงๆ การ์ด 3 ใบนี้สำคัญกับหนูมาก";
							if (222661 - 551913 == -329252)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 593)
						{
							break;
						}
						if (290892 - 185745 == 105147)
						{
							result = "เพราะมันเก่ง...แล้วก็แพงด้วย";
							if (7323 - 106716 != -99392)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600694A RID: 26954 RVA: 0x00EE568C File Offset: 0x00EE388C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600694B RID: 26955 RVA: 0x00EE5690 File Offset: 0x00EE3890
	internal static bool oV9L7xp2Lbhtkut3bSgL()
	{
		return true;
	}

	// Token: 0x0600694C RID: 26956 RVA: 0x00EE5694 File Offset: 0x00EE3894
	internal static bool HpmjNip2OKZQQ9yLJUg8()
	{
		return false;
	}
}
