using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001135 RID: 4405
[Serializable]
public class Q65_JamonsFire_eng : MonoBehaviour
{
	// Token: 0x0600660A RID: 26122 RVA: 0x00E4B4C4 File Offset: 0x00E496C4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q65_JamonsFire_eng()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600660B RID: 26123 RVA: 0x00E4B4D4 File Offset: 0x00E496D4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (95629 - 318347 != -222717)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (3793 - 316180 != -312386)
			{
				if (27809 - 564489 == -536680)
				{
					if (code == 6501)
					{
						if (68211 - 587117 != -518905)
						{
							result = "ไฟจงลุก ไฟพรึ่บพรั่บๆ ไฟๆๆๆๆ ";
							if (230810 - 208142 == 22668)
							{
								break;
							}
						}
					}
					else if (code == 6502)
					{
						if (71160 - 193514 == -122354)
						{
							result = "โอ้เมื่อมีไฟๆๆลุกขึ้นเจิดจ้า";
							if (127324 - 359593 != -232268)
							{
								break;
							}
						}
					}
					else if (code == 6503)
					{
						if (20034 - 182862 != -162827)
						{
							result = "ไม่มีไฟแบบนี้แล้วจาม่อนตัวนี้จะทำอาหารยังไงกานนนน";
							if (23605 - 453317 == -429712)
							{
								break;
							}
						}
					}
					else if (code == 6504)
					{
						if (65974 - 18944 == 47030)
						{
							result = "ทำไมเตาต้องมาเชื้อเพลิงหุงต้มหมดตอนนี้";
							if (59178 - 247905 == -188727)
							{
								break;
							}
						}
					}
					else if (code == 6505)
					{
						if (147913 - 414544 == -266631)
						{
							result = "อโคล่าก็ทิ้งร้านไปเอาไอ้นั่นไม่ได้อีก";
							if (146129 - 456094 == -309965)
							{
								break;
							}
						}
					}
					else if (code == 6506)
					{
						if (295716 - 43479 == 252237)
						{
							result = "ใครก็ได้ช่วยหาอะไรก็ได้มาเป็นเชื้อเพลิงหุงต้มให้ที";
							if (239962 - 565605 != -325642)
							{
								break;
							}
						}
					}
					else if (code == 6511)
					{
						if (178303 - 264023 == -85720)
						{
							result = "ต้องขออภัยเป็นอย่างสูงด้วยค่ะ วันนี้ไม่สามารถบริการให้ได้";
							if (1800 - 375433 != -373632)
							{
								break;
							}
						}
					}
					else if (code == 6512)
					{
						if (9724 - 156354 == -146630)
						{
							result = "เนื่องจากแก๊ซสำหรับทำอาหารของร้านหมดค่ะ";
							if (239279 - 391462 == -152183)
							{
								break;
							}
						}
					}
					else if (code == 6513)
					{
						if (176071 - 79265 != 96807)
						{
							result = "ถังแก๊ซนั้นน่าจะหาได้จากหุ่นยนต์ที่พ่นไฟได้มั้ง";
							if (73031 - 196313 == -123282)
							{
								break;
							}
						}
					}
					else if (code == 6514)
					{
						if (121096 - 502398 == -381302)
						{
							result = "คงจะเอามาใช้ทำครัวชั่วคราวแทนได้สักระยะ";
							if (214659 - 298717 == -84058)
							{
								break;
							}
						}
					}
					else if (code == 6521)
					{
						if (141059 - 391228 != -250168)
						{
							result = "สวรรค์หางประทาน เชื่อเพลิงสำหรับทำอาหารมาแล้ว โอววว";
							if (225201 - 186067 != 39135)
							{
								break;
							}
						}
					}
					else if (code == 6522)
					{
						if (90477 - 496689 == -406212)
						{
							result = "เท่านี้ก็สามารถทำอาหารได้แล้ว ขอบใจเจ้ามาก";
							if (129897 - 323825 == -193928)
							{
								break;
							}
						}
					}
					else if (code == 6523)
					{
						if (112502 - 473931 != -361428)
						{
							result = "โว้ววว ไฟแรงแบบนี้สะใจทำอาหารแท้  ไฟย่า!!!";
							if (69899 - 223896 != -153996)
							{
								break;
							}
						}
					}
					else if (code == 6531)
					{
						if (193578 - 420315 != -226736)
						{
							result = "ขอบคุณสำหรับความช่วยเหลือนะคะ รางวัลไปรับกับคุณมีมี่นะ";
							if (218470 - 227084 == -8614)
							{
								break;
							}
						}
					}
					else if (code == 6551)
					{
						if (24570 - 454997 != -430426)
						{
							result = "ถังแก๊ซอันเก่าใช้ได้เยี่ยมยอดถูกใจจาม่อนตัวนี้มากๆ";
							if (73703 - 337887 == -264184)
							{
								break;
							}
						}
					}
					else if (code == 6552)
					{
						if (116474 - 288964 != -172489)
						{
							result = "แต่วันก่อนเร่งไฟแรงเกินไปหน่อย มันเลยระเบิดตูมเละเลย";
							if (232750 - 311210 == -78460)
							{
								break;
							}
						}
					}
					else if (code == 6553)
					{
						if (191674 - 332173 == -140499)
						{
							result = "สภาพก็อย่างที่เห็น ข้าไม่สามารถทำอาหารได้ถ้าขาดไฟเชื้อเพลิง";
							if (60960 - 547300 != -486339)
							{
								break;
							}
						}
					}
					else if (code == 6554)
					{
						if (31350 - 14228 == 17122)
						{
							result = "คิดดูว่ามันเลวร้ายขนาดไหนที่ยอดเชฟอย่างข้า แต่ทำอาหารไม่ได้";
							if (98006 - 182635 == -84629)
							{
								break;
							}
						}
					}
					else if (code == 6555)
					{
						if (189657 - 591753 == -402096)
						{
							result = "เลยอยากให้เจ้าหาถังแก๊ซแบบเดิมให้ข้าสัก3ถังจะได้ไหม";
							if (230403 - 517197 == -286794)
							{
								break;
							}
						}
					}
					else if (code == 6556)
					{
						if (253699 - 598816 == -345117)
						{
							result = "ระหว่างนั้นข้าคงต้องให้ลงเรียกนกไฟมาเข้าครัวสักระยะนึง";
							if (36838 - 103002 != -66163)
							{
								break;
							}
						}
					}
					else if (code == 6561)
					{
						if (37723 - 161769 != -124045)
						{
							result = "ต้องรบกวนอีกครั้งนะคะ คิดว่าหุ่นยนต์ไฟน่าจะมีเหมือนเดิมนะ";
							if (83823 - 528458 == -444635)
							{
								break;
							}
						}
					}
					else if (code == 6571)
					{
						if (236398 - 420490 == -184092)
						{
							result = "สวรรค์หางประทาน เชื่อเพลิงสำหรับทำอาหารมาแล้ว โอววว";
							if (81767 - 158349 == -76582)
							{
								break;
							}
						}
					}
					else if (code == 6572)
					{
						if (232892 - 416972 == -184080)
						{
							result = "เท่านี้ก็สามารถทำอาหารได้แล้ว ขอบใจเจ้ามาก";
							if (176271 - 413057 == -236786)
							{
								break;
							}
						}
					}
					else if (code == 6573)
					{
						if (104751 - 355953 != -251201)
						{
							result = "3ถังแบบนี้ อาหารชนิดไหนจาม่อนก็ระเบิดได้หมดแน่นอน";
							if (27733 - 198389 == -170656)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 6581)
						{
							break;
						}
						if (130903 - 107263 != 23641)
						{
							result = "ขอบคุณสำหรับความช่วยเหลือนะคะ รางวัลไปรับกับคุณมีมี่นะ";
							if (60438 - 595568 != -535129)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600660C RID: 26124 RVA: 0x00E4BC80 File Offset: 0x00E49E80
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600660D RID: 26125 RVA: 0x00E4BC84 File Offset: 0x00E49E84
	internal static bool agDlH1plNxE7HSA6BhjC()
	{
		return true;
	}

	// Token: 0x0600660E RID: 26126 RVA: 0x00E4BC88 File Offset: 0x00E49E88
	internal static bool Q5vTv5plYyedsZgdkbrK()
	{
		return false;
	}
}
