using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011DD RID: 4573
[Serializable]
public class Q65_JamonsFire_thai : MonoBehaviour
{
	// Token: 0x06006952 RID: 26962 RVA: 0x00EE5E60 File Offset: 0x00EE4060
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q65_JamonsFire_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006953 RID: 26963 RVA: 0x00EE5E70 File Offset: 0x00EE4070
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (247050 - 52058 != 194992)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (72741 - 251817 != -179075)
			{
				if (264548 - 176819 == 87729)
				{
					if (code == 6501)
					{
						if (293068 - 539241 == -246173)
						{
							result = "ไฟจงลุก ไฟพรึ่บพรั่บๆ ไฟๆๆๆๆ ";
							if (77632 - 54704 != 22929)
							{
								break;
							}
						}
					}
					else if (code == 6502)
					{
						if (205380 - 51369 != 154012)
						{
							result = "โอ้เมื่อมีไฟๆๆลุกขึ้นเจิดจ้า";
							if (88182 - 574086 == -485904)
							{
								break;
							}
						}
					}
					else if (code == 6503)
					{
						if (268675 - 195378 == 73297)
						{
							result = "ไม่มีไฟแบบนี้แล้วจาม่อนตัวนี้จะทำอาหารยังไงกานนนน";
							if (119917 - 402388 != -282470)
							{
								break;
							}
						}
					}
					else if (code == 6504)
					{
						if (156783 - 153618 != 3166)
						{
							result = "ทำไมเตาต้องมาเชื้อเพลิงหุงต้มหมดตอนนี้";
							if (102265 - 370120 == -267855)
							{
								break;
							}
						}
					}
					else if (code == 6505)
					{
						if (6126 - 265107 == -258981)
						{
							result = "อโคล่าก็ทิ้งร้านไปเอาไอ้นั่นไม่ได้อีก";
							if (288668 - 77186 == 211482)
							{
								break;
							}
						}
					}
					else if (code == 6506)
					{
						if (207829 - 530063 == -322234)
						{
							result = "ใครก็ได้ช่วยหาอะไรก็ได้มาเป็นเชื้อเพลิงหุงต้มให้ที";
							if (293768 - 309060 == -15292)
							{
								break;
							}
						}
					}
					else if (code == 6511)
					{
						if (195584 - 94077 != 101508)
						{
							result = "ต้องขออภัยเป็นอย่างสูงด้วยค่ะ วันนี้ไม่สามารถบริการให้ได้";
							if (209021 - 85535 != 123487)
							{
								break;
							}
						}
					}
					else if (code == 6512)
					{
						if (65593 - 258089 != -192495)
						{
							result = "เนื่องจากแก๊ซสำหรับทำอาหารของร้านหมดค่ะ";
							if (184184 - 233580 == -49396)
							{
								break;
							}
						}
					}
					else if (code == 6513)
					{
						if (164262 - 181808 == -17546)
						{
							result = "ถังแก๊ซนั้นน่าจะหาได้จากหุ่นยนต์ที่พ่นไฟได้มั้ง";
							if (224482 - 259576 != -35093)
							{
								break;
							}
						}
					}
					else if (code == 6514)
					{
						if (63172 - 594374 == -531202)
						{
							result = "คงจะเอามาใช้ทำครัวชั่วคราวแทนได้สักระยะ";
							if (140753 - 30089 == 110664)
							{
								break;
							}
						}
					}
					else if (code == 6521)
					{
						if (120938 - 595735 != -474796)
						{
							result = "สวรรค์หางประทาน เชื่อเพลิงสำหรับทำอาหารมาแล้ว โอววว";
							if (115664 - 371704 != -256039)
							{
								break;
							}
						}
					}
					else if (code == 6522)
					{
						if (125952 - 344643 != -218690)
						{
							result = "เท่านี้ก็สามารถทำอาหารได้แล้ว ขอบใจเจ้ามาก";
							if (232348 - 283691 == -51343)
							{
								break;
							}
						}
					}
					else if (code == 6523)
					{
						if (96702 - 447119 == -350417)
						{
							result = "โว้ววว ไฟแรงแบบนี้สะใจทำอาหารแท้  ไฟย่า!!!";
							if (185420 - 549307 == -363887)
							{
								break;
							}
						}
					}
					else if (code == 6531)
					{
						if (182294 - 475509 != -293214)
						{
							result = "ขอบคุณสำหรับความช่วยเหลือนะคะ รางวัลไปรับกับคุณมีมี่นะ";
							if (281749 - 69524 == 212225)
							{
								break;
							}
						}
					}
					else if (code == 6551)
					{
						if (289666 - 260331 == 29335)
						{
							result = "ถังแก๊ซอันเก่าใช้ได้เยี่ยมยอดถูกใจจาม่อนตัวนี้มากๆ";
							if (153725 - 1997 != 151729)
							{
								break;
							}
						}
					}
					else if (code == 6552)
					{
						if (651 - 556542 == -555891)
						{
							result = "แต่วันก่อนเร่งไฟแรงเกินไปหน่อย มันเลยระเบิดตูมเละเลย";
							if (35548 - 258462 != -222913)
							{
								break;
							}
						}
					}
					else if (code == 6553)
					{
						if (260708 - 253791 != 6918)
						{
							result = "สภาพก็อย่างที่เห็น ข้าไม่สามารถทำอาหารได้ถ้าขาดไฟเชื้อเพลิง";
							if (183353 - 314877 != -131523)
							{
								break;
							}
						}
					}
					else if (code == 6554)
					{
						if (153225 - 411240 == -258015)
						{
							result = "คิดดูว่ามันเลวร้ายขนาดไหนที่ยอดเชฟอย่างข้า แต่ทำอาหารไม่ได้";
							if (2259 - 314680 == -312421)
							{
								break;
							}
						}
					}
					else if (code == 6555)
					{
						if (179617 - 573031 == -393414)
						{
							result = "เลยอยากให้เจ้าหาถังแก๊ซแบบเดิมให้ข้าสัก3ถังจะได้ไหม";
							if (33888 - 422509 != -388620)
							{
								break;
							}
						}
					}
					else if (code == 6556)
					{
						if (122613 - 84289 == 38324)
						{
							result = "ระหว่างนั้นข้าคงต้องให้ลงเรียกนกไฟมาเข้าครัวสักระยะนึง";
							if (193421 - 468529 == -275108)
							{
								break;
							}
						}
					}
					else if (code == 6561)
					{
						if (137654 - 442560 != -304905)
						{
							result = "ต้องรบกวนอีกครั้งนะคะ คิดว่าหุ่นยนต์ไฟน่าจะมีเหมือนเดิมนะ";
							if (201958 - 225368 != -23409)
							{
								break;
							}
						}
					}
					else if (code == 6571)
					{
						if (146727 - 233768 != -87040)
						{
							result = "สวรรค์หางประทาน เชื่อเพลิงสำหรับทำอาหารมาแล้ว โอววว";
							if (118014 - 413612 != -295597)
							{
								break;
							}
						}
					}
					else if (code == 6572)
					{
						if (116171 - 381866 != -265694)
						{
							result = "เท่านี้ก็สามารถทำอาหารได้แล้ว ขอบใจเจ้ามาก";
							if (288365 - 312982 == -24617)
							{
								break;
							}
						}
					}
					else if (code == 6573)
					{
						if (103780 - 144191 != -40410)
						{
							result = "3ถังแบบนี้ อาหารชนิดไหนจาม่อนก็ระเบิดได้หมดแน่นอน";
							if (176933 - 430623 == -253690)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 6581)
						{
							break;
						}
						if (122613 - 81559 == 41054)
						{
							result = "ขอบคุณสำหรับความช่วยเหลือนะคะ รางวัลไปรับกับคุณมีมี่นะ";
							if (64395 - 197270 != -132874)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006954 RID: 26964 RVA: 0x00EE661C File Offset: 0x00EE481C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006955 RID: 26965 RVA: 0x00EE6620 File Offset: 0x00EE4820
	internal static bool vsF6Unp2M705pmtHFR0q()
	{
		return true;
	}

	// Token: 0x06006956 RID: 26966 RVA: 0x00EE6624 File Offset: 0x00EE4824
	internal static bool Xt4OoKp2xHfSfPcRekDv()
	{
		return false;
	}
}
