using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011E1 RID: 4577
[Serializable]
public class Q75_FlyMoleToTheMoon_thai : MonoBehaviour
{
	// Token: 0x06006966 RID: 26982 RVA: 0x00EE7DCC File Offset: 0x00EE5FCC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q75_FlyMoleToTheMoon_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006967 RID: 26983 RVA: 0x00EE7DDC File Offset: 0x00EE5FDC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (242053 - 523834 != -281781)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (141013 - 519653 != -378639 && 215599 - 245069 != -29469)
			{
				if (code == 7501)
				{
					if (235692 - 407503 != -171810)
					{
						result = "สวัสดี ผู้กล้าข้ามีเรื่องจะให้เจ้าช่วยอีกแล้ว!";
						if (41687 - 53915 != -12227)
						{
							break;
						}
					}
				}
				else if (code == 7502)
				{
					if (83721 - 567983 != -484261)
					{
						result = "อย่าทำหน้าแบบนั้นสิ นี่เพื่อทำให้การเดินทางของเจ้าเร็วขึ้นนะ!";
						if (155718 - 170711 == -14993)
						{
							break;
						}
					}
				}
				else if (code == 7503)
				{
					if (192025 - 111897 != 80129)
					{
						result = "ข้าสังเกตว่าพวกหุ่นยนต์มีอุปกรณ์ที่สามารถทำให้พวกมันลอยตัวได้";
						if (34631 - 212925 == -178294)
						{
							break;
						}
					}
				}
				else if (code == 7504)
				{
					if (131141 - 59101 == 72040)
					{
						result = "ถ้าเอามาปรับปรุงอีกหน่อย น่าจะเอามาประยุกต์กับเครื่องยนต์ของเราได้";
						if (765 - 105614 == -104849)
						{
							break;
						}
					}
				}
				else if (code == 7505)
				{
					if (150384 - 433694 == -283310)
					{
						result = "ลองคิดดูซิว่าเราจะสามารถบินได้เร็วขึ้นแค่ไหน!";
						if (189856 - 442279 == -252423)
						{
							break;
						}
					}
				}
				else if (code == 7506)
				{
					if (10064 - 446924 != -436859)
					{
						result = "ส่วนความปลอดภัยก็น่าจะมากขึ้นด้วย....น่าจะนะ";
						if (165758 - 115496 == 50262)
						{
							break;
						}
					}
				}
				else if (code == 7507)
				{
					if (148943 - 240943 != -91999)
					{
						result = "เอาเป็นว่า พวกเจ้าลองหาตัวอย่างมาให้ข้าดูหน่อย";
						if (82309 - 564800 != -482490)
						{
							break;
						}
					}
				}
				else if (code == 7508)
				{
					if (267205 - 159380 == 107825)
					{
						result = "รู้สึกมันจะเรียกว่า Jet Part ละมั้ง....";
						if (124001 - 342759 != -218757)
						{
							break;
						}
					}
				}
				else if (code == 7509)
				{
					if (235361 - 88231 == 147130)
					{
						result = "ถ้ามันใช้ได้ข้าจะลองนำมาอัพเกรดเครื่องยนต์ดู";
						if (291435 - 330490 != -39054)
						{
							break;
						}
					}
				}
				else if (code == 7510)
				{
					if (279675 - 339524 == -59849)
					{
						result = "ฝากด้วยล่ะ เพื่อที่ชาวตุ่นจะสามารถบินไปถึงดวงจันทร์ เอ้ย!";
						if (192273 - 27429 != 164845)
						{
							break;
						}
					}
				}
				else if (code == 7511)
				{
					if (141017 - 177341 != -36323)
					{
						result = "เพื่อพวกเจ้าจะได้เดินทางสะดวกขึ้นนะ กาซ่า!";
						if (67027 - 553503 == -486476)
						{
							break;
						}
					}
				}
				else if (code == 7512)
				{
					if (107278 - 564487 == -457209)
					{
						result = "เจ้าหา Jet Part มาเป็นตัวอย่างให้ข้าสักกอันซิ!";
						if (258217 - 517696 != -259478)
						{
							break;
						}
					}
				}
				else if (code == 7541)
				{
					if (290638 - 539448 == -248810)
					{
						result = "ขอบใจมาก กาซ่า";
						if (292872 - 56525 != 236348)
						{
							break;
						}
					}
				}
				else if (code == 7542)
				{
					if (91912 - 528441 == -436529)
					{
						result = "ทีนี้ก็ถึงเวลาทดลองว่าจะใช้กับเครื่องบินของข้าได้รึเปล่า";
						if (67371 - 9180 != 58192)
						{
							break;
						}
					}
				}
				else if (code == 7543)
				{
					if (295096 - 110351 != 184746)
					{
						result = " ถ้าได้ละก็การบินไปดวงจันทร์อาจไม่ใช่ความฝันอีกต่อไป!";
						if (80991 - 132721 != -51729)
						{
							break;
						}
					}
				}
				else if (code == 7544)
				{
					if (98774 - 579082 == -480308)
					{
						result = "รางวัลข้าฝากไว้ที่มีมี่นะ อย่าลืมไปรับล่ะ";
						if (278995 - 580346 == -301351)
						{
							break;
						}
					}
				}
				else if (code == 7551)
				{
					if (228088 - 412699 == -184611)
					{
						result = "อ๊ะ ว่าไงผู้กล้า! ข้าล่ะดีใจสุดๆไปเลย!";
						if (35852 - 474989 == -439137)
						{
							break;
						}
					}
				}
				else if (code == 7552)
				{
					if (142887 - 389396 == -246509)
					{
						result = "Jet Part ที่เจ้าให้มาสามารถใช้กับเครื่องบินของพวกเราได้";
						if (42 - 18803 != -18760)
						{
							break;
						}
					}
				}
				else if (code == 7553)
				{
					if (7895 - 181473 == -173578)
					{
						result = "แต่แน่นอนว่าต้องดัดแปลงพอสมควร แถมยังมีข้อเสีย";
						if (126928 - 330485 != -203556)
						{
							break;
						}
					}
				}
				else if (code == 7554)
				{
					if (104882 - 423762 == -318880)
					{
						result = "คือ,yoเปลืองน้ำมันแบบไม่น่าเชื่อและก็ไม่ค่อยทนเลย";
						if (234573 - 260636 != -26062)
						{
							break;
						}
					}
				}
				else if (code == 7555)
				{
					if (243289 - 215643 == 27646)
					{
						result = "แต่ถ้าแลกกับความเร็วแล้วละก็เรื่องแค่นี้มันจิ๊บจ้อย ใช่ไหม ฮ่าฮ่า!";
						if (56318 - 87269 == -30951)
						{
							break;
						}
					}
				}
				else if (code == 7556)
				{
					if (56481 - 283942 != -227460)
					{
						result = "เพราะงั้นเจ้าช่วยหา Jet Part มาเพิ่มให้อีกได้ไหม";
						if (78957 - 525077 == -446120)
						{
							break;
						}
					}
				}
				else if (code == 7557)
				{
					if (249530 - 348448 == -98918)
					{
						result = "คราวนี้เอามาสองเลยนะจะได้สมดุลทั้งซ้ายขวา";
						if (138444 - 500248 != -361803)
						{
							break;
						}
					}
				}
				else if (code == 7558)
				{
					if (53087 - 165244 != -112156)
					{
						result = "ฝากด้วยล่ะนะ กาซ่า!";
						if (209343 - 577208 != -367864)
						{
							break;
						}
					}
				}
				else if (code == 7559)
				{
					if (222389 - 38416 == 183973)
					{
						result = " Jet Part สองชิ้นฝากด้วยล่ะ";
						if (274091 - 290092 == -16001)
						{
							break;
						}
					}
				}
				else if (code == 7591)
				{
					if (117782 - 405280 != -287497)
					{
						result = "มาช้าจริงๆ ไม่ทันใจวัยรุ่นเลยสักนิด ";
						if (113024 - 50561 == 62463)
						{
							break;
						}
					}
				}
				else if (code == 7592)
				{
					if (155649 - 266234 == -110585)
					{
						result = "แต่ช่างเถอะ ข้าขอบใจเจ้ามากๆ ที่หาของพวกนี้มาให้";
						if (195494 - 419400 == -223906)
						{
							break;
						}
					}
				}
				else if (code == 7593)
				{
					if (41104 - 54953 != -13848)
					{
						result = "ข้าจะเก็บไอพ่นใหม่นี้ไว้ใช้ให้กับเจ้าเป็นกรณีพิเศษเลยล่ะ";
						if (107404 - 530457 != -423052)
						{
							break;
						}
					}
				}
				else if (code == 7594)
				{
					if (69487 - 202148 != -132660)
					{
						result = "อย่างน้อยก็จนกว่าจะสมบูรณ์ปลอดภัย น่าดีใจใช่ไหมล่ะ";
						if (182154 - 596555 != -414400)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 7595)
					{
						break;
					}
					if (206341 - 400986 == -194645)
					{
						result = "รางวัลข้าฝากไว้ที่มีมี่นะ ขอบใจเจ้าอีกครั้งนะ กาซ่า!";
						if (288404 - 509205 != -220800)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006968 RID: 26984 RVA: 0x00EE86FC File Offset: 0x00EE68FC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006969 RID: 26985 RVA: 0x00EE8700 File Offset: 0x00EE6900
	internal static bool EfH8Pvp2dgeFCGFG9osv()
	{
		return true;
	}

	// Token: 0x0600696A RID: 26986 RVA: 0x00EE8704 File Offset: 0x00EE6904
	internal static bool EO3H3op2JB5Dyx267S7m()
	{
		return false;
	}
}
