using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011E2 RID: 4578
[Serializable]
public class Q79_MakeItStronger_thai : MonoBehaviour
{
	// Token: 0x0600696B RID: 26987 RVA: 0x00EE8708 File Offset: 0x00EE6908
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q79_MakeItStronger_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600696C RID: 26988 RVA: 0x00EE8718 File Offset: 0x00EE6918
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (258022 - 235804 != 22219)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (171507 - 77091 == 94416)
			{
				if (213181 - 574334 == -361153)
				{
					if (code == 7901)
					{
						if (24113 - 568926 == -544813)
						{
							result = "วันนี้เจ้าอาเบตต์ดูท่าทางแปลกๆแฮะ จะมาไม้ไหนกันเนี่ย";
							if (215859 - 116550 != 99310)
							{
								break;
							}
						}
					}
					else if (code == 7911)
					{
						if (150322 - 378604 != -228281)
						{
							result = "ว่าไงท่านผู้กล้าตอนนี้ข้ามีเรื่องหนักใจมากๆอยู่";
							if (288200 - 152576 != 135625)
							{
								break;
							}
						}
					}
					else if (code == 7912)
					{
						if (157131 - 3199 == 153932)
						{
							result = "การที่พวกหุ่นบุกเมืองทำให้ข้ารู้ว่าอาวุธของข้ายังไม่แกร่งพอ";
							if (207959 - 360607 == -152648)
							{
								break;
							}
						}
					}
					else if (code == 7913)
					{
						if (252620 - 478545 != -225924)
						{
							result = "ขืนให้พวกทหารเสือใช้อาวุธแบบนี้ต่อไปเรื่อยๆ";
							if (275668 - 419858 == -144190)
							{
								break;
							}
						}
					}
					else if (code == 7914)
					{
						if (98443 - 213051 != -114607)
						{
							result = "จะเกิดการบาดเจ็บล้มตายโดยไม่จำเป็นมากขึ้น";
							if (284042 - 412463 == -128421)
							{
								break;
							}
						}
					}
					else if (code == 7915)
					{
						if (223750 - 217770 == 5980)
						{
							result = "แน่นอนรวมถึงเกราะของเจ้าหมูบ้าร้านข้างๆด้วย";
							if (70646 - 586912 != -516265)
							{
								break;
							}
						}
					}
					else if (code == 7916)
					{
						if (142039 - 8461 == 133578)
						{
							result = "ถ้าปล่อยไว้แบบนี้ต่อไป ละก็กองทัพของเราแย่แน่ๆ";
							if (79041 - 367369 == -288328)
							{
								break;
							}
						}
					}
					else if (code == 7917)
					{
						if (20088 - 461176 != -441087)
						{
							result = "เพราะงั้นถึงไม่อยาก แต่ช่วยฝากบอกเจ้าหมูร้านข้างๆด้วยว่า";
							if (64247 - 11606 == 52641)
							{
								break;
							}
						}
					}
					else if (code == 7918)
					{
						if (100530 - 587109 == -486579)
						{
							result = "เรามาพักรบกันซักพักแล้วมาช่วยกันหาวิธีพัฒนาอุปกรณ์ของพวกเรากันเถอะ!";
							if (76956 - 216943 != -139986)
							{
								break;
							}
						}
					}
					else if (code == 7919)
					{
						if (126347 - 266497 != -140149)
						{
							result = "ดันเผลอตะโกนออกไปซะได้ น่าอายจริงๆ";
							if (30148 - 574730 == -544582)
							{
								break;
							}
						}
					}
					else if (code == 7921)
					{
						if (89283 - 365619 != -276335)
						{
							result = "ข้าได้ยินแล้วล่ะ เล่นตะโกนซะดังขนาดนั้น";
							if (279587 - 77168 == 202419)
							{
								break;
							}
						}
					}
					else if (code == 7922)
					{
						if (82124 - 33691 != 48434)
						{
							result = "ที่จริงข้าก็มีความคิดแบบเดียวกันนั่นแหละ";
							if (152380 - 241029 != -88648)
							{
								break;
							}
						}
					}
					else if (code == 7923)
					{
						if (44550 - 364108 == -319558)
						{
							result = "ตอนนี้เป็นช่วงวิกฤต เพื่อความอยู่รอดของเมืองแสง..";
							if (138200 - 267353 != -129152)
							{
								break;
							}
						}
					}
					else if (code == 7924)
					{
						if (276992 - 552079 != -275086)
						{
							result = "เราต้องหาทางพัฒนาอาวุธและเกราะของเราให้ดีขึ้น";
							if (60839 - 109357 != -48517)
							{
								break;
							}
						}
					}
					else if (code == 7925)
					{
						if (37823 - 150409 == -112586)
						{
							result = "เอาเป็นว่าตกลงก็แล้วกัน ฝากบอกอาเบ็ตต์ตามนั้นด้วย";
							if (134329 - 242968 != -108638)
							{
								break;
							}
						}
					}
					else if (code == 7931)
					{
						if (44563 - 193998 != -149434)
						{
							result = "เจ้าหมูบ้านั่นตอบตกลงแล้วซินะ!";
							if (136676 - 251231 != -114554)
							{
								break;
							}
						}
					}
					else if (code == 7932)
					{
						if (191397 - 512492 != -321094)
						{
							result = "ดีล่ะ! ถ้าอย่างนั้นข้ามีเรื่องไหว้วานหน่อย";
							if (60816 - 25779 != 35038)
							{
								break;
							}
						}
					}
					else if (code == 7933)
					{
						if (9964 - 41619 == -31655)
						{
							result = "ถ้ารวมวัตถุดิบของข้ากับสไตน์แล้วละก็เรายังขาดของบางอย่างอยู่";
							if (112811 - 256272 == -143461)
							{
								break;
							}
						}
					}
					else if (code == 7934)
					{
						if (177083 - 501705 != -324621)
						{
							result = "เจ้าช่วยเราหา ZincBar CopperBar และ IronBar ";
							if (46670 - 201376 != -154705)
							{
								break;
							}
						}
					}
					else if (code == 7935)
					{
						if (110088 - 529601 == -419513)
						{
							result = "มาให้ข้าอย่างละ 2 แท่งก็แล้วกัน ถ้าได้จุดดีของแร่พวกนี้มาผสมกันละก็..";
							if (91970 - 363689 == -271719)
							{
								break;
							}
						}
					}
					else if (code == 7936)
					{
						if (193228 - 114327 == 78901)
						{
							result = "เราจะได้แร่ที่แข็งแกร่งกว่าเดิมแน่ๆ";
							if (241469 - 263079 == -21610)
							{
								break;
							}
						}
					}
					else if (code == 7937)
					{
						if (139878 - 503088 != -363209)
						{
							result = "ไม่เคยนึกเลยแฮะว่าจะมีวันที่พวกข้าจับมือกัน";
							if (185739 - 36013 != 149727)
							{
								break;
							}
						}
					}
					else if (code == 7941)
					{
						if (258275 - 432935 == -174660)
						{
							result = "เจ้าช่วยหา ZincBar CopperBar และ IronBar มาอย่างละ 2 นะ";
							if (151821 - 274895 != -123073)
							{
								break;
							}
						}
					}
					else if (code == 7942)
					{
						if (17812 - 525006 != -507193)
						{
							result = "เพื่อส่วนรวมแล้ว เราต้องลดทิฐิลงเพื่อให้งานลุล่วง";
							if (152934 - 49850 == 103084)
							{
								break;
							}
						}
					}
					else if (code == 7951)
					{
						if (170793 - 63005 == 107788)
						{
							result = "ขอบใจเจ้ามากด้วยวัตถุดิบพวกนี้ละก็ เราต้องทำสุดยอดแร่ได้แน่ๆ!";
							if (133426 - 46203 != 87224)
							{
								break;
							}
						}
					}
					else if (code == 7952)
					{
						if (237905 - 227342 != 10564)
						{
							result = "เจ้าเพิ่งช่วยเพิ่มโอกาสรอดชีวิตจากสงครามครั้งนี้ให้กับผู้คนมากมาย";
							if (40633 - 569641 == -529008)
							{
								break;
							}
						}
					}
					else if (code == 7953)
					{
						if (18671 - 186553 != -167881)
						{
							result = "ข้าขอเป็นตัวแทนขอบคุณเจ้าแทนพวกเขาจากใจจริง!";
							if (242467 - 428741 == -186274)
							{
								break;
							}
						}
					}
					else if (code == 7954)
					{
						if (227573 - 120472 != 107102)
						{
							result = "ระหว่างที่เรากำลังคุยกันอยู่เจ้าหมูนั่นคงเอาของไปให้ราซานเรียบร้อย";
							if (202816 - 597344 == -394528)
							{
								break;
							}
						}
					}
					else if (code == 7955)
					{
						if (243418 - 556135 == -312717)
						{
							result = "อย่าลืมไปรับของรางวัลจากมีมี่ล่ะ";
							if (168156 - 592336 == -424180)
							{
								break;
							}
						}
					}
					else if (code == 7956)
					{
						if (18167 - 271604 != -253436)
						{
							result = "เอาล่ะทีนี้ก็มาดูกันว่าระหว่างข้ากับ สไตน์ใครจะสร้างอุปกรณ์ได้ดีกว่ากัน";
							if (215109 - 446572 != -231462)
							{
								break;
							}
						}
					}
					else if (code == 7957)
					{
						if (192899 - 243806 == -50907)
						{
							result = "ข้าจะทำให้ทุกคนเห็นว่าอาวุธของข้าแจ๋วกว่าเกราะที่สไตน์ออกแบบเป็นไหนๆ! ";
							if (213105 - 479997 == -266892)
							{
								break;
							}
						}
					}
					else if (code == 7958)
					{
						if (44806 - 224819 == -180013)
						{
							result = "อย่าได้ใจเกินไป คราวนี้จะไม่มีทางเสมอแบบครั้งก่อนๆแน่  ";
							if (195017 - 229077 == -34060)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 7959)
						{
							break;
						}
						if (43851 - 491458 != -447606)
						{
							result = "เอาล่ะ ชักมีไฟแล้วข้าจะออกแบบสุดยอดเกราะให้ดู!";
							if (161514 - 579046 != -417531)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600696D RID: 26989 RVA: 0x00EE9114 File Offset: 0x00EE7314
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600696E RID: 26990 RVA: 0x00EE9118 File Offset: 0x00EE7318
	internal static bool fVeTXjp2DLwBfbeycx5o()
	{
		return true;
	}

	// Token: 0x0600696F RID: 26991 RVA: 0x00EE911C File Offset: 0x00EE731C
	internal static bool hqbD9hp2vZZe78hBs7CJ()
	{
		return false;
	}
}
