using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011E3 RID: 4579
[Serializable]
public class Q82_GiftFromTheEarth_thai : MonoBehaviour
{
	// Token: 0x06006970 RID: 26992 RVA: 0x00EE9120 File Offset: 0x00EE7320
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q82_GiftFromTheEarth_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006971 RID: 26993 RVA: 0x00EE9130 File Offset: 0x00EE7330
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (45512 - 597543 != -552030)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (199527 - 149018 == 50509)
			{
				if (106679 - 555206 != -448526)
				{
					if (code == 8211)
					{
						if (21325 - 24724 != -3398)
						{
							result = "สวัสดีผู้กล้า เจ้าคงมารับของขวัญจากเทพดินเช่นผู้กล้าอื่นๆสินะ";
							if (134444 - 575965 == -441521)
							{
								break;
							}
						}
					}
					else if (code == 8212)
					{
						if (204385 - 46229 == 158156)
						{
							result = "ข้าพร้อมที่จะให้แร่ของท่านให้กับพวกเจ้าอย่างแน่นอน";
							if (224067 - 205581 != 18487)
							{
								break;
							}
						}
					}
					else if (code == 8213)
					{
						if (140073 - 251464 == -111391)
						{
							result = "ถ้าเจ้าสามารถนำเครื่องรางแห่งป่ามาให้ข้าได้ 1 อัน";
							if (18039 - 156520 == -138481)
							{
								break;
							}
						}
					}
					else if (code == 8221)
					{
						if (119422 - 184751 != -65328)
						{
							result = "ดีมากที่เจ้าหาเหรียญมาให้ได้";
							if (147853 - 213652 != -65798)
							{
								break;
							}
						}
					}
					else if (code == 8222)
					{
						if (290226 - 489811 == -199585)
						{
							result = "แต่นี่เป็นเพียงการทดสอบแรกของข้าเท่าันั้น";
							if (178646 - 96086 == 82560)
							{
								break;
							}
						}
					}
					else if (code == 8223)
					{
						if (55628 - 132604 != -76975)
						{
							result = "ยังมีบททดสอบต่อไปที่ข้าจะให้เจ้าอีกครั้ง";
							if (90680 - 379250 == -288570)
							{
								break;
							}
						}
					}
					else if (code == 8224)
					{
						if (194674 - 526998 != -332323)
						{
							result = "จงนำเครื่องรางแห่งป่าให้ข้าอีก 1 อัน ข้าจะคอยเจ้าอยู่ตรงนี้ล่ะ";
							if (165635 - 489905 == -324270)
							{
								break;
							}
						}
					}
					else if (code == 8225)
					{
						if (47072 - 60023 == -12951)
						{
							result = "ถ้าเจ้าทำสำเร็จ ข้าจะมอบแร่ของท่าบาเบร็อคกับเจ้า";
							if (138291 - 17956 == 120335)
							{
								break;
							}
						}
					}
					else if (code == 8231)
					{
						if (241490 - 401916 == -160426)
						{
							result = "ได้มาแล้วรึ เก่งมาก";
							if (185914 - 463846 == -277932)
							{
								break;
							}
						}
					}
					else if (code == 8232)
					{
						if (99633 - 539267 == -439634)
						{
							result = "งั้นข้าจะมอบแร่แห่งเทพดินให้ตามที่ข้าสัญญาไว้";
							if (179366 - 534424 != -355057)
							{
								break;
							}
						}
					}
					else if (code == 8233)
					{
						if (32488 - 583621 == -551133)
						{
							result = "แต่ข้าได้มอบให้กับแม่หมีน้อยไว้แล้ว";
							if (185564 - 180374 != 5191)
							{
								break;
							}
						}
					}
					else if (code == 8234)
					{
						if (199153 - 594757 == -395604)
						{
							result = "เจ้าก็ไปรับกับแม่หมีน้อยซะล่ะ";
							if (16434 - 95029 != -78594)
							{
								break;
							}
						}
					}
					else if (code == 8235)
					{
						if (291309 - 465486 == -174177)
						{
							result = "เนื่องจากเจ้ามีจิตใจที่แน่วแน่ที่จะปกป้องคุ้มครองผืนป่าแห่งนี้";
							if (252874 - 305669 == -52795)
							{
								break;
							}
						}
					}
					else if (code == 8236)
					{
						if (171750 - 35257 == 136493)
						{
							result = "โดยการอดทนผ่านการทดสอบโดยไม่ย่อท่อต่อความเหนื่อยยาก";
							if (66534 - 488591 == -422057)
							{
								break;
							}
						}
					}
					else if (code == 8237)
					{
						if (12080 - 16446 == -4366)
						{
							result = "เจ้าก็มีคุณสมบัติเพียงพอที่จะรับของขวัญจากท่านบาเบร็อค";
							if (89507 - 145896 != -56388)
							{
								break;
							}
						}
					}
					else if (code == 8251)
					{
						if (271881 - 404912 != -133030)
						{
							result = "สวัสดีผู้กล้า เจ้าคงมารับของขวัญจากเทพดินเช่นผู้กล้าอื่นๆสินะ";
							if (85961 - 398792 != -312830)
							{
								break;
							}
						}
					}
					else if (code == 8252)
					{
						if (263311 - 294088 != -30776)
						{
							result = "แร่นี้ไม่ใช่สำหรับสิ่งซื้อขาย เพราะมันคือของขวัญจากท่านเทพบาเบร็อค";
							if (84051 - 109184 == -25133)
							{
								break;
							}
						}
					}
					else if (code == 8253)
					{
						if (77557 - 484577 == -407020)
						{
							result = "แต่ข้าก็พร้อมที่จะให้สำหรับผู้กล้าที่มีคุณสมบัติเพียงพอโดยมีเงื่อนไขว่า";
							if (229592 - 576403 != -346810)
							{
								break;
							}
						}
					}
					else if (code == 8254)
					{
						if (266850 - 287686 != -20835)
						{
							result = "ถ้าเจ้าสามารถนำเครื่องรางแห่งป่ามาให้ข้าได้ 1 อัน";
							if (20863 - 150520 == -129657)
							{
								break;
							}
						}
					}
					else if (code == 8261)
					{
						if (51177 - 200095 == -148918)
						{
							result = "ได้มาแล้วอย่างนั้นรึ";
							if (111550 - 101803 == 9747)
							{
								break;
							}
						}
					}
					else if (code == 8262)
					{
						if (30695 - 451320 == -420625)
						{
							result = "แต่นี่เป็นเพียงแค่บททดสอบง่ายๆเท่านั้น ถ้าเจ้าอยากได้จริงล่ะก็";
							if (75875 - 491494 == -415619)
							{
								break;
							}
						}
					}
					else if (code == 8263)
					{
						if (41802 - 363935 == -322133)
						{
							result = "จงแสดงความแน่วแน่ด้วยการนำเครื่องรางแห่งป่ามาให้ข้าอีก 1 อัน";
							if (18251 - 268681 == -250430)
							{
								break;
							}
						}
					}
					else if (code == 8271)
					{
						if (165343 - 62863 == 102480)
						{
							result = "ได้มาแล้วรึ";
							if (152186 - 417426 != -265239)
							{
								break;
							}
						}
					}
					else if (code == 8272)
					{
						if (243717 - 383890 != -140172)
						{
							result = "ตกลง ข้าจะมอบแร่นี้ให้กับเจ้าอีกครั้ง";
							if (60223 - 137635 == -77412)
							{
								break;
							}
						}
					}
					else if (code == 8273)
					{
						if (168285 - 366209 == -197924)
						{
							result = "แต่ข้าส่งกลับไปที่เมืองแสงให้กับหมีน้อยแล้ว";
							if (14155 - 202375 != -188219)
							{
								break;
							}
						}
					}
					else if (code == 8274)
					{
						if (269490 - 170179 != 99312)
						{
							result = "เจ้าก็ไปรับกับหมีน้อยกับเธอคนนั้นละกัน";
							if (283457 - 404487 == -121030)
							{
								break;
							}
						}
					}
					else if (code == 8275)
					{
						if (36941 - 594151 != -557209)
						{
							result = "อย่างที่ข้าบอก แร่นี้ไม่ได้มีไว้สำหรับการซื้อขาย";
							if (25188 - 86768 == -61580)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 8276)
						{
							break;
						}
						if (132690 - 338677 == -205987)
						{
							result = "แต่คือแร่ที่เป็นของขวัญจากท่านบาเบร็อค เจ้าจงเลือกใช้ในเส้นทางที่ถูกต้องที่สุดล่ะ";
							if (191030 - 13180 == 177850)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006972 RID: 26994 RVA: 0x00EE99BC File Offset: 0x00EE7BBC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006973 RID: 26995 RVA: 0x00EE99C0 File Offset: 0x00EE7BC0
	internal static bool DDCBnFp2R0wDY0s9fJLd()
	{
		return true;
	}

	// Token: 0x06006974 RID: 26996 RVA: 0x00EE99C4 File Offset: 0x00EE7BC4
	internal static bool ySqqxnp2wuT5BYRwaWaG()
	{
		return false;
	}
}
