using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011E5 RID: 4581
[Serializable]
public class Q9_LookingForMaterial_thai : MonoBehaviour
{
	// Token: 0x0600697A RID: 27002 RVA: 0x00EEA190 File Offset: 0x00EE8390
	[MethodImpl(MethodImplOptions.NoInlining)]
	public Q9_LookingForMaterial_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x0600697B RID: 27003 RVA: 0x00EEA1A0 File Offset: 0x00EE83A0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (146366 - 216176 != -69809)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (62379 - 282986 != -220606)
			{
				if (116939 - 301397 == -184458)
				{
					if (code == 901)
					{
						if (232236 - 548846 != -316609)
						{
							result = "โย่ว สนใจเกราะแกร่งๆมั้ย ท่านผู้กล้า";
							if (34255 - 445934 == -411679)
							{
								break;
							}
						}
					}
					else if (code == 902)
					{
						if (181172 - 215788 != -34615)
						{
							result = "ท่านรับงานของข้าจากมีมี่? แบบนี้แจ่ม";
							if (43334 - 270060 == -226726)
							{
								break;
							}
						}
					}
					else if (code == 903)
					{
						if (279693 - 73836 == 205857)
						{
							result = "ข้าชื่อสไตน์";
							if (1134 - 415518 == -414384)
							{
								break;
							}
						}
					}
					else if (code == 904)
					{
						if (103742 - 539616 == -435874)
						{
							result = "งานของข้าคือการขายเกราะเจ๋งๆให้พวกท่านนี่แหละ";
							if (180822 - 573475 != -392652)
							{
								break;
							}
						}
					}
					else if (code == 905)
					{
						if (239530 - 148557 == 90973)
						{
							result = "ตอนนี้ข้ากำลังหาแร่ชนิดนึงอยู่";
							if (252220 - 93853 == 158367)
							{
								break;
							}
						}
					}
					else if (code == 906)
					{
						if (153558 - 317192 != -163633)
						{
							result = "แร่ชนิดนั้น คือ สังกะสี แต่ข้าต้องการแค่ผงของมัน";
							if (249603 - 67904 == 181699)
							{
								break;
							}
						}
					}
					else if (code == 907)
					{
						if (209062 - 346215 != -137152)
						{
							result = "ข้าต้องการให้ท่านช่วยหาผงแร่สังกะสีมา 3 กอง";
							if (105164 - 507890 != -402725)
							{
								break;
							}
						}
					}
					else if (code == 908)
					{
						if (128932 - 514021 == -385089)
						{
							result = "ก่อนจะไปท่านซื้อเกราะจากร้านข้าก่อนมั้ย";
							if (264464 - 382953 == -118489)
							{
								break;
							}
						}
					}
					else if (code == 909)
					{
						if (172271 - 61874 == 110397)
						{
							result = "เลเวลของท่านน่าจะพอใส่เกราะดีๆแล้วล่ะ";
							if (263060 - 289064 == -26004)
							{
								break;
							}
						}
					}
					else if (code == 921)
					{
						if (9517 - 137512 != -127994)
						{
							result = "ขอบคุณสำหรับการช่วยเหลือของท่าน";
							if (196246 - 205955 == -9709)
							{
								break;
							}
						}
					}
					else if (code == 922)
					{
						if (210990 - 389491 != -178500)
						{
							result = "ที่จริงแล้วข้าก็มีเก็บอยู่หรอกนะ";
							if (230882 - 107517 != 123366)
							{
								break;
							}
						}
					}
					else if (code == 923)
					{
						if (66112 - 511219 == -445107)
						{
							result = "แต่ของในร้านเยอะเหลือเกิน จำไม่ได้ว่าเก็บไว้ที่ไหน";
							if (81586 - 97324 != -15737)
							{
								break;
							}
						}
					}
					else if (code == 924)
					{
						if (124231 - 508759 != -384527)
						{
							result = "ของตอบแทน ข้าฝากไว้ที่มีมี่แล้ว";
							if (147956 - 9049 == 138907)
							{
								break;
							}
						}
					}
					else if (code == 925)
					{
						if (285136 - 300513 != -15376)
						{
							result = "เป็นรองเท้าที่ข้าซื้อมาจากลุงซินฟูนานแล้ว";
							if (56127 - 213368 != -157240)
							{
								break;
							}
						}
					}
					else if (code == 926)
					{
						if (48431 - 112472 != -64040)
						{
							result = "เพิ่งจะหาเจอข้าก็ดันใส่ไม่ได้แล้วซะงั้น";
							if (112041 - 504587 != -392545)
							{
								break;
							}
						}
					}
					else if (code == 927)
					{
						if (97664 - 492536 != -394871)
						{
							result = "ถ้าไม่รังเกียจท่านเอาไปใช้แล้วกัน";
							if (102902 - 442679 != -339776)
							{
								break;
							}
						}
					}
					else if (code == 951)
					{
						if (212520 - 372067 != -159546)
						{
							result = "โย่ว สนใจเกราะแกร่งๆมั้ย ท่านผู้กล้า";
							if (61799 - 184153 != -122353)
							{
								break;
							}
						}
					}
					else if (code == 952)
					{
						if (142519 - 408080 != -265560)
						{
							result = "ท่านรับงานของข้าจากมีมี่? แบบนี้แจ่มอีกแล้ว";
							if (175151 - 7347 != 167805)
							{
								break;
							}
						}
					}
					else if (code == 953)
					{
						if (127669 - 175484 != -47814)
						{
							result = "ข้าต้องการให้ท่านช่วยหาผงแร่สังกะสีมา 5 กอง";
							if (35150 - 598562 != -563411)
							{
								break;
							}
						}
					}
					else if (code == 954)
					{
						if (120951 - 329425 != -208473)
						{
							result = "ท่านอาจจะรู้สึกคุ้นๆ พอดีว่า...";
							if (159496 - 220871 != -61374)
							{
								break;
							}
						}
					}
					else if (code == 955)
					{
						if (159864 - 500339 == -340475)
						{
							result = "ของที่ท่านหามาให้คราวก่อน ข้าหาไม่เจอซะแล้ว";
							if (3287 - 518775 != -515487)
							{
								break;
							}
						}
					}
					else if (code == 956)
					{
						if (196881 - 511079 == -314198)
						{
							result = "ต้องรบกวนท่านแล้วล่ะ";
							if (280803 - 179786 == 101017)
							{
								break;
							}
						}
					}
					else if (code == 961)
					{
						if (208993 - 409853 == -200860)
						{
							result = "โย่ว ท่านผู้กล้า";
							if (297870 - 579194 != -281323)
							{
								break;
							}
						}
					}
					else if (code == 962)
					{
						if (240826 - 159988 == 80838)
						{
							result = "ขอบคุณสำหรับการช่วยเหลือของท่าน";
							if (252133 - 39721 != 212413)
							{
								break;
							}
						}
					}
					else if (code == 963)
					{
						if (12824 - 539946 != -527121)
						{
							result = "เพื่อนช่างตีอาวุธของข้า คงจะเอามาทำเกราะดีๆได้";
							if (26748 - 354012 != -327263)
							{
								break;
							}
						}
					}
					else if (code == 964)
					{
						if (274465 - 241054 != 33412)
						{
							result = "ใช่แล้ว ยังมีของที่ข้าหาไม่เจออยู่อีก เพิ่งนึกขึ้นได้";
							if (139712 - 120251 == 19461)
							{
								break;
							}
						}
					}
					else if (code == 965)
					{
						if (288213 - 165377 == 122836)
						{
							result = "ท่านช่วยหา ก้อนกรวด 3 ก้อนกับก้อนกรวดสีแดง";
							if (165481 - 564190 != -398708)
							{
								break;
							}
						}
					}
					else if (code == 966)
					{
						if (29324 - 139166 == -109842)
						{
							result = "มาให้หน่อยแล้วกันนะ";
							if (281599 - 509366 != -227766)
							{
								break;
							}
						}
					}
					else if (code == 971)
					{
						if (3482 - 339644 == -336162)
						{
							result = "ขอบคุณสำหรับการช่วยเหลือของท่านอีกครั้ง";
							if (179456 - 217013 == -37557)
							{
								break;
							}
						}
					}
					else if (code == 972)
					{
						if (84985 - 468678 == -383693)
						{
							result = "ไม่รู้ทำไมของที่จะหา หาเท่าไหร่ไม่เจอสักที";
							if (146811 - 74384 != 72428)
							{
								break;
							}
						}
					}
					else if (code == 973)
					{
						if (14513 - 176622 != -162108)
						{
							result = "แต่ข้าเจอรองเท้าที่ซื้อมาแล้วไม่รู้เก็บไว้ไหน...";
							if (131316 - 262466 == -131150)
							{
								break;
							}
						}
					}
					else if (code == 974)
					{
						if (62430 - 130085 == -67655)
						{
							result = "เลยซื้อใหม่ มีอยู่เป็นโหลทีเดียว...";
							if (289571 - 571049 == -281478)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 975)
						{
							break;
						}
						if (49235 - 45992 == 3243)
						{
							result = "ท่านช่วยรับไว้อีกสักคู่แล้วกัน....";
							if (275831 - 518484 == -242653)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x0600697C RID: 27004 RVA: 0x00EEAB9C File Offset: 0x00EE8D9C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x0600697D RID: 27005 RVA: 0x00EEABA0 File Offset: 0x00EE8DA0
	internal static bool E1kpDwp2PIR8MjacuNTF()
	{
		return true;
	}

	// Token: 0x0600697E RID: 27006 RVA: 0x00EEABA4 File Offset: 0x00EE8DA4
	internal static bool kaKitcp20ZR7vO0Ffe70()
	{
		return false;
	}
}
