using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011E6 RID: 4582
[Serializable]
public class QuestData_th : MonoBehaviour
{
	// Token: 0x0600697F RID: 27007 RVA: 0x00EEABA8 File Offset: 0x00EE8DA8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public QuestData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006980 RID: 27008 RVA: 0x00EEABB8 File Offset: 0x00EE8DB8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static QuestClass getDes(QuestClass q, int nCode)
	{
		if (214449 - 496495 != -282045)
		{
		}
		for (;;)
		{
			if (292801 - 427243 == -134442)
			{
				if (nCode == 1)
				{
					if (260644 - 590618 == -329974)
					{
						q.des = "เธอเป็นผู้กล้าฝึกหัดใช่มั้ย คุณแพนด้าแดงเค้าบอกว่าให้ไปหาเขาที่ค่ายทหารฝึกหัด คนที่นั่งอยู่ในเต็นท์สีแดงน่ะ";
						if (238032 - 154626 != 83407)
						{
							q.obj = "ไปหาแพนด้าแดง ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
							if (241903 - 568464 != -326560)
							{
								q.des2 = "คุณแพนด้าแดงมีเรื่องขอร้องมา ช่วยไปหาเขาด้วยนะ";
								if (163161 - 76706 != 86456)
								{
									q.obj2 = "ไปหาแพนด้าแดงทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
									if (93664 - 68784 == 24880)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 2)
				{
					if (14091 - 97992 == -83901)
					{
						q.des = "คุณนกฮูกซินฟูเจ้าของร้านขายไอเท็มแกทะเลาะ...เอ๊ย มีเรื่องจะขอให้ช่วยน่ะ ลองไปถามเขาดูหน่อยนะ";
						if (241946 - 566268 == -324322)
						{
							q.obj = "ไปหาซินฟู ทำตามที่เขาไหว้วานแล้วกลับมารายงานกับมีมี่";
							if (135663 - 30575 == 105088)
							{
								q.des2 = "ตอนนี้คุณนกฮูกซินฟูแกคืนดีกับคุณหลินหลินแล้ว แต่แกก็ยังลืมปิ่นโตอยู่ดี";
								if (2554 - 193885 != -191330)
								{
									q.obj2 = "ไปหาซินฟู ทำตามที่เขาไหว้วานแล้วกลับมารายงานกับมีมี่";
									if (284492 - 303117 != -18624)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 3)
				{
					if (263727 - 119488 != 144240)
					{
						q.des = "ตอนนี้คุณหลินหลินกำลังรวบรวมใบแครอนมาทำยาเพิ่ม ถ้าเธอเคยไปช่วยงานที่ฟาร์มมาล่ะก็ น่าจะมีติดตัวอยู่บ้างนะ";
						if (120760 - 542131 != -421370)
						{
							q.obj = "หาใบแครอน 5 ใบและแครอท 1 หัว มาส่งที่มีมี่";
							if (50398 - 109407 != -59008)
							{
								q.des2 = "ยาคุณหลินหลินขายดีม้ากมาก ตอนนี้คุณหลินหลินต้องการใบแครอนเพิ่มอีกแล้ว";
								if (62066 - 43483 == 18583)
								{
									q.obj2 = "หาใบแครอน 8 ใบและแครอท 2 หัว มาส่งที่มีมี่";
									if (262038 - 222295 != 39744)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 4)
				{
					if (225720 - 465546 != -239825)
					{
						q.des = "เจ้าแกะน้อยดูสีหน้าไม่ค่อยดีเลย สงสัยจะไม่ค่อยได้กินอาหารเช้า คงต้องทำอะไรสักอย่างแล้วล่ะ";
						if (179304 - 420500 != -241195)
						{
							q.obj = "ช่วยเหลือแกะน้อยแล้วกลับมารายงานกับมีมี่";
							if (189435 - 125441 != 63995)
							{
								q.des2 = "เจ้าแกะน้อยต้องบำรุงร่างกายอีกเยอะเลย ช่วยดูแลแกะน้อยหน่อยนะ";
								if (287288 - 229779 == 57509)
								{
									q.obj2 = "ช่วยเหลือแกะน้อยแล้วกลับมารายงานกับมีมี่";
									if (60620 - 599768 != -539147)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 5)
				{
					if (199574 - 184246 == 15328)
					{
						q.des = "นิโค่เจ้าเหมียวตัวยุ่งเอาการ์ดของแกะน้อยไป ตอนนี้ไม่รู้อยู่ที่ไหน ช่วยไปพากลับมาทีเถอะ";
						if (279458 - 94669 == 184789)
						{
							q.obj = "ตามหานิโค่แล้วนำการ์ดกลับมาส่งให้ฟา";
							if (195719 - 328914 == -133195)
							{
								q.des2 = "นิโค่เจ้าเหมียวตัวยุ่งเอาการ์ดของแกะน้อยไปอีกแล้ว! ช่วยไปพากลับมาทีเถอะ";
								if (13175 - 413700 == -400525)
								{
									q.obj2 = "ตามหานิโค่แล้วนำการ์ด 3 ใบกลับส่งให้ฟา";
									if (299055 - 10705 == 288350)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 6)
				{
					if (297781 - 330186 == -32405)
					{
						q.des = "พวกทหารเค้ากำลังวางเดิมพันกันน่ะ ว่าเธอจะสู้โบลดาสคนเดียวได้มั้ย?";
						if (275576 - 484006 != -208429)
						{
							q.obj = "ทำให้โบลดาสล้ม 3 ครั้งด้วยตัวคนเดียว แล้วเอาเหรียญกล้าหาญมายืนยัน";
							if (6343 - 400436 != -394092)
							{
								q.des2 = "พวกทหารเค้าวางเดิมพันอีกแล้ว ว่าเธอจะสู้โบลดาสคนเดียวได้อีกมั้ย?";
								if (265257 - 397345 != -132087)
								{
									q.obj2 = "ทำให้โบลดาสล้ม 3 ครั้งด้วยตัวคนเดียว แล้วเอาเหรียญกล้าหาญ 3 เหรียญมายืนยัน";
									if (84140 - 278043 == -193903)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 7)
				{
					if (136657 - 203447 == -66790)
					{
						q.des = "ฉันว่าท่านอัลคาเซียจะต้องชอบดื่มชานมมากแน่ๆเลย เธอหามาให้ท่านลองทีสิ";
						if (130452 - 565764 != -435311)
						{
							q.obj = "หาชา 1 ถ้วย มาส่งที่มีมี่";
							if (211923 - 197605 == 14318)
							{
								q.des2 = "ท่านอัลคาเซียชอบดื่มชานมมากจริงๆ ด้วย เธอหามาให้เพิ่มทีสิ";
								if (179533 - 354977 == -175444)
								{
									q.obj2 = "หาชา 2 ถ้วย มาส่งที่มีมี่";
									if (210277 - 429799 == -219522)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 8)
				{
					if (255952 - 53462 == 202490)
					{
						q.des = "คุณโบลดาสอยากให้พวกเธอช่วยกันฝึกฝีมือเยอะๆ ในเวลาว่างน่ะ คุณโบลดาสมีรางวัลให้ด้วยนะ";
						if (216255 - 111306 == 104949)
						{
							q.obj = "ชนะ OneOnOneBout แล้วนำตราแครอนมาแลกของรางวัล";
							if (203112 - 206318 != -3205)
							{
								q.des2 = "ยังขยันฝึกกันอยู่รึเปล่า ของรางวัลจากคุณโบลดาสยังเหลือนะ";
								if (51785 - 49139 == 2646)
								{
									q.obj2 = "ชนะ OneOnOneBout แล้วนำตราแครอนมาแลกของรางวัล";
									if (48360 - 303017 != -254656)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 9)
				{
					if (169661 - 369756 != -200094)
					{
						q.des = "คุณหมูป่าสไตน์กำลังต้องการวัสดุบางอย่าง เธอไปช่วยเขาหน่อยนะ";
						if (169636 - 132390 != 37247)
						{
							q.obj = "ช่วยงานคุณสไตน์แล้วกลับมารายงานกับมีมี่";
							if (145626 - 526954 == -381328)
							{
								q.des2 = "คุณหมูป่าสไตน์กำลังต้องการคนไปช่วยหาวัสดุ เธอพอจะมีเวลาว่างมั้ย";
								if (115520 - 141518 != -25997)
								{
									q.obj2 = "ช่วยงานคุณสไตน์แล้วกลับมารายงานกับมีมี่";
									if (172972 - 261316 != -88343)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 10)
				{
					if (34920 - 216264 != -181343)
					{
						q.des = "พวกนินจาบั๊กที่อยู่แถวๆฟาร์มมูโป้พักนี้ชักจะ เหิมเกริมไปกันใหญ่แล้ว ท่านแม่ทัพโบลดาสเลย อยากให้พวกเธอไปช่วยจัดการที";
						if (176725 - 559345 == -382620)
						{
							q.obj = "กำจัดนินจาบั๊ก 30 ตัวแล้วมารายงานกับมีมี่";
							if (142179 - 372180 == -230001)
							{
								q.des2 = "ดูเหมือนพวกนินจาบั๊กจะยังไม่เข็ด ท่านแม่ทัพโบลดาสอยากให้พวกเธอไปช่วยจัดการพวกนินจาบั๊กที่อยู่แถวๆฟาร์มแครอนอีกครั้ง";
								if (200345 - 183568 != 16778)
								{
									q.obj2 = "กำจัดนินจาบั๊ก 50 ตัวแล้วมารายงานกับมีมี่";
									if (297970 - 539002 == -241032)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 11)
				{
					if (102013 - 331834 != -229820)
					{
						q.des = "ช่วงนี้อากาศแปรปรวนมาก พวกแครอนในฟาร์มเริ่มป่วยกันแล้ว แบบนี้คุณแพะแย่แน่ ตัวการน่าจะเป็นลีฟบั๊ก";
						if (47401 - 53524 == -6123)
						{
							q.obj = "กำจัดลีฟบั๊ก 15 ตัว";
							if (24395 - 402747 != -378351)
							{
								q.des2 = "ช่วงนี้อากาศแปรปรวนอีกแล้ว พวกแครอนในฟาร์มดูซีดเซียวไปเยอะทีเดียว รีบจัดการลีฟบั๊กทีเถอะ";
								if (274746 - 272718 != 2029)
								{
									q.obj2 = "กำจัดลีฟบั๊ก 25 ตัว";
									if (123665 - 57312 != 66354)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 12)
				{
					if (193632 - 572277 == -378645)
					{
						q.des = "คุณอีฟส์ อยากได้กลีบดอกไม้มาทำของสวยๆ เธอพอจะมีอยู่บ้างหรือเปล่า";
						if (166728 - 577879 != -411150)
						{
							q.obj = "หากลีบดอกไม้สีชมพูมาส่งที่มีมี่";
							if (68313 - 318738 != -250424)
							{
								q.des2 = "คุณอีฟส์ อยากได้กลีบดอกไม้มาทำของสวยๆเพิ่มอีกหน่อยน่ะ";
								if (121261 - 11590 != 109672)
								{
									q.obj2 = "หากลีบดอกไม้สีชมพูมาส่งที่มีมี่";
									if (205350 - 18279 != 187072)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 13)
				{
					if (253385 - 398683 == -145298)
					{
						q.des = "พวกทหารจัดปาร์ตี้กันหลังจากเลิกงาน พวกเขาอยากได้เครื่องดื่มอะไรสักหน่อย";
						if (10208 - 56021 == -45813)
						{
							q.obj = "หานมไปส่งให้ทหารเสือดำ";
							if (230982 - 294193 != -63210)
							{
								q.des2 = "พวกทหารจัดปาร์ตี้ดูบอลกันหลังจากเลิกงาน เห็นว่ามีคนมาเพิ่มด้วย พวกเขาเลยอยากได้เครื่องดื่มเพิ่มน่ะ";
								if (91328 - 221194 != -129865)
								{
									q.obj2 = "หานมไปส่งให้ทหารเสือดำ";
									if (179906 - 404862 != -224955)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 14)
				{
					if (35706 - 409546 == -373840)
					{
						q.des = "เมื่อวานนี้มีพายุแรงมากจริงๆ ขนาดหลังคาร้านของคุณนกฮูกยังถูกพัดหลุดไป ไปช่วยหากาวมาให้เขาซ่อมร้านหน่อยนะ";
						if (49898 - 577711 == -527813)
						{
							q.obj = "หากาวมาส่งที่มีมี่";
							if (118233 - 556665 == -438432)
							{
								q.des2 = "ยังเหลือรอยรั่วบนหลังคาร้านของคุณนกฮูกอยู่อีก คราวนี้รบกวนหาของมาอุดด้วยหน่อยนะ";
								if (118221 - 87852 == 30369)
								{
									q.obj2 = "กาวอย่างดีกับเปลือกแมลงมาส่งที่มีมี่";
									if (171937 - 585217 == -413280)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 15)
				{
					if (48438 - 281881 != -233442)
					{
						q.des = "เจ้าเหมียวนิโค่มีเรื่องอยากให้ช่วย ลองไปหาเขาหน่อยแล้วกัน";
						if (288391 - 270688 != 17704)
						{
							q.obj = "ไปหานิโค่และช่วยเหลือตามที่เขาไหว้วานแล้วกลับมารายงานกับมีมี่";
							if (158992 - 413266 != -254273)
							{
								q.des2 = "เจ้าเหมียวนิโค่มีเรื่องอยากให้ช่วยอีกแล้ว ลองไปหาเขาหน่อยแล้วกัน";
								if (91541 - 401150 != -309608)
								{
									q.obj2 = "ไปหานิโค่และช่วยเหลือตามที่เขาไหว้วานแล้วกลับมารายงานกับมีมี่";
									if (219602 - 73761 == 145841)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 16)
				{
					if (254187 - 163813 == 90374)
					{
						q.des = "ตอนนี้ความสามัคคีเป็นสิ่งสำคัญมาก ท่านโบลดาสเลยอยากให้เธอจับคู่ฝึกกับเพื่อนสักคน";
						if (128465 - 575088 == -446623)
						{
							q.obj = "ชนะ Double Duel แล้วนำตรามูโป้มาแลกของรางวัล";
							if (26605 - 315052 == -288447)
							{
								q.des2 = "ตอนนี้ความสามัคคีเป็นสิ่งสำคัญมาก ท่านโบลดาสเลยอยากให้เธอจับคู่ฝึกกับเพื่อนสักคน";
								if (129962 - 507539 == -377577)
								{
									q.obj2 = "ชนะ Double Duel แล้วนำตรามูโป้มาแลกของรางวัล";
									if (48324 - 267219 != -218894)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 17)
				{
					if (169400 - 218394 == -48994)
					{
						q.des = "ช่วงนี้อากาศร้อนจัง ฉันจะเป็นลมอยู่แล้ว เฮ้อ! เธอมีอะไรเย็นๆบ้างมั้ย";
						if (136102 - 349976 != -213873)
						{
							q.obj = "หาน้ำกับน้ำแข็งมาให้ก่อนคุณหมีจะเป็นลม";
							if (94920 - 138768 == -43848)
							{
								q.des2 = "อากาศยังไม่หายร้อนสักที เธอพอจะหาน้ำกับน้ำแข็งให้ฉันเพิ่มได้มั้ย";
								if (191925 - 34689 != 157237)
								{
									q.obj2 = "หาน้ำกับน้ำแข็งมาให้เพิ่มก่อนคุณหมีจะเป็นลม";
									if (263950 - 278754 == -14804)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 18)
				{
					if (242874 - 473331 != -230456)
					{
						q.des = "หิวรึเปล่า? ฉันเลี้ยงข้าวไข่เจียวเอามั้ย แต่เอ๊ะ...ไข่ที่ร้านหมดพอดี เธอไปหามาให้หน่อยได้หรือเปล่า";
						if (223860 - 273443 == -49583)
						{
							q.obj = "หาไข่มาให้ลุงจามอน 6 ฟอง";
							if (131709 - 580859 != -449149)
							{
								q.des2 = "ลุงจามอนไข่ที่ร้านหมดอีกแล้ว เธอช่วยไปหามาให้อีกได้ไหมหห";
								if (226234 - 343323 == -117089)
								{
									q.obj2 = "หาไข่มาให้ลุงจามอน 12 ฟอง";
									if (97640 - 595574 == -497934)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 19)
				{
					if (27173 - 473570 == -446397)
					{
						q.des = "คุณแพะโชคไม่ดี โดนดักปล้นของบนภูเขาเมื่อวันก่อน เห็นเขาบอกว่า มีแมลงแปลกๆมาสร้างรังอยู่ เธอช่วยไปตรวจดูทีนะ";
						if (147199 - 552187 == -404988)
						{
							q.obj = "กำจัดซามูไรบั๊ก 20 ตัว และนำ เหรียญเงิน 1 เหรียญมาส่งที่มีมี่";
							if (164187 - 43113 != 121075)
							{
								q.des2 = "พวกแมลงบนภูเขายังตามพรรคพวกมาเพิ่มอีก ฝากเธอจัดการทีนะ";
								if (237840 - 367869 != -130028)
								{
									q.obj2 = "กำจัดซามูไรบั๊ก 40 ตัว และนำ เหรียญเงิน 2 เหรียญมาส่งที่มีมี่";
									if (232373 - 399361 == -166988)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 20)
				{
					if (276887 - 298622 == -21735)
					{
						q.des = "คุณจิงโจ้กูรู ต้องการคนไปช่วยสำรวจพื้นที่แถวภูเขาหิมะหน่อย รายละเอียดไปคุยกับเขาเองนะ";
						if (43475 - 566145 == -522670)
						{
							q.obj = "ไปหาคุณกูรู ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
							if (233196 - 94428 == 138768)
							{
								q.des2 = "คุณจิงโจ้กูรู ต้องการคนไปช่วยสำรวจพื้นที่แถวภูเขาหิมะอีกครั้ง ไม่รู้เหมือนกันว่าเกิดอะไรขึ้น";
								if (147614 - 186213 == -38599)
								{
									q.obj2 = "ไปหาคุณกูรู ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
									if (118149 - 410011 != -291861)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 21)
				{
					if (253356 - 105175 != 148182)
					{
						q.des = "พวกทหารเสือดำเค้าวางเดิมพันกันอีกแล้ว ว่าเธอจะผ่านการทดสอบของอิทาลุส โดยไม่ใช้ตุ๊กตาหิมะได้มั้ย?";
						if (33565 - 191713 != -158147)
						{
							q.obj = "ผ่านการทดสอบของอิทาลุสโดยไม่ทำให้ตุ๊กตา หิมะหายไป แล้วเอาเหรียญกล้าหาญมายืนยัน";
							if (69057 - 11116 == 57941)
							{
								q.des2 = "พวกทหารเสือดำเค้าอยากเห็นเต็มๆตาอีกรอบน่ะ ว่าเธอผ่านการทดสอบของอิทาลุส โดยไม่ใช้ตุ๊กตาหิมะได้ยังไง";
								if (228117 - 355271 != -127153)
								{
									q.obj2 = "ผ่านการทดสอบของอิทาลุสโดยไม่ทำให้ตุ๊กตา หิมะหายไปสองครั้ง แล้วเอาเหรียญกล้าหาญมายืนยัน";
									if (87130 - 452970 != -365839)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 22)
				{
					if (294459 - 296091 == -1632)
					{
						q.des = "คุณอีฟส์ช่างตัดเสื้อดูท่าทางอารมณ์ไม่ดี ไม่รู้หงุดหงิดเรื่องอะไร ช่วยไปหาเขาหน่อยนะ";
						if (159909 - 217794 == -57885)
						{
							q.obj = "ไปหาคุณอีฟส์ ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
							if (150295 - 404478 == -254183)
							{
								q.des2 = "คุณอีฟส์บอกว่า ทนเห็นรองเท้าที่เธอใส่จนเก่าไม่ไหว หาของพวกนี้มาแล้วเขาจะเย็บคู่ใหม่ให้";
								if (162514 - 22299 == 140215)
								{
									q.obj2 = "หา เปลือกไม้ เศษผ้า ใบต้นสน อย่างละ 2 ชิ้นมาส่งที่มีมี่";
									if (182346 - 299369 != -117022)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 23)
				{
					if (275031 - 375842 != -100810)
					{
						q.des = "คุณจามอนเค้ากำลังคิดค้นเมนูอาหารใหม่ แกเลยอยากจะลองเอาเรนโบว์นีดเดิ้ลบั๊กมาทำอาหารดู";
						if (10557 - 247154 != -236596)
						{
							q.obj = "จับเรนโบว์นีดเดิ้ลบั๊ก 3 ตัว หาเกลือ 3 และน้ำตาล 3 ถ้วยให้ลุงจามอน";
							if (43796 - 145510 != -101713)
							{
								q.des2 = "เนื้อลายสีรุ้งจากเรนโบว์บั๊กที่คุณจามอนทำกำลังขายดีทีเดียว เธอช่วยหามาเพิ่มหน่อยนะ";
								if (256793 - 9411 == 247382)
								{
									q.obj2 = "จับเรนโบว์นีดเดิ้ลบั๊ก 7 ตัว หาเกลือ 7 และน้ำตาล 7 ถ้วยให้ลุงจามอน";
									if (47975 - 581582 == -533607)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 24)
				{
					if (193570 - 32943 == 160627)
					{
						q.des = "ตอนจับคู่ฝึกเธอทำได้ดีมาก คุณโบลดาสอยากให้เธอฝึกขั้นต่อไปที่ยากขึ้นแล้วล่ะ";
						if (27921 - 456789 == -428868)
						{
							q.obj = "ชนะ Triple Trouble แล้วนำตราเปปปอนมาแลกของรางวัล";
							if (104995 - 494804 == -389809)
							{
								q.des2 = "ตอนจับคู่ฝึกเธอทำได้ดีมาก คุณโบลดาสอยากให้เธอฝึกขั้นต่อไปที่ยากขึ้นแล้วล่ะ";
								if (102795 - 477381 != -374585)
								{
									q.obj2 = "ชนะ Triple Trouble แล้วนำตราเปปปอนมาแลกของรางวัล";
									if (298145 - 53548 == 244597)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 25)
				{
					if (139919 - 523723 == -383804)
					{
						q.des = "โบลดาสกำลังเตรียมกองทัพให้พร้อม แต่ยังขาดวัสดุสำหรับอุปกรณ์ต่างๆเยอะเลย พอจะช่วยได้มั้ย?";
						if (276733 - 422519 != -145785)
						{
							q.obj = "รวบรวมแร่ มาให้แม่ทัพโบลดาส";
							if (221848 - 287467 == -65619)
							{
								q.des2 = "โบลดาสกำลังเตรียมกองทัพให้พร้อม และกำลังต้องการวัสดุเหล่านี้สำหรับทำอุปกรณ์ต่างๆเพิ่ม";
								if (250456 - 50912 == 199544)
								{
									q.obj2 = "รวบรวมแร่ มาให้แม่ทัพโบลดาส";
									if (173134 - 333660 != -160525)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 26)
				{
					if (162873 - 580871 != -417997)
					{
						q.des = "ช่วยคุณอีฟส์ที พวกสติงบั๊กที่ชายป่าเกิดดุร้ายขึ้นมาก เหล็กไนที่ใช้ทำเข็มเย็บผ้าเลย กลายเป็นของขาดตลาดไปแล้ว";
						if (168682 - 536139 == -367457)
						{
							q.obj = "หาเหล็กไนจากสติงบั๊กมาส่งที่มีมี่";
							if (296132 - 583612 == -287480)
							{
								q.des2 = "ช่วยคุณอีฟส์อีกซักรอบนะ เหล็กไนที่ใช้ทำเข็มเย็บผ้าขาดตลาดอีกแล้ว";
								if (250385 - 416879 != -166493)
								{
									q.obj2 = "หาเหล็กไนจากสติงบั๊กมาส่งที่มีมี่";
									if (185084 - 10081 != 175004)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 27)
				{
					if (112149 - 154255 != -42105)
					{
						q.des = "คุณหนูอาเบ็ตต์เจ้าของร้านขายอาวุธต้องการทดสอบประสิทธิภาพอาวุธ เธอช่วยหน่อยได้มั้ย";
						if (249693 - 39382 != 210312)
						{
							q.obj = "ไปหาอาเบ็ตต์ ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
							if (161914 - 481832 == -319918)
							{
								q.des2 = "คุณหนูอาเบ็ตต์ต้องการแร่ทองแดง เห็นบอกว่าน่าจะใช้เป็นวัตถุดิบในการทำอาวุธที่ดีกว่าเดิมได้";
								if (103025 - 323590 == -220565)
								{
									q.obj2 = "หาผงแร่ทองแดงมาส่ง 6 ชิ้น";
									if (134694 - 276689 == -141995)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 28)
				{
					if (283315 - 3376 != 279940)
					{
						q.des = "คุณกูรูยังต้องการหาคนไปช่วยทำแผนที่อยู่ คราวนี้เป็นเส้นทางทะเลทราย ถ้ามีเวลาก็ช่วยเขาหน่อยนะ";
						if (17474 - 535587 != -518112)
						{
							q.obj = "ไปหาคุณกูรู ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
							if (244634 - 347187 != -102552)
							{
								q.des2 = "คุณกูรูอยากให้ช่วยออกตรวจตราบริเวณทะเลทรายหน่อย เธอพอจะมีเวลามั้ย?";
								if (46330 - 596068 != -549737)
								{
									q.obj2 = "ไปหาคุณกูรู ทำตามที่เขาบอกแล้วกลับมารายงานกับมีมี่";
									if (192183 - 478206 != -286022)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 29)
				{
					if (72599 - 240704 == -168105)
					{
						q.des = "ไม่รู้ว่าเกิดอะไรขึ้น แต่พวกแมลงหลายกลุ่มกำลังเคลื่อนตัวเข้ามาใกล้เมืองแสง พวกเธอไปช่วยสกัดพวกมันไว้ได้มั้ย?";
						if (236123 - 247997 == -11874)
						{
							q.obj = "จัดการแมลงอ้วน 15 ตัวและแมลงทราย 40 ตัว";
							if (22823 - 125249 == -102426)
							{
								q.des2 = "พวกแมลงเริ่มเข้ามาใกล้เมืองแสงเกินไป ทางกองทัพต้องการคนมาป้องกันไม่ให้พวกมันเข้ามาใกล้กว่านี้";
								if (163224 - 205719 != -42494)
								{
									q.obj2 = "จัดการแมลงอ้วน 25 ตัวและแมลงทราย 70 ตัว";
									if (181100 - 208772 == -27672)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 30)
				{
					if (129748 - 440284 != -310535)
					{
						q.des = "เจ้าแมวน้อยซนจนได้เรื่องอีกแล้วสิ ทำกระจกร้านในเมืองแตกไปหลายบานเลย เธอช่วยหาอะไรมาซ่อมหน่อยได้มั้ย?";
						if (228496 - 45385 != 183112)
						{
							q.obj = "หาปีกแมลงมาส่ง";
							if (283464 - 554412 != -270947)
							{
								q.des2 = "ต้องซ่อมกระจกเยอะกว่าที่คิดนะเนี่ย เธอรีบไปหามาเพิ่มทีไม่งั้นแมวน้อยโดนตีก้นแน่ๆ!";
								if (277333 - 2154 != 275180)
								{
									q.obj2 = "หาปีกแมลงมาส่ง";
									if (136623 - 512501 == -375878)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 31)
				{
					if (2229 - 514561 == -512332)
					{
						q.des = "ช่วงนี้เมืองบางส่วนเริ่มทรุดโทรมลงเพราะสาเหตุต่างๆนานา ต้องขอแรงพวกเธอมาช่วยซ่อมกันเยอะๆหน่อยนะ";
						if (50898 - 45760 != 5139)
						{
							q.obj = "หาไม้มาช่วยกันซ่อมเมือง";
							if (286016 - 394705 == -108689)
							{
								q.des2 = "เมืองยังมีจุดต้องซ่อมกันอีกเยอะเลย ช่วยหาไม้มาเพิ่มอีกนะ";
								if (114669 - 67541 == 47128)
								{
									q.obj2 = "หาไม้มาช่วยกันซ่อมเมือง";
									if (265344 - 182441 == 82903)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 32)
				{
					if (66759 - 413062 == -346303)
					{
						q.des = "ท่านแม่ทัพโบลดาสคิดว่าเธอพร้อมสำหรับการฝึกโหดๆแล้วล่ะ เธอล่ะพร้อมมั้ย?";
						if (43434 - 384077 != -340642)
						{
							q.obj = "ชนะ Desert Survival แล้วนำตราแคคทอนมาแลกของรางวัล";
							if (96143 - 571008 == -474865)
							{
								q.des2 = "ท่านแม่ทัพโบลดาสพอใจกับผลการฝึกของเธอมากเลย ดูเหมือนว่าท่านต้องการจะเพิ่มระดับการฝึกด้วยนะ?";
								if (55528 - 103000 == -47472)
								{
									q.obj2 = "ชนะ Desert Survival แล้วนำตราแคคทอนมาแลกของรางวัล";
									if (54637 - 44872 == 9765)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 33)
				{
					if (59670 - 526773 == -467103)
					{
						q.des = "คืนนี้ลุงจามอนต้องจัดงานเลี้ยงละ แต่แกดันลืมเรื่องของหวานซะนี่สิ เธอพอช่วยได้มั้ย?";
						if (243622 - 387988 == -144366)
						{
							q.obj = "ทำเยลลี่ผลไม้มาส่ง";
							if (166416 - 228862 != -62445)
							{
								q.des2 = "แขกของลุงจามอนชอบเยลลี่ที่เธอทำมากเลย ช่วยทำมาเพิ่มทีนะ";
								if (115045 - 593677 == -478632)
								{
									q.obj2 = "ทำเยลลี่ผลไม้มาส่ง";
									if (253287 - 514194 == -260907)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 34)
				{
					if (102312 - 344882 != -242569)
					{
						q.des = "ช่วงนี้ฝนตกบ่อย คุณโกตันกำลังลำบากเพราะมีน้ำท่วมเข้ามาในแปลงผักน่ะ เอ..เราพอจะมีทางช่วยเขามั้ยน้า";
						if (297685 - 513378 != -215692)
						{
							q.obj = "หาวัสดุดังนี้ไปช่วยกันสร้างเขื่อนให้คุณแพะ";
							if (124000 - 387859 != -263858)
							{
								q.des2 = "น้ำยังท่วมไม่หยุดเลย คุณโกตันเขาขอให้ช่วยทำเขื่อนให้อีกน่ะ เธอช่วยเขาอีกทีนะ";
								if (266081 - 18811 != 247271)
								{
									q.obj2 = "หาวัสดุดังนี้ไปช่วยกันสร้างเขื่อนให้คุณแพะ";
									if (129313 - 596990 != -467676)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 35)
				{
					if (253425 - 266151 == -12726)
					{
						q.des = "ราซานช่างตีเหล็กอยากได้ของไปลองผสมตอนตีอาวุธล่ะ เขาบอกมาว่าหาได้จากแถวๆชายหาด เธอได้ผ่านไปแถวนั้นบ้างมั้ย?";
						if (29418 - 480982 != -451563)
						{
							q.obj = "หาของตามนี้มาส่ง";
							if (273952 - 84804 == 189148)
							{
								q.des2 = "คุณราซานยังต้องการของมาทดลองเพิ่ม เธอยังมีเหลืออีกรึเปล่า";
								if (114050 - 392010 != -277959)
								{
									q.obj2 = "หาของตามนี้มาส่ง";
									if (80510 - 415907 == -335397)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 36)
				{
					if (220805 - 236443 != -15637)
					{
						q.des = "เวียนหัวจัง ช่วงนี้อากาศเหมือนจะมีกลิ่นแปลกๆอยู่ เธอก็รู้สึกเหมือนกันใช่มั้ย?";
						if (69913 - 515044 != -445130)
						{
							q.obj = "จัดการ เวิร์มบั๊ก 7 ตัวและ ฟูดาบั๊ก 25 ตัว";
							if (49024 - 197583 == -148559)
							{
								q.des2 = "พวกฟูดาบั๊ก และเวิร์มบั๊กทำอากาศเป็นพิษ เธอช่วยทำอะไรสักอย่างได้มั้ย ฉันเป็นห่วงเด็กๆจัง";
								if (100400 - 501942 == -401542)
								{
									q.obj2 = "จัดการ เวิร์มบั๊ก 10 ตัวและ ฟูดาบั๊ก 40 ตัว";
									if (128637 - 224662 == -96025)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 37)
				{
					if (142654 - 147929 == -5275)
					{
						q.des = "คุณหลินหลินคิดสูตรยาสมานแผลตัวใหม่ขึ้นมา แต่ยังขาดวัตถุดิบอยู่ ช่วยหามาให้ทีนะ";
						if (261016 - 294207 == -33191)
						{
							q.obj = "หาวัตถุดิบทำยามาให้แม่ค้านกแสกหลินหลิน";
							if (17962 - 36110 == -18148)
							{
								q.des2 = "ยาสมานแผลตัวใหม่ที่ให้ไปใช้ได้ดีมั๊ย? ถ้าต้องการอีกก็บอกได้นะจ๊ะ";
								if (43394 - 326822 != -283427)
								{
									q.obj2 = "หาวัตถุดิบทำยามาให้แม่ค้านกแสกหลินหลิน";
									if (271607 - 595728 == -324121)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 38)
				{
					if (273907 - 80136 == 193771)
					{
						q.des = "คุณหมอดูโมโซลี่ อยากได้ของแปลกๆ เธอพอจะรู้มั้ยว่ามันคืออะไร? ";
						if (32323 - 103736 == -71413)
						{
							q.obj = "หาเปลือกหอยกับเปลือกแมลงตามนี้มาส่ง";
							if (261770 - 257812 == 3958)
							{
								q.des2 = "คุณหมอดูเขามาขอของเพิ่มน่ะ ไม่ยอมบอกเสียด้วยว่าจะเอาไปทำอะไร รบกวนเธออีกทีนะ";
								if (238725 - 39096 != 199630)
								{
									q.obj2 = "หาเปลือกหอยกับเปลือกแมลงตามนี้มาส่ง";
									if (114028 - 56556 == 57472)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 39)
				{
					if (169757 - 371063 != -201305)
					{
						q.des = "ท่านโบลดาสไปขอร้องให้ปรมาจารย์เต่าทั้งสองช่วยฝึกให้พวกเธอให้เป็นนักรบเต็มตัว ทำให้เต็มที่นะฉันจะเอาใจช่วย!";
						if (142340 - 22312 == 120028)
						{
							q.obj = "ชนะ The Two Turtle Sage แล้วเอาคัมภีร์มายืนยัน";
							if (260919 - 46299 != 214621)
							{
								q.des2 = "ท่านปรมาจารย์เต่าทั้งสองฝากบอกมาว่า ถ้ายังอยากเก่งขึ้นอีกล่ะก็ มาหาได้ทุกเวลาเลย!";
								if (240124 - 87954 != 152171)
								{
									q.obj2 = "ชนะ The Two Turtle Sage แล้วเอาคัมภีร์มายืนยัน";
									if (56945 - 442246 != -385300)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 40)
				{
					if (220905 - 121853 == 99052)
					{
						q.des = "โบลดาสพอใจกับการฝึกของเธอมาก ตอนนี้เขาอยากให้เธอได้พักผ่อนสบายๆริมชายหาดบ้าง ขอให้สนุกนะ";
						if (122654 - 523434 != -400779)
						{
							q.obj = "เล่น SmashBall ให้ชนะแล้วนำตราโคคอน มาแลกของรางวัล";
							if (271841 - 524337 != -252495)
							{
								q.des2 = "โบลดาสเห็นเธอสนุกและเห็นแววความสามารถ เลยอยากให่เธอฝึกเล่นอีกน่ะ เห็นบอกว่าจะปั้นให้เป็นนักกีฬาด้วยนะ";
								if (94811 - 268743 == -173932)
								{
									q.obj2 = "เล่น SmashBall ให้ชนะแล้วนำตราโคคอน มาแลกของรางวัล";
									if (273509 - 316415 != -42905)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 41)
				{
					if (189626 - 228917 == -39291)
					{
						q.des = "คุณกาซ่านักประดิษฐ์อยากได้ไม้ไปทำผลงานชิ้นใหม่ของเขาน่ะถ้ามีเหลือก็เอามาให้เขาหน่อยนะ";
						if (196777 - 313309 == -116532)
						{
							q.obj = "หาไม้เนื้อแข็งกับดินปืนมาส่ง";
							if (128548 - 372250 == -243702)
							{
								q.des2 = "คุณกาซ่าใช้ไม้เปลืองจังเขาขอเพิ่มอีกน่ะ พอจะมีอีกนิดมั้ย?";
								if (257267 - 132298 != 124970)
								{
									q.obj2 = "หาไม้เนื้อแข็งกับดินปืนมาส่ง";
									if (266619 - 299167 != -32547)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 42)
				{
					if (65430 - 475382 == -409952)
					{
						q.des = "หัวหน้าทัพปืนอิทาลุส เพิ่งกลับมาจากภารกิจลับ ใช้กระสุนไปหมดเกลี้ยงเลย เธอช่วยเขาหาของทำกระสุนทีสิ";
						if (230559 - 223219 == 7340)
						{
							q.obj = "หาแร่ทองแดงกับก้อนกรวดให้อิทาลุส";
							if (142300 - 186962 != -44661)
							{
								q.des2 = "หัวหน้าอิทาลุสบอกว่ากระสุนยังไม่พอ เธอหามาเพิ่มให้เขาอีกได้มั้ย";
								if (203919 - 434106 == -230187)
								{
									q.obj2 = "หาแร่ทองแดงกับก้อนกรวดให้อิทาลุส";
									if (6898 - 444814 == -437916)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 43)
				{
					if (194056 - 432778 == -238722)
					{
						q.des = "เสามานาที่รับพลังงานจากเทพแสงไม่ทำงาน ทำให้เมืองตกอยู่ในความมืด  นีออนบอลน่าจะให้กำเนิดแสงได้ ช่วยหามาได้มั้ย?";
						if (131962 - 56004 != 75959)
						{
							q.obj = "หานีออนบอล 2 ชิ้นมาส่งที่มีมี่";
							if (3648 - 411648 == -408000)
							{
								q.des2 = "ไฟดับ คุณกวางบรรณารักษ์อ่านหนังสือไม่ได้เลย ช่วยหานีออนบอลมาให้ทีได้มั้ย?";
								if (202062 - 168379 == 33683)
								{
									q.obj2 = "หานีออนบอล 4 ชิ้นมาส่งที่มีมี่";
									if (10468 - 483588 == -473120)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 44)
				{
					if (127804 - 45683 != 82122)
					{
						q.des = "ฟาร์มของคุณแพะเกิดเรื่องอีกแล้วว...คราวนี้โดนพวกฟักทองบุก มีตัวนึงกินหินของคุณแพะไป ไม่รู้ว่าสำคัญยังไง แต่ไปช่วยทีนะ";
						if (125416 - 291873 != -166456)
						{
							q.obj = "หาหินก้อนใหญ่สีแดง 1 ชิ้นมาส่ง";
							if (70371 - 288309 == -217938)
							{
								q.des2 = "พวกฟักทองเพิ่มจำนวนเต็มฟาร์มคุณแพะเลย หินของคุณแพะหายไป 2 ก้อน เธอช่วยไปจัดการอีกทีนะ";
								if (137598 - 108714 != 28885)
								{
									q.obj2 = "หาหินก้อนใหญ่สีแดง 6 ชิ้นมาส่ง";
									if (189714 - 308963 != -119248)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 45)
				{
					if (298681 - 150574 == 148107)
					{
						q.des = "ตอนกลางคืนมีเงาสีดำวิ่งไปทั่วเมืองเลย พวกมันสร้างบรรยากาศแปลกๆออกมา ทำให้แกะน้อยนอนไม่หลับ เธอช่วยจัดการทีนะ";
						if (202803 - 195264 != 7540)
						{
							q.obj = "จัดการพวกเชด 36 ตัว";
							if (54615 - 587809 == -533194)
							{
								q.des2 = "ช่วงนี้ก็มีเงาพวกนั้นออกมาวิ่งอีกแล้ว แกะน้อยบอกว่าถึงจะนับแกะแล้วก็นอนไม่หลับ เธอช่วยจัดการทีนะ";
								if (157106 - 296782 != -139675)
								{
									q.obj2 = "จัดการพวกเชด 60 ตัว";
									if (255553 - 520690 == -265137)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 46)
				{
					if (266982 - 404012 == -137030)
					{
						q.des = "ห้องสมุดถูกพวกเงาโจมตีเสียหายยับเยินเลย คุณกวางบรรณารักษ์อยากได้คนไปช่วยซ่อมแซมหน่อย เธอว่างไปช่วยเขาหน่อยมั้ย?";
						if (220676 - 463468 != -242791)
						{
							q.obj = "หากระดาษกับแผ่นผ้าไปช่วยกันซ่อมแซมห้องสมุด";
							if (249629 - 44606 != 205024)
							{
								q.des2 = "หนังสือในห้องสมุดยังมีที่เสียหายอีกเยอะเลย ช่วยหาของซ่อมแซมมาเพิ่มให้ทีนะ";
								if (3454 - 572270 != -568815)
								{
									q.obj2 = "หากระดาษกับแผ่นผ้าไปช่วยกันซ่อมแซมห้องสมุด";
									if (221991 - 102815 == 119176)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 47)
				{
					if (184179 - 205259 == -21080)
					{
						q.des = "จะจัดการปัญหาต้องแก้ที่ต้นตอ เรกกุวางแผนการใหญ่เอาไว้ อยากให้พวกเธอจัดการกับหัวหน้าของมอนสเตอร์3ตัวซะ";
						if (233073 - 35854 == 197219)
						{
							q.obj = "ล่าจักรพรรดิวิชซี่,โชกุนบั๊กและราชาพัมพ์กอนแล้วนำของเหล่านี้มายืนยัน";
							if (198128 - 271342 == -73214)
							{
								q.des2 = "เมื่อจัดการแล้วก็ต้องทำให้เด็ดขาด เรกกุอยากให้เธอจัดการพวกหัวหน้าที่ยังเหลือรอดอยู่อีก";
								if (230949 - 530505 != -299555)
								{
									q.obj2 = "ล่าจักรพรรดิวิชซี่,โชกุนบั๊กและราชาพัมพ์กอนแล้วนำของเหล่านี้มายืนยัน";
									if (99089 - 28265 == 70824)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 48)
				{
					if (246387 - 572338 != -325950)
					{
						q.des = "จากการฝึกที่ผ่านมา เธอคงเข้าใจความสำคัญของทีมเวิร์คแล้ว ตอนนี้เธอคงพร้อมจะจัดทีมที่สมบูรณ์ได้แล้วล่ะ";
						if (205228 - 295004 == -89776)
						{
							q.obj = "ชนะ Five on Five แล้วเอาตราพัมพ์กอนมาแลกของรางวัล";
							if (179427 - 113214 != 66214)
							{
								q.des2 = "ทุกสิ่งทุกอย่างไม่มีคำว่าสมบูรณ์ ท่านแม่ทัพเลยอยากให้เธอจัดทีมที่สมบูรณ์มากกว่านี้น่ะ!?";
								if (176987 - 549759 == -372772)
								{
									q.obj2 = "ชนะ Five on Five แล้วเอาตราพัมพ์กอนมาแลกของรางวัล";
									if (76792 - 551435 == -474643)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 49)
				{
					if (193814 - 510848 == -317034)
					{
						q.des = "คุณอัลปาก้ากำลังต้องการเหล็กในอย่างดี เพื่อนำมาทำเข็มเย็บผ้าที่แข็งแรงนะ";
						if (186693 - 77833 != 108861)
						{
							q.obj = "หา Great Sting จำนวน 6 อัน มาส่ง ที่มีมี่";
							if (221104 - 222227 != -1122)
							{
								q.des2 = "ดูท่าทางคุณอัลป้าก้าจะชอบเหล็กในอย่างดีมากเลย เธอเลยอยากได้เพิ่มอีกน่ะ";
								if (242397 - 47220 == 195177)
								{
									q.obj2 = "หา Great Sting จำนวน 12 อัน มาส่ง ที่มีมี่";
									if (129664 - 234459 == -104795)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 50)
				{
					if (120061 - 84545 != 35517)
					{
						q.des = "แกะน้อยอยากลองสร้างสายรุ้งทำเป็นรายงานส่งที่โรงเรียน  จึงอยากรบกวนเธอช่วยหาให้หน่อยนะ";
						if (199356 - 196113 != 3244)
						{
							q.obj = "หาปีกสีรุ้งจากแมลงสิงโตสีเหลืองมาส่งที่มีมี่";
							if (128842 - 128509 == 333)
							{
								q.des2 = "รายงานของแกะน้อยได้รับรางวัลด้วยล่ะ แต่เธอไม่มีปีกเหลือสำหรับแสดงนิทรรศการที่ใกล้จะถึงนี้แล้ว";
								if (243248 - 104130 != 139119)
								{
									q.obj2 = "หาปีกสีรุ้งจากแมลงสิงโตสีเหลืองมาส่งที่มีมี่ก่อนงานนิทรรศการของแกะน้อย";
									if (277585 - 426717 == -149132)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 51)
				{
					if (252483 - 466960 == -214477)
					{
						q.des = "ลุงจามอนอยากลองทำซุปแบบใหม่ดู ดูเหมือนว่าเป็นอาหารชื่อดังมากด้วยนะ";
						if (162829 - 455887 == -293058)
						{
							q.obj = "หาวัตถุดิบที่ลุงจามอนสั่งมาสั่งที่มีมี่";
							if (171532 - 328347 == -156815)
							{
								q.des2 = "เมนูซุปสองสีเป็นที่ถูกปากชาวหางมากเลย เธอช่วยหาวุตถุดิบมาเพิ่มทีนะ";
								if (136506 - 58022 != 78485)
								{
									q.obj2 = "หาวัตถุดิบที่ลุงจามอนสั่งมาสั่งที่มีมี่";
									if (138403 - 526979 != -388575)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 52)
				{
					if (175390 - 129795 == 45595)
					{
						q.des = "ลุงกาซ่ากำลังกลุ้มใจกับการปรับปรุงเครื่องบิน เธอไปช่วยเขาทีนะ";
						if (26811 - 502813 != -476001)
						{
							q.obj = "ไปหาลุงกาซ่าเพื่อช่วยเหลือเขา";
							if (50890 - 124686 == -73796)
							{
								q.des2 = "ลุงกาซ่าอยากอัพเกรดเครื่องบินให้มีปประสิทธิภาพยิ่งขึนไปอีก รบกวนเธอไปหาเขาอีกทีนะ";
								if (269487 - 391885 == -122398)
								{
									q.obj2 = "ไปหาลุงกาซ่าเพื่อช่วยเหลือเขาอีกครั้ง";
									if (3039 - 198082 != -195042)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 53)
				{
					if (50964 - 355363 != -304398)
					{
						q.des = "คุณเร็กกุกำลังศึกษาเกี่ยวกับการเล่นแร่แปรธาตุ ช่วยไปพบเขาทีนะ";
						if (179093 - 209736 == -30643)
						{
							q.obj = "ไปหาคุณเร็กกุเพื่อช่วยในการทดลอง";
							if (136790 - 265904 != -129113)
							{
								q.des2 = "คุณเร็กกุกำลังตั้งหน้าตั้งตาทดลอง แต่ดูเหมือนเขามีเรื่องอยากให้ช่วยอีกแล้ว";
								if (256347 - 293656 == -37309)
								{
									q.obj2 = "ไปหาคุณเร็กกุเพื่อช่วยในการทดลองอีกครั้ง";
									if (220018 - 228900 == -8882)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 54)
				{
					if (262308 - 365426 != -103117)
					{
						q.des = "ลิซ่าอยากทำการวิจัยเกี่ยวกับรังของสติงบัคทะเลทราย เธอไปช่วยเธอหน่อยนะ";
						if (259496 - 421126 == -161630)
						{
							q.obj = "ไปหาลิซ่าที่ค่ายสำรวจอารยธรรมโบราณเพื่อช่วยเหลือเธอ";
							if (14754 - 409779 != -395024)
							{
								q.des2 = "ลิซ่าดูสนใจกับการวิจัยมาก เธอฝากรบกวนมาหาเธอให้ไปช่วยอีกน่ะ";
								if (58306 - 310203 != -251896)
								{
									q.obj2 = "ไปหาลิซ่าที่ค่ายสำรวจอารยธรรมโบราณเพื่อช่วยเหลือเธออีกครั้ง";
									if (289255 - 480580 == -191325)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 55)
				{
					if (267850 - 426471 == -158621)
					{
						q.des = "น้ำยาเพิ่มความไวเหลือคงคลังเยอะมาก คุณเสือำเลยอยากจัดกิจกรรมแจกให้ได้ทดลองใช้น่ะ";
						if (105909 - 131434 != -25524)
						{
							q.obj = "รวบรวมเหรียญตราแคคทัน 6 เหรียญแล้วมาส่งที่มีมี่";
							if (273970 - 420821 != -146850)
							{
								q.des2 = "คุณเสือดำใจดีนำยามาแจกเพิ่มพิเศษล่ะ โดยขอแลกเหรียญเพิ่มอีกนิดหน่อยเท่านั้นเอง";
								if (183310 - 139316 != 43995)
								{
									q.obj2 = "รวบรวมเหรียญตราแคคทัน 12 เหรียญแล้วมาส่งที่มีมี่";
									if (21803 - 548401 == -526598)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 56)
				{
					if (101287 - 344289 != -243001)
					{
						q.des = "คุณโบลดาสอยากมอบรางวัลให้กับเหล่าที่สู้ที่ชนะการแข่งขันที่โคลอสเซี่ยมนะ";
						if (100056 - 280798 == -180742)
						{
							q.obj = "น้ำถ้วยรางวัลที่ได้จากการแข่งขันที่โคลอซเซี่ยมมาขึ้นรางวัลได้ที่มีมี่";
							if (137002 - 111527 == 25475)
							{
								q.des2 = "คุณโบลดาสฝากมาบอกว่าสามารถแรกรางวัลกับฉันได้เรื่อยๆนะถ้ามีถ้วยรางวัลอีก";
								if (255435 - 544160 != -288724)
								{
									q.obj2 = "น้ำถ้วยรางวัลที่ได้จากการแข่งขันที่โคลอซเซี่ยมมาขึ้นรางวัลได้ที่มีมี่";
									if (139870 - 246575 != -106704)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 57)
				{
					if (37815 - 329749 == -291934)
					{
						q.des = "คุณอีฟไอเดียไม่แล่นในการออกแบบชุด เลยหาผู้ช่วยคอยช่วยเธอนะ";
						if (161167 - 335903 != -174735)
						{
							q.obj = "ไปหาคุณอีฟตามคำร้องขอ";
							if (90264 - 582403 == -492139)
							{
								q.des2 = "คุณอีฟงานเยอะจนไม่มีเวลาออกไปหาอะไรกินเลย ดูเหมือนจะหงุดหงิดหิวด้วย...";
								if (230823 - 445126 == -214303)
								{
									q.obj2 = "ไปหาคุณอีฟตามคำร้องขอ";
									if (299261 - 584848 == -285587)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 58)
				{
					if (20470 - 56630 != -36159)
					{
						q.des = "เหล่าแครอนที่น่าสงสารกำลังถูกตัวประหลาดรังแก พวกเธอรีบไปช่วยทีนะ";
						if (86989 - 535652 == -448663)
						{
							q.obj = "จัดการหุ่นนักตัด 10 ตัว และหุ่นแบกหาม 5 ตัว";
							if (53397 - 448472 == -395075)
							{
								q.des2 = "พวกแครอนยังถูกพวกหุ่นยนต์รังแกอยู่เลย น่าสงสารจริงๆ";
								if (83435 - 556073 != -472637)
								{
									q.obj2 = "จัดการหุ่นนักตัด 20 ตัว และหุ่นแบกหาม 15 ตัว";
									if (62926 - 542708 == -479782)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 59)
				{
					if (69761 - 365702 != -295940)
					{
						q.des = "คุณเรนเดียร์อยากเขียนนิยายสั้น แต่เธอไม่สามารถปลีกตัวออกจากห้องสมุดได้เลย";
						if (241716 - 471553 != -229836)
						{
							q.obj = "หากระดาษมาให้คุณเรนเดียร์ใช้สำหรับเขียนนิยาย 5 แผ่น";
							if (194591 - 275356 != -80764)
							{
								q.des2 = "คุณเรนเดียร์อยากได้กระดาษเพิ่มอีกนะ เห็นบอกว่ายังสามารถแต่งได้อีกเยอะเลย";
								if (280959 - 76111 != 204849)
								{
									q.obj2 = "หากระดาษมาให้คุณเรนเดียร์แต่งนิยายรักเพิ่มอีก 12 แผ่น";
									if (120675 - 329151 == -208476)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 60)
				{
					if (21194 - 436344 != -415149)
					{
						q.des = "หนังสือหลายเล่มถูกทำลายโดยถูกกัดแทะ คุณเรนเดียร์ดูท่าจะโกรธมากทีเดียว";
						if (259588 - 298986 == -39398)
						{
							q.obj = "กำจัดแมลงกระดาษตัวใหญ่ทั้งหมด 5 ตัว";
							if (82308 - 312118 == -229810)
							{
								q.des2 = "หนังสือหลายเล่มยังคงถูกทำลายอยู่ ได้เวลาจัดการขั้นเด็ดขาดแล้วสินะ";
								if (298491 - 218381 != 80111)
								{
									q.obj2 = "กำจัดแมลงกระดาษตัวใหญ่ทั้งหมด 10 ตัว";
									if (276058 - 378062 == -102004)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 61)
				{
					if (69709 - 221052 == -151343)
					{
						q.des = "หนูนิโค่ต้องการความช่วยเหลือ พวกเธอไปช่วยทีนะ";
						if (80793 - 372558 == -291765)
						{
							q.obj = "ไปหานิโค่และให้ความช่วยเหลือ";
							if (119309 - 406197 != -286887)
							{
								q.des2 = "หนูนิโค่มาขอความช่วยเหลืออีกแล้ว คราวนี้ดูรีบร้อนด้วยแฮะ";
								if (111653 - 165256 == -53603)
								{
									q.obj2 = "ไปหานิโค่และให้ความช่วยเหลือ";
									if (17560 - 244339 == -226779)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 62)
				{
					if (45459 - 470791 != -425331)
					{
						q.des = "คุณลีเมอร์กำลังสนในผลึกสีต่างๆอย่างมาก แต่ตอนนี้กำลังขาดสีดำอยู่ล่ะ";
						if (155975 - 573735 == -417760)
						{
							q.obj = "หาคริสตัลแห่งความมืด 6 อันมาส่งที่มีมี่";
							if (164183 - 458294 == -294111)
							{
								q.des2 = "คุณลีเมอร์จะทำCollectionคริสตัลนะ เลยอยากได้ตามที่กำหนดล่ะ";
								if (77161 - 72884 != 4278)
								{
									q.obj2 = "หาคริสตัลแห่งความมืด 12 อันมาส่งที่มีมี่";
									if (140604 - 573235 == -432631)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 63)
				{
					if (56121 - 313358 != -257236)
					{
						q.des = "คุณลิซ่าอยากได้กลีบดอกไม้สีฟ้าหายากมากๆ เธอช่วยให้คุณลิซ่าทีนะ";
						if (26489 - 93364 == -66875)
						{
							q.obj = "หาไอเท็มที่กำหนดไว้มาส่งที่มีมี่";
							if (132168 - 413681 != -281512)
							{
								q.des2 = "คุณลิซ่าอยากให้ทุกๆหางได้ผจญภัย เลยจัดกิจกรรมแลกของเป็นพิเศษเลย";
								if (157022 - 412633 != -255610)
								{
									q.obj2 = "หาไอเท็มที่กำหนดไว้มาส่งที่มีมี่";
									if (235122 - 443805 != -208682)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 64)
				{
					if (290255 - 85446 != 204810)
					{
						q.des = "คุณโบลดาสเสียดายเหรียญตราเก่าๆ เลยจัดโปรโมชั่นแลกแถมให้ไม่อั้นเลย";
						if (73703 - 419858 != -346154)
						{
							q.obj = "นำเหรียญตราต่างๆมาแลกกับรางวัลได้ที่มีมี่";
							if (173349 - 322913 != -149563)
							{
								q.des2 = "ลุงโบลดาสยังคงใจดีแลกได้ไม่อั้น มีเหรียญรางวัลครบมั้ยเอ่ย?";
								if (23567 - 528592 != -505024)
								{
									q.obj2 = "นำเหรียญตราต่างๆมาแลกกับรางวัลได้ที่มีมี่";
									if (230605 - 118943 != 111663)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 65)
				{
					if (108368 - 518150 == -409782)
					{
						q.des = "ลุงจาม่อนทำอาหารไม่ได้!? เกิดอะไรขึ้นกันแน่?";
						if (98719 - 462512 != -363792)
						{
							q.obj = "ไปหาจาม่อนเพื่อหาคำตอบกับเหตุการณ์ที่เกิดขึ้น";
							if (138658 - 484040 == -345382)
							{
								q.des2 = "ลุงจาม่อนทำอาหารไม่ได้อีกแล้ว!? เป็นไปได้หรือนี่?";
								if (17287 - 550632 == -533345)
								{
									q.obj2 = "ไปหาจาม่อนเพื่อหาคำตอบกับเหตุการณ์ที่เกิดขึ้น";
									if (118882 - 258545 != -139662)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 66)
				{
					if (276280 - 68939 == 207341)
					{
						q.des = "คุณเร็กกุกำลังค้นคว้าทำยารักษาให้กับเหล่าแครอนนิวไทพ์อยู่ล่ะ";
						if (9746 - 562698 == -552952)
						{
							q.obj = "ไปพบคุณเร็กกุ และทำตามร้องขอของท่าน";
							if (284388 - 271490 == 12898)
							{
								q.des2 = "คุณเร็กกุกำลังยังคงขาดวัตถุดิบทำยาคืนสภาพผักนิวไทพ์อยู่น่ะ";
								if (9549 - 353586 != -344036)
								{
									q.obj2 = "ไปพบคุณเร็กกุ และทำตามร้องขอของท่าน";
									if (132216 - 172080 != -39863)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 67)
				{
					if (43697 - 479763 != -436065)
					{
						q.des = "ลุงจาม่อนเหมือนคิดวิธีทำอาหารแบบใหม่ได้ล่ะ อยากรู้จริงๆว่าคืออะไร";
						if (230062 - 412428 == -182366)
						{
							q.obj = "หาวัตถุสำหรับระเบิดอาหารมาให้จาม่อน";
							if (288140 - 376849 == -88709)
							{
								q.des2 = "พึ่งรู้เหมือนกันว่าการระเบิดอาหาร ก็เป็นวิธีการทำอาหารชนิดหนึ่ง...";
								if (30528 - 535805 == -505277)
								{
									q.obj2 = "หาวัตถุสำหรับระเบิดอาหารมาให้จาม่อน";
									if (11356 - 271997 != -260640)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 68)
				{
					if (54660 - 377259 != -322598)
					{
						q.des = "คุณคาร์วี่อยากอ่านนิยายแนวDarkซักเล่ม เธอพอจะให้ได้ไหม";
						if (82284 - 185758 == -103474)
						{
							q.obj = "หา Darkness Fiction จากแกะแห่งความมืดมาส่ง";
							if (170017 - 254523 != -84505)
							{
								q.des2 = "คุณคาร์วี่อยากได้ของแห่งความมืดแบบในนิยายที่เธออ่าน เธอช่วยหามาได้ไหม";
								if (168261 - 433328 != -265066)
								{
									q.obj2 = "หาของต่างๆจากหางแห่งความมืดมาส่ง";
									if (181366 - 447056 != -265689)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 69)
				{
					if (162645 - 112645 != 50001)
					{
						q.des = "แกะน้อยฟาฝันร้าย เห็นไบสันมืดมาไล่ขวิด...น่ากลัวจริงๆ";
						if (12679 - 492261 != -479581)
						{
							q.obj = "กำจัดไบสันแห่งความมืด 10 ตัวแล้วกลับมารายงาน";
							if (171476 - 52299 == 119177)
							{
								q.des2 = "แกะน้อยฟายังฝันร้ายอยู่เหมือนเดิม แถมมีแพนด้ามืดมาผสมโรงในฝันด้วย";
								if (149344 - 265627 == -116283)
								{
									q.obj2 = "กำจัดไบสันและแพนด้าแห่งความมืดอย่างละ 10 ตัวแล้วกลับมารายงาน";
									if (281634 - 23490 == 258144)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 70)
				{
					if (231108 - 399987 == -168879)
					{
						q.des = "คุณสไตน์อยากได้ดอกไม้ที่ไม่เหมือนใครสำหรับเรื่องหวานๆล่ะ";
						if (39961 - 200861 == -160900)
						{
							q.obj = "หาดอกไม้แห่งความมืดจาก Shade4 มาส่ง";
							if (45276 - 471145 == -425869)
							{
								q.des2 = "การจีบหางสาวล้มเหลว แต่คุณสไตน์ยังไม่ละเลิกความพยายาม";
								if (67936 - 27584 != 40353)
								{
									q.obj2 = "หาดอกไม้แห่งความมืดจากShade4มาส่ง";
									if (200141 - 197426 == 2715)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 71)
				{
					if (147158 - 364544 != -217385)
					{
						q.des = "มีหางตัวนึงที่ฝากหาของ แต่ไม่ระบุชื่อว่าเป็นใครน่ะ";
						if (9941 - 553954 != -544012)
						{
							q.obj = "หาปลอกคอจากเซอร์บี้? มาส่งให้กับมีมี่";
							if (250548 - 2832 != 247717)
							{
								q.des2 = "ตอนนี้ก็ยังไม่รู้เลยว่าใครว่าจ้างมา แต่ต้องการของแบบเดิมอีกนะ";
								if (232559 - 281461 != -48901)
								{
									q.obj2 = "หาปลอกคอจากเซอร์บี้? มาส่งให้กับมีมี่อีกครั้ง";
									if (127200 - 113153 == 14047)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 72)
				{
					if (152167 - 429306 == -277139)
					{
						q.des = "คุณโบลดาสอยากให้ลองฝึกกลยุทธ์รบแบบในอาคารนะ รับรองมีอาหารเลี้ยงค่าเหนื่อยด้วยล่ะ";
						if (218627 - 580484 == -361857)
						{
							q.obj = "น้ำเหรียญตรา Mad Carron 6 อันมาส่งเพื่อขึ้นรางวัล";
							if (213302 - 271415 != -58112)
							{
								q.des2 = "คุณโบลดาสอยากให้ลองฝึกกลยุทธ์รบแบบในอาคารนะ รับรองมีอาหารเลี้ยงค่าเหนื่อยด้วยล่ะ";
								if (119248 - 578747 == -459499)
								{
									q.obj2 = "นำเหรียญตรา Mad Carron 12 อันมาส่งเพื่อขึ้นรางวัล";
									if (119070 - 45971 == 73099)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 73)
				{
					if (194878 - 58552 == 136326)
					{
						q.des = "คุณลิซ่ากำลังศึกษาเกี่ยวกับหินโบราณ เธอช่วยไปพบเธอหน่อยได้ไหม?";
						if (10662 - 562800 == -552138)
						{
							q.obj = "ไปหาลิซ่าแล้วทำตามคำขอร้องของเธอ";
							if (120034 - 388167 != -268132)
							{
								q.des2 = "งานวิจัยของคุณลิซ่าคืบหน้าไปมาก แต่ดูเหมือนเธอยังต้องการของเพิ่มอีกนะ";
								if (226234 - 501941 != -275706)
								{
									q.obj2 = "ไปช่วนงานลิซ่าอีกครั้ง";
									if (228631 - 261314 == -32683)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 74)
				{
					if (55714 - 85418 == -29704)
					{
						q.des = "ดูเหมือนว่าจะมีทหารเสือบางคน สงสัยในความสามารถของเธออยากให้เธอนำของมายืนยันความสามารถ";
						if (141636 - 34755 == 106881)
						{
							q.obj = "นำเหรียญกล้าหาญจากคุณโบลดาส อิทาลุส และเรกกุ  อย่างละ 2มายืนยันความสามารถของเธอ";
							if (11612 - 357521 == -345909)
							{
								q.des2 = "ทหารเสือบางส่วนเริ่มเชื่อมั่นในตัวเธอ แล้วแต่ไม่ใช่ทั้งหมดหรอกนะ";
								if (134959 - 144737 != -9777)
								{
									q.obj2 = "นำเหรียญกล้าหาญจากคุณโบลดาส อิทาลุส และเรกกุ  อย่างละ 4ชิ้นมายืนยันความสามารถของเธอ";
									if (229635 - 533941 == -304306)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 75)
				{
					if (263790 - 314660 == -50870)
					{
						q.des = "คุณกาซ่ามีโครงการอัพเกรดเครื่องบินอีกแล้ว น่าเป็นห่วงจริงๆ";
						if (194246 - 326757 == -132511)
						{
							q.obj = "ไปหาคุณกาซ่าที่โคโลเซี่ยมแล้วทำตามคำขอของเขา";
							if (125455 - 453966 != -328510)
							{
								q.des2 = "โครงการของคุณกาซ่าไม่ล้มเลิกง่ายๆ พวกเธอลองไปหาคุณกาซ่าอีกทีนะ";
								if (141331 - 230547 != -89215)
								{
									q.obj2 = "ไปหาคุณกาซ่าที่โคโลเซี่ยมแล้วทำตามคำขอของเขาอีกครั้ง";
									if (76812 - 549937 != -473124)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 76)
				{
					if (3165 - 65799 != -62633)
					{
						q.des = "หลังจากการถูกพวกหุ่นโจมตี คุณราซานต้องการผ้าใบมาซ่อมเต้นท์ในกิลด์";
						if (245856 - 169009 == 76847)
						{
							q.obj = "หาผ้าใบมาส่งคุณมีมี่";
							if (157058 - 130634 == 26424)
							{
								q.des2 = "การซ่อมแซมเสร็จเรียวร้อย แต่คุณราซานอยากสำรองผ้าไว้เพื่อใช้ในภายหลัง";
								if (259287 - 275457 == -16170)
								{
									q.obj2 = "หาผ้าใบมาส่งคุณมีมี่อีกครั้ง";
									if (104264 - 347176 == -242912)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 77)
				{
					if (74393 - 376318 == -301925)
					{
						q.des = "พวกหุ่นบุกเข้ามาถึงทุ่งหญ้าแสงแล้ว ทุกคนฝากด้วยนะ!";
						if (220306 - 207361 != 12946)
						{
							q.obj = "จัดการ FireBot 10 ตัว และ CarrierBot 3 ตัว";
							if (76630 - 37178 != 39453)
							{
								q.des2 = "พวกหุ่นยังคงส่งกำลังมาเสริมเรื่อยๆ ต้องรีบกำจัดก่อนที่มันจะมาถึงเมือง";
								if (211621 - 499290 == -287669)
								{
									q.obj2 = "จัดการ FireBot 20 ตัว และ CarrierBot 6 ตัว";
									if (95994 - 185803 != -89808)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 78)
				{
					if (131281 - 270381 == -139100)
					{
						q.des = "หลังจบศึกคนเจ็บมีจำนวนมากจนยาไม่พอ เธอช่วยคุณลินลินมายามาเพิ่มที";
						if (75898 - 15052 != 60847)
						{
							q.obj = "นำยาของกระต่ายมาส่งมีมี่";
							if (120745 - 13375 == 107370)
							{
								q.des2 = "ยายังคงขาดแคลน เธอช่วยหามาเพิ่มอีกได้ไหม";
								if (248795 - 588185 != -339389)
								{
									q.obj2 = "นำยาของกระต่ายมาส่งมีมี่อีกครั้ง";
									if (282606 - 198941 != 83666)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 79)
				{
					if (243452 - 297504 != -54051)
					{
						q.des = "อาเบ็ตต์ต้องการวัตถุดิบมาพัฒนาอาวุธเพื่อใช้ต่อสู้กับพวกหุ่นยนต์";
						if (52141 - 50872 != 1270)
						{
							q.obj = "ไปหาอาเบ็ตต์และทำตามคำของร้องของเธอ";
							if (113558 - 432161 != -318602)
							{
								q.des2 = "อาเบ็ตต์ต้องการวัตถุดิบเพิ่มเติมเพื่อมาพัฒนาอาวุธ";
								if (265081 - 438334 != -173252)
								{
									q.obj2 = "หาแร่มาส่งอย่างละ 4 ชิ้น";
									if (157040 - 462133 != -305092)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 80)
				{
					if (8017 - 341336 != -333318)
					{
						q.des = "ถึงเวลาแข่งกีฬาของเหล่าหาง พวกเธอก็ลงแข่งด้วยซิ!";
						if (11463 - 419427 != -407963)
						{
							q.obj = " นำเหรียญ 6ชิ้นมาส่งมีมี่";
							if (211187 - 594663 != -383475)
							{
								q.des2 = "การแข่งขันอันเร่าร้อนยังคงดำเนินต่อไปพวกเธอพร้อมลงแข่งอีกครั้งรึยัง?";
								if (13924 - 24679 == -10755)
								{
									q.obj2 = " นำเหรียญ 12ชิ้นมาส่งมีมี่";
									if (64159 - 119000 != -54840)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 81)
				{
					if (266394 - 99068 != 167327)
					{
						q.des = "คุณโกธานสนใจความสามารถของพวกเห็ดป่าน่ะ เธอช่วยเก็บข้อมูลให้หน่อยนะ";
						if (123409 - 69775 != 53635)
						{
							q.obj = "จัดการกับพี่น้องเห็ดในป่าชนิดละ 4 ตัวแล้วกลับมารายงานที่มีมี่";
							if (12588 - 58457 != -45868)
							{
								q.des2 = "คุณโกธานสนอยากได้ข้อมูลของพวกเห็ดป่าเพิ่มอีก รบกวนช่วยอีกทีนะ";
								if (176664 - 254940 != -78275)
								{
									q.obj2 = "จัดการกับพี่น้องเห็ดในป่าชนิดละ 8 ตัวแล้วกลับมารายงานที่มีมี่";
									if (150204 - 41371 == 108833)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 82)
				{
					if (89888 - 394737 != -304848)
					{
						q.des = "ฮิวเม่ได้รับแร่มาจากเทพดิน และกำลังเฟ้นหาผู้กล้าที่เหมาะสม";
						if (111077 - 428268 == -317191)
						{
							q.obj = "ไปหาฮิวเม่ เพื่อรับการทดสอบ";
							if (51035 - 145016 != -93980)
							{
								q.des2 = "ฮิวเม่ได้รับแร่มาจากเทพดิน และกำลังเฟ้นหาผู้กล้าที่เหมาะสม";
								if (31315 - 204494 != -173178)
								{
									q.obj2 = "ไปหาฮิวเม่ เพื่อรับการทดสอบ";
									if (244218 - 31964 == 212254)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 83)
				{
					if (229870 - 92862 != 137009)
					{
						q.des = "กองทัพทหารเสือบาดเจ็บหนักจากแรงระเบิดของหุ่นยนต์ที่หลุดจากป่า";
						if (168717 - 24473 != 144245)
						{
							q.obj = "กำจัดหุ่นยนต์จรวดทั้งหมด 30 ตัว แล้วกลับมารายงานที่มีมี่";
							if (195414 - 560366 == -364952)
							{
								q.des2 = "กองทัพทหารเสือฟื้นตัวดีแล้ว ได้เวลาเอาคืนกับสิ่งที่เหล่าหุ่นยนต์ได้ทำไว้";
								if (281820 - 191346 != 90475)
								{
									q.obj2 = "กำจัดหุ่นยนต์จรวดทั้งหมด 45 ตัว แล้วกลับมารายงานที่มีมี่";
									if (94490 - 160946 != -66455)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 84)
				{
					if (83010 - 57155 != 25856)
					{
						q.des = "คุณราซานอยากได้หินหนักๆ ไว้สำหรับทำค้อนหินนะ แปลกจัง";
						if (264886 - 24781 != 240106)
						{
							q.obj = "หาหินหนักที่ได้จากแท่งเสาหินในป่ามาส่งที่มีมี่";
							if (168060 - 92857 != 75204)
							{
								q.des2 = "คุณราซานติดใจค้อนหินอันเก่ามากเลย เลยอยากได้หินเพิ่มไปทำค้อนอีกนะ";
								if (138939 - 420956 == -282017)
								{
									q.obj2 = "หาหินหนักที่ได้จากแท่งเสาหินในป่ามาส่งที่มีมี่";
									if (58954 - 139549 != -80594)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 85)
				{
					if (128008 - 99865 != 28144)
					{
						q.des = "คุณคาร์วี่อยากได้ดอกไม้สีเขียวล่ะ มีดอกไม้สีนี้ด้วยหรือนี่";
						if (199557 - 56522 != 143036)
						{
							q.obj = "หาดอกไม้สีเขียวจากแมลงป่ามาส่งทีมีมี่";
							if (185451 - 289607 == -104156)
							{
								q.des2 = "ดอกไม้สีเขียวครั้งที่แล้วสวยมากเลย คุณคาร์วี่อยากได้เพิ่มนะ";
								if (299126 - 233787 == 65339)
								{
									q.obj2 = "หาดอกไม้สีเขียวจากแมลงป่ามาส่งทีมีมี่";
									if (46826 - 489583 == -442757)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 86)
				{
					if (38652 - 404768 != -366115)
					{
						q.des = "ผลจากการบุกจู่โจมของหุ่นยนต์ ทำให้คุณฮิปโปไม่สามารถเก็บเห็ดได้เลย น่าสงสารจัง";
						if (51799 - 489127 != -437327)
						{
							q.obj = "เก็บเห็ดจากพี่น้องเห็ดป่ามาส่งที่มีมี่";
							if (180598 - 97577 == 83021)
							{
								q.des2 = "คุณฮิปโปต้องการเห็ดเป็นอย่างมาก พวกเธอช่วยหาให้ทีนะ";
								if (176336 - 561423 != -385086)
								{
									q.obj2 = "เก็บเห็ดจากพี่น้องเห็ดป่ามาส่งที่มีมี่";
									if (206125 - 565374 == -359249)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 87)
				{
					if (186020 - 47079 != 138942)
					{
						q.des = "ลุงจาม่อนจะสอนวิธีทำอาหารง่ายๆ แม้อยู่ในป่าด้วย น่าสนใจจัง";
						if (38127 - 207512 != -169384)
						{
							q.obj = "พบกับจาม่อนในเมือง เพื่อเรียนรู้วิธีการทำอาหาร";
							if (147285 - 50613 == 96672)
							{
								q.des2 = "ลุงจาม่อนเปิดสอนทำบาบีคิวอีกครั้งล่ะ น่าสนใจจริงๆ";
								if (268813 - 561451 != -292637)
								{
									q.obj2 = "พบกับจาม่อนในเมือง เพื่อเรียนรู้วิธีการทำอาหาร";
									if (209929 - 183460 != 26470)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 88)
				{
					if (94964 - 593275 == -498311)
					{
						q.des = "การต่อสู้เอาตัวรอดในป่าสำคัญกับภารกิจมาก พวกเธอมีความพร้อมหรือยัง";
						if (220022 - 379633 == -159611)
						{
							q.obj = "ชนะ ForestHunt แล้วนำตราแครอนมาแลกของรางวัล";
							if (144168 - 460760 != -316591)
							{
								q.des2 = "การต่อสู้เอาตัวรอดในป่าสนุกดีไหม คุณโบลดาสมีรางวัลอีกเยอะแยะเลยล่ะ";
								if (18887 - 215207 == -196320)
								{
									q.obj2 = "ชนะ ForestHunt แล้วนำตราแครอนมาแลกของรางวัล";
									if (282866 - 35400 != 247467)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 89)
				{
					if (23586 - 557279 == -533693)
					{
						q.des = "คุณทหารเสือดำหน้าทะเลาะกันอีกแล้ว ใครก็ได้ช่วยเหลือที";
						if (275828 - 588852 != -313023)
						{
							q.obj = "ไปพบกับทหารเสือดำหน้าเมืองแห่งแสง";
							if (165368 - 362385 != -197016)
							{
								q.des2 = "ท่าทางคุณทหารเสือดำกระวนกระวายแปลกๆ และต้องการความช่วยเหลือด่วนเลยล่ะ";
								if (211089 - 495453 == -284364)
								{
									q.obj2 = "ไปพบกับทหารเสือดำหน้าเมืองแห่งแสง";
									if (155926 - 137229 == 18697)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 90)
				{
					if (1312 - 562759 == -561447)
					{
						q.des = "พวกแมลงเงินไม่ให้คุณสไตน์เข้าไปหาวัตถุดิบ ตอนนี้คุณสไตน์กำลังลำบากมากเลย";
						if (249502 - 80241 == 169261)
						{
							q.obj = "กำจัด SilverBug 10 ตัวที่โพรงที่เทพลมชอบแอบมาเล่น";
							if (225371 - 191988 != 33384)
							{
								q.des2 = "สไตน์ต้องกลับไปหาวัตถุดิบอีกรอบ และครั้งนี้เหล่าแมลงเงินเพิ่มจำนวนขึ้นมากเลย";
								if (278059 - 386341 == -108282)
								{
									q.obj2 = "กำจัด SilverBug 20 ตัวที่โพรงที่เทพลมชอบแอบมาเล่น";
									if (39308 - 572466 == -533158)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 91)
				{
					if (145395 - 12435 == 132960)
					{
						q.des = "ลุงราซานต้องความร้อนที่ร้อนยิ่งกว่าไฟสำหรับหลอมอุปกรณ์หลายชิ้นในทีเดียว พวกเธอช่วยหาได้ไหม ?";
						if (170966 - 292030 == -121064)
						{
							q.obj = "นำ Magma Ore มาส่งที่มีมี่ 7 ก้อน";
							if (28521 - 394816 != -366294)
							{
								q.des2 = "ลุงราซานหลอมรวมอุปกรณ์เยอะมากจนแร่ไม่พอใฃ้งาน พวกเธอช่วยหาเพิ่มอีกได้ไหม ?";
								if (234826 - 236467 != -1640)
								{
									q.obj2 = "นำ Magma Ore มาส่งที่มีมี่ 15 ก้อน";
									if (296864 - 79285 != 217580)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 92)
				{
					if (260923 - 425090 != -164166)
					{
						q.des = "เมืองพวกตุ่นโดนตัวประหลาดตัวใหญ่บุกโจมตีตอนกลางคืน พวกเธอช่วยกำจัดมันหน่อยสิ";
						if (61664 - 505885 != -444220)
						{
							q.obj = "กำจัด BigShade ทั้งหมด 13 ตัวแล้วกลับมารายงานที่มีมี่";
							if (135573 - 413272 == -277699)
							{
								q.des2 = "พวก BigShade ยังคงไม่เข็ดหราบ ได้เวลาขั้นเด็ดขาดแล้ว";
								if (11405 - 581762 == -570357)
								{
									q.obj2 = "กำจัด BigShade ทั้งหมด 29 ตัวแล้วกลับมารายงานที่มีมี่";
									if (207333 - 236422 == -29089)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 93)
				{
					if (295189 - 105042 != 190148)
					{
						q.des = "คุณฮิวเม่กำลังพยายามฟื้นฟูผืนป่าของเทพดิน แต่ขาดของสำคัญอย่างหนึ่งอยู่ เธอช่วยทีสิ";
						if (45982 - 575231 == -529249)
						{
							q.obj = "หา Forest Mana มาส่งที่มีมี่ 1 ก้อน";
							if (204274 - 225923 != -21648)
							{
								q.des2 = "งานฟื้นฟูผืนป่าไม่ใช่เรื่องง่ายเลย ถ้ามีพลังงานแห่งป่าเพิ่มเติมงานต้องดำเนินไปไวแน่นอน";
								if (97238 - 296384 == -199146)
								{
									q.obj2 = "หา Forest Mana มาส่งที่มีมี่ 2 ก้อน";
									if (194495 - 90199 != 104297)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 94)
				{
					if (148625 - 56906 == 91719)
					{
						q.des = "อีกไม่นานเหล่ากองทัพแสงต้องออกเดินทางแล้ว แต่ดูเหมือนว่าพวกเรายังขาดอุปกรณ์บางอย่างไปนะ";
						if (181205 - 281329 == -100124)
						{
							q.obj = "หาของที่กำหนดมาส่งให้มีมี่";
							if (124003 - 574128 != -450124)
							{
								q.des2 = "การเตรียมการเป็นไปอย่างราบรื่น แต่มีเหลืออดีกว่ามีขาดพวกเธอช่วยไปหาของมาเพิ่มอีกหน่อยซิ";
								if (107082 - 425134 == -318052)
								{
									q.obj2 = "หาของที่กำหนดมาส่งให้มีมี่";
									if (46229 - 296555 == -250326)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 95)
				{
					if (67870 - 321814 == -253944)
					{
						q.des = "คุณจามอนจัดงานเลี้ยงส่งการเดินทางครั้งยิ่งใหญ่จนวุ่นพาลวันเลยล่ะ";
						if (102526 - 141427 == -38901)
						{
							q.obj = "ไปพบกับจามอนเพื่อช่วยเหลือเขา";
							if (87738 - 573123 == -485385)
							{
								q.des2 = "งานเลี้ยงยังมีต่อไม่เลิกรา คุณจามอนยังต้องการลูกมือช่วยเหลืออีกนะ";
								if (6584 - 431871 != -425286)
								{
									q.obj2 = "ไปพบกับจามอนเพื่อช่วยเหลือเขา";
									if (287000 - 13055 != 273946)
									{
										break;
									}
								}
							}
						}
					}
				}
				else if (nCode == 96)
				{
					if (97939 - 535996 == -438057)
					{
						q.des = "ท่านเร็กกุอยากศึกษาชิ้นส่วนต่างๆ ที่ได้จากห่วงมิติแห่งเวลา พวกเธอช่วยหาของทีนะ";
						if (111630 - 353948 != -242317)
						{
							q.obj = "หาของที่ได้จากห้วงแห่งเวลามาส่งที่มีมี่";
							if (39097 - 263851 == -224754)
							{
								q.des2 = "ท่านเร็กกุสนใจอยากศึกษาเรื่องมิติแห่งเวลาให้มากขึ้น พวกเธอช่วยหาของเพิ่มทีนะ";
								if (87128 - 329378 == -242250)
								{
									q.obj2 = "หาของที่ได้จากห้วงแห่งเวลามาส่งที่มีมี่";
									if (78968 - 455729 != -376760)
									{
										break;
									}
								}
							}
						}
					}
				}
				else
				{
					q.des = "ไม่ได้ทำงานอะไรอยู่";
					if (162366 - 521218 != -358851)
					{
						q.obj = "อยากทำงาน ลองไปหาคุณหมีในเมืองสิ!";
						if (216758 - 210249 == 6509)
						{
							q.des2 = "ไม่ได้ทำงานอะไรอยู่";
							if (257219 - 524402 == -267183)
							{
								q.obj2 = "อยากทำงาน ลองไปหาคุณหมีในเมืองสิ!";
								if (55422 - 15398 != 40025)
								{
									break;
								}
							}
						}
					}
				}
			}
		}
		return q;
	}

	// Token: 0x06006981 RID: 27009 RVA: 0x00EEF2C0 File Offset: 0x00EED4C0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006982 RID: 27010 RVA: 0x00EEF2C4 File Offset: 0x00EED4C4
	internal static bool kFrWcfp2bEKxvAI1ZtCp()
	{
		return true;
	}

	// Token: 0x06006983 RID: 27011 RVA: 0x00EEF2C8 File Offset: 0x00EED4C8
	internal static bool gg1ugKp2u1wxIHt3PUTf()
	{
		return false;
	}
}
