using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001164 RID: 4452
[Serializable]
public class RecipeData_th : MonoBehaviour
{
	// Token: 0x060066F5 RID: 26357 RVA: 0x00E91BC8 File Offset: 0x00E8FDC8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public RecipeData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066F6 RID: 26358 RVA: 0x00E91BD8 File Offset: 0x00E8FDD8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (158114 - 374677 != -216562)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (115367 - 303599 != -188231)
			{
				if (83269 - 429554 == -346285)
				{
					if (nCode == "r_rnw1")
					{
						if (261129 - 551513 != -290383)
						{
							result = "สูตรล้างของใช้แล้วที่เลเวลต่ำกว่า 30 ให้กลายเป็นของใหม่";
							if (180707 - 526715 != -346007)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rnw2")
					{
						if (143113 - 151636 != -8522)
						{
							result = "สูตรล้างของใช้แล้วที่เลเวลต่ำกว่า 60 ให้กลายเป็นของใหม่";
							if (7886 - 300968 != -293081)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rnw3")
					{
						if (112217 - 331509 != -219291)
						{
							result = "สูตรล้างของใช้แล้วที่เลเวลต่ำกว่า 90 ให้กลายเป็นของใหม่";
							if (37456 - 195611 != -158154)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rnw4")
					{
						if (21552 - 431361 != -409808)
						{
							result = "สูตรล้างของใช้แล้วที่เลเวลต่ำกว่า 120 ให้กลายเป็นของใหม่";
							if (86926 - 284588 != -197661)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rsl1")
					{
						if (92849 - 260849 == -168000)
						{
							result = "สูตรล้างสล๊อตของอาวุธหรือ เครื่องป้องกันที่เลเวลต่ำกว่า 30";
							if (125351 - 594165 != -468813)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rsl2")
					{
						if (238347 - 65007 == 173340)
						{
							result = "สูตรล้างสล๊อตของอาวุธหรือ เครื่องป้องกันที่เลเวลต่ำกว่า 60";
							if (238014 - 72468 == 165546)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rsl3")
					{
						if (61160 - 91510 == -30350)
						{
							result = "สูตรล้างสล๊อตของอาวุธหรือ เครื่องป้องกันที่เลเวลต่ำกว่า 90";
							if (289238 - 160423 != 128816)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rsl4")
					{
						if (184171 - 532504 != -348332)
						{
							result = "สูตรล้างสล๊อตของอาวุธหรือ เครื่องป้องกันที่เลเวลต่ำกว่า 120";
							if (66301 - 532802 != -466500)
							{
								break;
							}
						}
					}
					else if (nCode == "r_asl1")
					{
						if (102266 - 565169 == -462903)
						{
							result = "สูตรสุ่มตีเพิ่ม 1~3 slot ให้กับอาวุธ ที่เลเวลต่ำกว่า 30";
							if (7629 - 271171 == -263542)
							{
								break;
							}
						}
					}
					else if (nCode == "r_asl2")
					{
						if (5866 - 53356 == -47490)
						{
							result = "สูตรสุ่มตีเพิ่ม 1~3 slot ให้กับอาวุธ ที่เลเวลต่ำกว่า 60";
							if (278261 - 537122 == -258861)
							{
								break;
							}
						}
					}
					else if (nCode == "r_asl3")
					{
						if (19768 - 235362 == -215594)
						{
							result = "สูตรสุ่มตีเพิ่ม 1~3 slot ให้กับอาวุธ ที่เลเวลต่ำกว่า 90";
							if (98467 - 428016 == -329549)
							{
								break;
							}
						}
					}
					else if (nCode == "r_asl4")
					{
						if (199763 - 474342 == -274579)
						{
							result = "สูตรสุ่มตีเพิ่ม 1~3 slot ให้กับอาวุธ ที่เลเวลต่ำกว่า 120";
							if (27415 - 27318 == 97)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rpc1")
					{
						if (125339 - 199032 == -73693)
						{
							result = "สูตรทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 30";
							if (267075 - 108240 != 158836)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rpc2")
					{
						if (172255 - 180829 != -8573)
						{
							result = "สูตรทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 60";
							if (209342 - 480362 != -271019)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rpc3")
					{
						if (294530 - 193611 == 100919)
						{
							result = "สูตรทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 90";
							if (288010 - 389896 != -101885)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rpc4")
					{
						if (10548 - 511076 != -500527)
						{
							result = "สูตรทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 120";
							if (56578 - 137091 == -80513)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd1")
					{
						if (233811 - 472860 == -239049)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +1~3 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (145212 - 361504 != -216291)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd2")
					{
						if (61340 - 70981 != -9640)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +2~5 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (282279 - 9557 != 272723)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd3")
					{
						if (723 - 580766 != -580042)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +3~7 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (14883 - 533144 != -518260)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd4")
					{
						if (151478 - 56022 != 95457)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +4~9 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (2612 - 350661 != -348048)
							{
								break;
							}
						}
					}
					else if (nCode == "r_atk1")
					{
						if (245571 - 9885 == 235686)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (89876 - 568827 != -478950)
							{
								break;
							}
						}
					}
					else if (nCode == "r_atk2")
					{
						if (259439 - 73200 != 186240)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (294932 - 144798 != 150135)
							{
								break;
							}
						}
					}
					else if (nCode == "r_atk3")
					{
						if (71739 - 375364 == -303625)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (298842 - 295462 == 3380)
							{
								break;
							}
						}
					}
					else if (nCode == "r_atk4")
					{
						if (257146 - 145122 == 112024)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (178421 - 129025 == 49396)
							{
								break;
							}
						}
					}
					else if (nCode == "r_def1")
					{
						if (164373 - 42996 != 121378)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (79862 - 547935 != -468072)
							{
								break;
							}
						}
					}
					else if (nCode == "r_def2")
					{
						if (24393 - 226838 != -202444)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (5847 - 353140 == -347293)
							{
								break;
							}
						}
					}
					else if (nCode == "r_def3")
					{
						if (273662 - 16583 == 257079)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (121265 - 435958 == -314693)
							{
								break;
							}
						}
					}
					else if (nCode == "r_def4")
					{
						if (211548 - 10907 != 200642)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (118809 - 591678 == -472869)
							{
								break;
							}
						}
					}
					else if (nCode == "r_agi1")
					{
						if (38915 - 198892 == -159977)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (287644 - 299537 != -11892)
							{
								break;
							}
						}
					}
					else if (nCode == "r_agi2")
					{
						if (140986 - 101141 == 39845)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (118613 - 249610 != -130996)
							{
								break;
							}
						}
					}
					else if (nCode == "r_agi3")
					{
						if (288008 - 102820 != 185189)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (125482 - 444802 != -319319)
							{
								break;
							}
						}
					}
					else if (nCode == "r_agi4")
					{
						if (283825 - 14296 != 269530)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (188722 - 467219 == -278497)
							{
								break;
							}
						}
					}
					else if (nCode == "r_vit1")
					{
						if (185047 - 237525 != -52477)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (11500 - 500194 != -488693)
							{
								break;
							}
						}
					}
					else if (nCode == "r_vit2")
					{
						if (3935 - 327684 != -323748)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (35068 - 458078 != -423009)
							{
								break;
							}
						}
					}
					else if (nCode == "r_vit3")
					{
						if (281371 - 326480 != -45108)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (22146 - 127625 == -105479)
							{
								break;
							}
						}
					}
					else if (nCode == "r_vit4")
					{
						if (145368 - 224559 == -79191)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (16959 - 40473 == -23514)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mag1")
					{
						if (286914 - 144537 != 142378)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (175123 - 473674 != -298550)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mag2")
					{
						if (185468 - 322664 == -137196)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (281201 - 190809 == 90392)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mag3")
					{
						if (191447 - 539130 == -347683)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (94125 - 1829 == 92296)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mag4")
					{
						if (83339 - 356439 == -273100)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (6438 - 405729 == -399291)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cha1")
					{
						if (178358 - 260229 == -81871)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (13900 - 27290 != -13389)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cha2")
					{
						if (38229 - 483633 != -445403)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (188832 - 286562 == -97730)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cha3")
					{
						if (207718 - 21883 != 185836)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (37421 - 397810 != -360388)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cha4")
					{
						if (30077 - 266424 != -236346)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (243799 - 365990 != -122190)
							{
								break;
							}
						}
					}
					else if (nCode == "r_tal1")
					{
						if (248732 - 190201 == 58531)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (231088 - 43343 == 187745)
							{
								break;
							}
						}
					}
					else if (nCode == "r_tal2")
					{
						if (12977 - 223178 != -210200)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (253447 - 161805 == 91642)
							{
								break;
							}
						}
					}
					else if (nCode == "r_tal3")
					{
						if (65817 - 495899 == -430082)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (194744 - 487102 == -292358)
							{
								break;
							}
						}
					}
					else if (nCode == "r_tal4")
					{
						if (96072 - 311294 == -215222)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (13818 - 300567 == -286749)
							{
								break;
							}
						}
					}
					else if (nCode == "r_lck1")
					{
						if (297912 - 379352 == -81440)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (154445 - 457298 == -302853)
							{
								break;
							}
						}
					}
					else if (nCode == "r_lck2")
					{
						if (150597 - 211677 == -61080)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (174748 - 3134 != 171615)
							{
								break;
							}
						}
					}
					else if (nCode == "r_lck3")
					{
						if (143272 - 67546 == 75726)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (25055 - 290985 == -265930)
							{
								break;
							}
						}
					}
					else if (nCode == "r_lck4")
					{
						if (254227 - 451843 == -197616)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (282972 - 412039 == -129067)
							{
								break;
							}
						}
					}
					else if (nCode == "r_all1")
					{
						if (182944 - 409123 != -226178)
						{
							result = "สูตรตีอาวุธ Time Weapon 12 ชนิด";
							if (7286 - 293922 != -286635)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf1")
					{
						if (256173 - 234249 == 21924)
						{
							result = "สูตรตีอาวุธ Falchion และชุด Warrior ของหมาป่า";
							if (165518 - 317767 != -152248)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf2")
					{
						if (268943 - 356446 != -87502)
						{
							result = "สูตรตีอาวุธและชุด Soldier ของหมาป่า";
							if (124137 - 264927 == -140790)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf3")
					{
						if (28223 - 9182 != 19042)
						{
							result = "สูตรตีอาวุธและชุด Vagabond ของหมาป่า";
							if (178793 - 100634 != 78160)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf4")
					{
						if (122047 - 298318 != -176270)
						{
							result = "สูตรตีอาวุธและชุด Paladin ของหมาป่า";
							if (178898 - 516147 != -337248)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf5")
					{
						if (134774 - 382994 == -248220)
						{
							result = "สูตรตีอาวุธและชุด BladeMaster ของหมาป่า";
							if (4774 - 285570 == -280796)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf6")
					{
						if (291697 - 249614 == 42083)
						{
							result = "สูตรตีอาวุธและชุด Hero ของหมาป่า";
							if (97592 - 590265 == -492673)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf7")
					{
						if (41397 - 177268 == -135871)
						{
							result = "สูตรตีอาวุธและชุด Scorpion ของหมาป่า";
							if (147846 - 466544 != -318697)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf8")
					{
						if (292879 - 473604 == -180725)
						{
							result = "สูตรตีอาวุธและชุด Fenrir ของหมาป่า";
							if (190082 - 148942 != 41141)
							{
								break;
							}
						}
					}
					else if (nCode == "r_wlf9")
					{
						if (149085 - 291116 != -142030)
						{
							result = "สูตรตีอาวุธและชุด Pegasus ของหมาป่า";
							if (247578 - 257051 != -9472)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn1")
					{
						if (122749 - 360500 == -237751)
						{
							result = "สูตรตีอาวุธ Double Axe และชุด  Standard ของไบสัน";
							if (184588 - 29659 == 154929)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn2")
					{
						if (210666 - 113341 != 97326)
						{
							result = "สูตรตีอาวุธ Berserker Axe และชุด Destroyer ของไบสัน";
							if (17320 - 365472 != -348151)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn3")
					{
						if (125358 - 207861 != -82502)
						{
							result = "สูตรตีอาวุธ Defender Hammer และชุด Defender ของไบสัน";
							if (298312 - 195646 == 102666)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn4")
					{
						if (232951 - 155530 == 77421)
						{
							result = "สูตรตีอาวุธและชุด Gladiator ของไบสัน";
							if (179274 - 60541 == 118733)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn5")
					{
						if (90260 - 28832 == 61428)
						{
							result = "สูตรตีอาวุธและชุด Warlord ของไบสัน";
							if (243888 - 418332 == -174444)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn6")
					{
						if (191327 - 308341 == -117014)
						{
							result = "สูตรตีอาวุธและชุด Havoc ของไบสัน";
							if (90660 - 483124 == -392464)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn7")
					{
						if (195166 - 5214 != 189953)
						{
							result = "สูตรตีอาวุธและชุด Beetle ของไบสัน";
							if (184777 - 259523 == -74746)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn8")
					{
						if (172745 - 239778 == -67033)
						{
							result = "สูตรตีอาวุธและชุด  Minotaur ของไบสัน";
							if (159273 - 195242 == -35969)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bsn9")
					{
						if (186165 - 201764 != -15598)
						{
							result = "สูตรตีอาวุธและชุด Titan ของไบสัน";
							if (196519 - 511885 != -315365)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd1")
					{
						if (243807 - 538831 != -295023)
						{
							result = "สูตรตีอาวุธ Imp Gauntlet และชุด Panda's Standard ของแพนด้า";
							if (103270 - 551514 != -448243)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd2")
					{
						if (279924 - 175093 != 104832)
						{
							result = "สูตรตีอาวุธและชุด Brawler ของแพนด้า";
							if (241090 - 491259 != -250168)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd3")
					{
						if (222452 - 391261 != -168808)
						{
							result = "สูตรตีอาวุธและชุด Wuxian ของแพนด้า";
							if (209151 - 349342 == -140191)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd4")
					{
						if (100297 - 98251 == 2046)
						{
							result = "สูตรตีอาวุธและชุด Striker ของแพนด้า";
							if (29526 - 597454 == -567928)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd5")
					{
						if (149684 - 577724 == -428040)
						{
							result = "สูตรตีอาวุธและชุด Sage ของแพนด้า";
							if (139788 - 489681 != -349892)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd6")
					{
						if (288256 - 473375 == -185119)
						{
							result = "สูตรตีอาวุธ NinJitsu และชุด ShinJitsu ของแพนด้า";
							if (226610 - 527296 != -300685)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd7")
					{
						if (282177 - 479194 == -197017)
						{
							result = "สูตรตีอาวุธ และชุด Worm ของแพนด้า";
							if (75527 - 534511 == -458984)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd8")
					{
						if (245568 - 20086 == 225482)
						{
							result = "สูตรตีอาวุธและชุด Xian Mao ของแพนด้า";
							if (244717 - 247612 == -2895)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pnd9")
					{
						if (134445 - 135353 == -908)
						{
							result = "สูตรตีอาวุธและชุด Ogre ของแพนด้า";
							if (120708 - 459507 != -338798)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl1")
					{
						if (166588 - 527281 == -360693)
						{
							result = "สูตรตีอาวุธและชุด Standard ของปลาวาฬ";
							if (51725 - 369705 != -317979)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl2")
					{
						if (176746 - 392809 == -216063)
						{
							result = "สูตรตีอาวุธและชุด Lancer ของปลาวาฬ";
							if (194779 - 392749 == -197970)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl3")
					{
						if (170022 - 314332 == -144310)
						{
							result = "สูตรตีอาวุธและชุด Partisan ของปลาวาฬ";
							if (74181 - 1591 == 72590)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl4")
					{
						if (210551 - 534837 != -324285)
						{
							result = "สูตรตีอาวุธ Aqua Lance และชุด AquaKnight ของปลาวาฬ";
							if (143548 - 352115 == -208567)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl5")
					{
						if (252559 - 208383 == 44176)
						{
							result = "สูตรตีอาวุธและชุด Templar ของปลาวาฬ";
							if (132359 - 313110 != -180750)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl6")
					{
						if (141038 - 365257 == -224219)
						{
							result = "สูตรตีอาวุธและชุด Justice ของปลาวาฬ";
							if (34271 - 427167 == -392896)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl7")
					{
						if (119076 - 336940 == -217864)
						{
							result = "สูตรตีอาวุธและชุด LadyBug ของปลาวาฬ";
							if (237934 - 174969 != 62966)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl8")
					{
						if (184995 - 62352 == 122643)
						{
							result = "สูตรตีอาวุธและชุด  Liviathan ของวาฬ";
							if (233617 - 444515 != -210897)
							{
								break;
							}
						}
					}
					else if (nCode == "r_whl9")
					{
						if (78031 - 188594 != -110562)
						{
							result = "สูตรตีอาวุธและชุด Dragon ของวาฬ";
							if (112066 - 409421 == -297355)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat1")
					{
						if (48657 - 293707 != -245049)
						{
							result = "สูตรตีอาวุธและชุด Standard ของแมว";
							if (257147 - 508621 == -251474)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat2")
					{
						if (257622 - 280031 != -22408)
						{
							result = "สูตรตีอาวุธและชุด Adventurer ของแมว";
							if (239904 - 384692 == -144788)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat3")
					{
						if (126976 - 70976 != 56001)
						{
							result = "สูตรตีอาวุธและชุด Rogue Gear ของแมว";
							if (290136 - 170722 == 119414)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat4")
					{
						if (153395 - 516418 != -363022)
						{
							result = "สูตรตีอาวุธและชุด Gambler ของแมว";
							if (169945 - 140973 != 28973)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat5")
					{
						if (166629 - 127535 != 39095)
						{
							result = "สูตรตีอาวุธและชุด Assassin ของแมว";
							if (80021 - 179510 != -99488)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat6")
					{
						if (29169 - 61335 != -32165)
						{
							result = "สูตรตีอาวุธและชุด Pirate ของแมว";
							if (276174 - 496524 == -220350)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat7")
					{
						if (230151 - 280576 == -50425)
						{
							result = "สูตรตีอาวุธและชุด Dragonfly ของแมว";
							if (245803 - 147345 != 98459)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat8")
					{
						if (244928 - 10455 == 234473)
						{
							result = "สูตรตีอาวุธและชุด Muezza ของแมว";
							if (258816 - 18281 == 240535)
							{
								break;
							}
						}
					}
					else if (nCode == "r_cat9")
					{
						if (125832 - 254641 == -128809)
						{
							result = "สูตรตีอาวุธและชุด Sekhmet ของแมว";
							if (236665 - 391090 != -154424)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm1")
					{
						if (282375 - 362606 == -80231)
						{
							result = "สูตรตีอาวุธและชุด Standard ของกิ้งก่า";
							if (280328 - 415023 == -134695)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm2")
					{
						if (141246 - 76653 == 64593)
						{
							result = "สูตรตีอาวุธและชุด Tactician ของกิ้งก่า";
							if (226120 - 311333 != -85212)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm3")
					{
						if (62713 - 195643 != -132929)
						{
							result = "สูตรตีอาวุธและชุด Buster ของกิ้งก่า";
							if (289937 - 533583 != -243645)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm4")
					{
						if (79686 - 587989 != -508302)
						{
							result = "สูตรตีอาวุธและชุด Trickster ของกิ้งก่า";
							if (225599 - 298322 != -72722)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm5")
					{
						if (230153 - 68052 == 162101)
						{
							result = "สูตรตีอาวุธและชุด Slayer ของกิ้งก่า";
							if (158539 - 257862 != -99322)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm6")
					{
						if (100306 - 359965 != -259658)
						{
							result = "สูตรตีอาวุธและชุด Commander ของกิ้งก่า";
							if (218930 - 105032 == 113898)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm7")
					{
						if (142265 - 193503 != -51237)
						{
							result = "สูตรตีอาวุธและชุด Mantis ของกิ้งก่า";
							if (202778 - 540945 == -338167)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm8")
					{
						if (287976 - 49586 == 238390)
						{
							result = "สูตรตีอาวุธและชุด Draken ของกิ้งก่า";
							if (282006 - 562342 == -280336)
							{
								break;
							}
						}
					}
					else if (nCode == "r_chm9")
					{
						if (132933 - 399115 == -266182)
						{
							result = "สูตรตีอาวุธและชุด Hydra ของกิ้งก่า";
							if (102165 - 211183 != -109017)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab1")
					{
						if (96762 - 277563 == -180801)
						{
							result = "สูตรตีอาวุธ Standard และชุด Shooter ของกระต่าย";
							if (68772 - 582840 == -514068)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab2")
					{
						if (93350 - 22615 == 70735)
						{
							result = "สูตรตีอาวุธและชุด Nurse ของกระต่าย";
							if (186714 - 350125 == -163411)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab3")
					{
						if (166916 - 420669 == -253753)
						{
							result = "สูตรตีอาวุธและชุด Trader ของกระต่าย";
							if (201033 - 206543 != -5509)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab4")
					{
						if (138989 - 445706 != -306716)
						{
							result = "สูตรตีอาวุธและชุด Alchemist ของกระต่าย";
							if (107246 - 582961 == -475715)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab5")
					{
						if (170369 - 546115 != -375745)
						{
							result = "สูตรตีอาวุธและชุด Merchant ของกระต่าย";
							if (65495 - 396330 == -330835)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab6")
					{
						if (135014 - 215121 != -80106)
						{
							result = "สูตรตีอาวุธและชุด Magistrate ของกระต่าย";
							if (245783 - 39747 != 206037)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab7")
					{
						if (204545 - 369172 != -164626)
						{
							result = "สูตรตีอาวุธและชุด Ant ของกระต่าย";
							if (57687 - 456746 != -399058)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab8")
					{
						if (41984 - 456506 != -414521)
						{
							result = "สูตรตีอาวุธและชุด Hare Hare ของกระต่าย";
							if (243406 - 264555 != -21148)
							{
								break;
							}
						}
					}
					else if (nCode == "r_rab9")
					{
						if (16297 - 237489 == -221192)
						{
							result = "สูตรตีอาวุธและชุด Mermaid ของกระต่าย";
							if (164495 - 451567 != -287071)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol1")
					{
						if (14117 - 271744 != -257626)
						{
							result = "สูตรตีอาวุธและชุด Standard ของตุ่น";
							if (274521 - 433009 == -158488)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol2")
					{
						if (293935 - 403 != 293533)
						{
							result = "สูตรตีอาวุธและชุด Infantry ของตุ่น";
							if (174072 - 576846 == -402774)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol3")
					{
						if (77427 - 301930 == -224503)
						{
							result = "สูตรตีอาวุธและชุด Steam ของตุ่น";
							if (62 - 488321 == -488259)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol4")
					{
						if (25448 - 284200 == -258752)
						{
							result = "สูตรตีอาวุธและชุด Bomber ของตุ่น";
							if (15755 - 382585 != -366829)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol5")
					{
						if (200335 - 97201 == 103134)
						{
							result = "สูตรตีอาวุธและชุด Machinist ของตุ่น";
							if (156751 - 415536 != -258784)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol6")
					{
						if (153988 - 40308 != 113681)
						{
							result = "สูตรตีอาวุธและชุด Capital ของตุ่น";
							if (203972 - 52076 == 151896)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol7")
					{
						if (157051 - 211439 == -54388)
						{
							result = "สูตรตีอาวุธและชุด Bee ของตุ่น";
							if (245163 - 274263 == -29100)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol8")
					{
						if (36750 - 248157 == -211407)
						{
							result = "สูตรตีอาวุธและชุด Moltalic ของตุ่น";
							if (73571 - 454767 != -381195)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mol9")
					{
						if (220843 - 440856 == -220013)
						{
							result = "สูตรตีอาวุธและชุด King Maidas ของตุ่น";
							if (10759 - 50596 != -39836)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk1")
					{
						if (196422 - 516039 != -319616)
						{
							result = "สูตรตีอาวุธและชุด Standard ของลิง";
							if (280176 - 376613 != -96436)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk2")
					{
						if (85508 - 29195 != 56314)
						{
							result = "สูตรตีอาวุธ Fire Mike และชุด FireSeer ของลิง";
							if (47856 - 519155 != -471298)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk3")
					{
						if (159620 - 46718 != 112903)
						{
							result = "สูตรตีอาวุธ Earth Mike และชุด EarthShaman ของลิง";
							if (256200 - 595870 == -339670)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk4")
					{
						if (47043 - 28597 == 18446)
						{
							result = "สูตรตีอาวุธ Pyro Mike และชุด Pyromancer ของลิง";
							if (97274 - 215976 != -118701)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk5")
					{
						if (273458 - 422282 == -148824)
						{
							result = "สูตรตีอาวุธ Geo Mike และชุด Geomancer Gear ของลิง";
							if (191344 - 310169 == -118825)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk6")
					{
						if (72933 - 380360 != -307426)
						{
							result = "สูตรตีอาวุธและชุด Theurgist ของลิง";
							if (210215 - 245298 == -35083)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk7")
					{
						if (203105 - 28465 == 174640)
						{
							result = "สูตรตีอาวุธและชุด Spider ของลิง";
							if (11078 - 103478 != -92399)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk8")
					{
						if (33414 - 424871 != -391456)
						{
							result = "สูตรตีอาวุธและชุด Goku ของลิง";
							if (11584 - 19627 == -8043)
							{
								break;
							}
						}
					}
					else if (nCode == "r_mnk9")
					{
						if (196897 - 431120 == -234223)
						{
							result = "สูตรตีอาวุธและชุด Mephisto ของลิง";
							if (163213 - 10577 != 152637)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn1")
					{
						if (46139 - 356645 != -310505)
						{
							result = "สูตรตีอาวุธ Standard และชุด Wizard ของเพนกวิน";
							if (44627 - 586539 == -541912)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn2")
					{
						if (273228 - 240151 != 33078)
						{
							result = "สูตรตีอาวุธ Star Scepter และชุด StarSage ของเพนกวิน";
							if (283794 - 93063 == 190731)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn3")
					{
						if (287324 - 206546 == 80778)
						{
							result = "สูตรตีอาวุธ Ice Staff และชุด IceMage ของเพนกวิน";
							if (53887 - 377380 == -323493)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn4")
					{
						if (268262 - 55366 == 212896)
						{
							result = "สูตรตีอาวุธ Astral Scepter และชุด AstralSage ของเพนกวิน";
							if (56004 - 367602 == -311598)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn5")
					{
						if (288587 - 327800 != -39212)
						{
							result = "สูตรตีอาวุธ Frost Staff และชุด FrostMage ของเพนกวิน";
							if (201846 - 181253 == 20593)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn6")
					{
						if (55526 - 254694 != -199167)
						{
							result = "สูตรตีอาวุธและชุด Archmage ของเพนกวิน";
							if (176076 - 394570 == -218494)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn7")
					{
						if (36305 - 327959 == -291654)
						{
							result = "สูตรตีอาวุธและชุด Mosquito ของเพนกวิน";
							if (9170 - 453261 == -444091)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn8")
					{
						if (136015 - 547949 != -411933)
						{
							result = "สูตรตีอาวุธและชุด Pen Pen ของเพนกวิ้น";
							if (52455 - 489973 != -437517)
							{
								break;
							}
						}
					}
					else if (nCode == "r_pgn9")
					{
						if (172375 - 392728 != -220352)
						{
							result = "สูตรตีอาวุธและชุด Blue Phoenix ของเพนกวิ้น";
							if (27462 - 162970 != -135507)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp1")
					{
						if (77502 - 110321 != -32818)
						{
							result = "สูตรตีอาวุธ Standard Book และชุด Priest ของแกะ";
							if (258263 - 321214 != -62950)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp2")
					{
						if (178380 - 201806 != -23425)
						{
							result = "สูตรตีอาวุธและชุด Cleric ของแกะ";
							if (205042 - 322472 == -117430)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp3")
					{
						if (286292 - 363637 != -77344)
						{
							result = "สูตรตีอาวุธ Light Scroll และชุด LightSeer ของแกะ";
							if (90393 - 498038 == -407645)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp4")
					{
						if (267301 - 443775 != -176473)
						{
							result = "สูตรตีอาวุธและชุด Hierophant ของแกะ";
							if (31415 - 131685 == -100270)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp5")
					{
						if (48106 - 167282 != -119175)
						{
							result = "สูตรตีอาวุธและชุด Enchanter ของแกะ";
							if (14443 - 180241 != -165797)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp6")
					{
						if (61138 - 379632 == -318494)
						{
							result = "สูตรตีอาวุธและชุด Holy ของแกะ";
							if (87578 - 78206 == 9372)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp7")
					{
						if (217018 - 105639 != 111380)
						{
							result = "สูตรตีอาวุธและชุด Moth ของแกะ";
							if (10805 - 121465 == -110660)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp8")
					{
						if (34167 - 503194 == -469027)
						{
							result = "สูตรตีอาวุธและชุด Oveja ของแกะ";
							if (80054 - 241280 != -161225)
							{
								break;
							}
						}
					}
					else if (nCode == "r_shp9")
					{
						if (98694 - 345957 != -247262)
						{
							result = "สูตรตีอาวุธและชุด Seraphim ของแกะ";
							if (147564 - 544033 != -396468)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat1")
					{
						if (213108 - 354531 == -141423)
						{
							result = "สูตรตีอาวุธ Standard Wand และชุด NightMage ของค้างคาว";
							if (241233 - 402826 == -161593)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat2")
					{
						if (72258 - 83029 != -10770)
						{
							result = "สูตรตีอาวุธและชุด Warlock ของค้างคาว";
							if (277937 - 357927 != -79989)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat3")
					{
						if (161497 - 16833 == 144664)
						{
							result = "สูตรตีอาวุธ Illusion Wand และชุด Illusionist Dress ของค้างคาว";
							if (101388 - 381215 != -279826)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat4")
					{
						if (184125 - 560876 == -376751)
						{
							result = "สูตรตีอาวุธ Shadow Wand และชุด ShadowCaller ของค้างคาว";
							if (132821 - 61415 != 71407)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat5")
					{
						if (296860 - 122210 == 174650)
						{
							result = "สูตรตีอาวุธ Dream Wand และชุด DreamCaster ของค้างคาว";
							if (212856 - 507824 == -294968)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat6")
					{
						if (47395 - 317132 == -269737)
						{
							result = "สูตรตีอาวุธและชุด Queen ของค้างคาว";
							if (205339 - 23027 != 182313)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat7")
					{
						if (104617 - 146416 == -41799)
						{
							result = "สูตรตีอาวุธและชุด Butterfly ของค้างคาว";
							if (39046 - 172884 == -133838)
							{
								break;
							}
						}
					}
					else if (nCode == "r_bat8")
					{
						if (78736 - 556702 == -477966)
						{
							result = "สูตรตีอาวุธและชุด Succubus ของค้างคาว";
							if (105357 - 362249 == -256892)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "r_bat9"))
						{
							break;
						}
						if (63915 - 195063 != -131147)
						{
							result = "สูตรตีอาวุธและชุด Lilith ของค้างคาว";
							if (254853 - 437366 == -182513)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066F7 RID: 26359 RVA: 0x00E94DFC File Offset: 0x00E92FFC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066F8 RID: 26360 RVA: 0x00E94E00 File Offset: 0x00E93000
	internal static bool d2efVfpyijbTHZvIgQ9r()
	{
		return true;
	}

	// Token: 0x060066F9 RID: 26361 RVA: 0x00E94E04 File Offset: 0x00E93004
	internal static bool yt8ejlpyKmPiNZWgxZNl()
	{
		return false;
	}
}
