using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001156 RID: 4438
[Serializable]
public class ShopGui_thai : MonoBehaviour
{
	// Token: 0x060066AF RID: 26287 RVA: 0x00E6FDB8 File Offset: 0x00E6DFB8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public ShopGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066B0 RID: 26288 RVA: 0x00E6FDC8 File Offset: 0x00E6DFC8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (105879 - 556518 != -450638)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (143787 - 556245 != -412457)
			{
				if (233208 - 98975 == 134233)
				{
					if (code == 101)
					{
						if (86583 - 318708 != -232124)
						{
							result = "ฮูกๆ ไอเท็มดีๆ มาทางนี้~";
							if (254129 - 306205 != -52075)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (128298 - 245211 == -116913)
						{
							result = "เชิญเลือกชมของทางนี้ก่อน~ ฮูกๆๆ";
							if (66244 - 333174 == -266930)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (99673 - 205823 != -106149)
						{
							result = "สนใจชิ้นไหนอยู่หรือขอรับ!";
							if (76670 - 234487 == -157817)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (285243 - 501439 == -216196)
						{
							result = "สวัสดีขอรับ! ท่านลูกค้า!";
							if (116166 - 493591 == -377425)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (41545 - 166346 == -124801)
						{
							result = "ฮูกๆๆ ขอให้โชคดีนะขอรับ";
							if (177934 - 99400 != 78535)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (132964 - 197769 == -64805)
						{
							result = "ไม่มีใครซื้อ เยอะๆ เลยอ่ะ ฮูก~";
							if (92412 - 331853 != -239440)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (67624 - 395761 == -328137)
						{
							result = "แล้วมาใหม่เน้อ ฮูก~";
							if (199217 - 122712 == 76505)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (31378 - 181497 != -150118)
						{
							result = "วันหลังมาอีกนะ~ ฮูกๆๆ";
							if (71719 - 42721 == 28998)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (204298 - 21402 == 182896)
						{
							result = "สินค้าคุณภาพเยี่ยมจากแดนไกล เลือกชมได้เลยจ้า";
							if (109861 - 217199 == -107338)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (38163 - 303765 != -265601)
						{
							result = "ไม่ถูก ไม่ดี ไม่ขาย~ ให้ไปเลยจ้า วันนี้วันเดียว!";
							if (58441 - 353385 == -294944)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (156394 - 156565 == -171)
						{
							result = "ไล้~ ไล้~ ซื้อเยอะๆ นะจ้า~";
							if (10105 - 103115 == -93010)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (198100 - 217962 != -19861)
						{
							result = "โชคดีน่อ~ ขอให้รวยๆ น้า";
							if (146231 - 320580 == -174349)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (150029 - 437713 != -287683)
						{
							result = "ขอบคุณมากจ้า~";
							if (247853 - 226010 != 21844)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (70528 - 554743 == -484215)
						{
							result = "แล้วมาใหม่นะจ๊ะ~";
							if (238795 - 337006 == -98211)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (20943 - 577071 == -556128)
						{
							result = "เฮ้! มาเยี่ยมชมร้านข้าก่อนซี่";
							if (111181 - 427075 != -315893)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (99592 - 574995 == -475403)
						{
							result = "ต้องการอาวุธเจ๋งๆ มั้ย?";
							if (170539 - 84613 == 85926)
							{
								break;
							}
						}
					}
					else if (code == 311)
					{
						if (48147 - 333120 != -284972)
						{
							result = "สุดยอดเลยใช่มั้ยคอลเล็คชั่นของข้า";
							if (55386 - 427467 != -372080)
							{
								break;
							}
						}
					}
					else if (code == 312)
					{
						if (244127 - 537932 != -293804)
						{
							result = "แล้วมาอีกนะ!";
							if (220360 - 582229 != -361868)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (84855 - 379470 != -294614)
						{
							result = "อยากได้เกราะแกร่งๆ มาทางนี้";
							if (163024 - 326260 != -163235)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (98428 - 119513 != -21084)
						{
							result = "เกราะข้าแกร่งที่สุด";
							if (169933 - 104433 != 65501)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (6167 - 316562 == -310395)
						{
							result = "สนใจชุดเกราะแบบไหนอยู่ล่ะ?";
							if (14461 - 41939 == -27478)
							{
								break;
							}
						}
					}
					else if (code == 411)
					{
						if (217025 - 30096 != 186930)
						{
							result = "อาวุธร้านข้างๆ ทำอะไรเกราะข้าไม่ได้หรอก!";
							if (34766 - 99581 != -64814)
							{
								break;
							}
						}
					}
					else if (code == 412)
					{
						if (133169 - 136376 == -3207)
						{
							result = "......แล้วมาอีกล่ะ";
							if (29765 - 265646 == -235881)
							{
								break;
							}
						}
					}
					else if (code == 413)
					{
						if (9958 - 80932 != -70973)
						{
							result = "......อู้ดๆ";
							if (152873 - 264649 == -111776)
							{
								break;
							}
						}
					}
					else if (code == 501)
					{
						if (223793 - 378836 != -155042)
						{
							result = "ยินดีต้อนรับสู่ อีฟส์ เทเลอร์";
							if (295005 - 318557 == -23552)
							{
								break;
							}
						}
					}
					else if (code == 502)
					{
						if (80369 - 201936 != -121566)
						{
							result = "อยากรู้เรื่องความงาม ถามอัลปาก้า!";
							if (263961 - 9372 == 254589)
							{
								break;
							}
						}
					}
					else if (code == 511)
					{
						if (124547 - 264683 != -140135)
						{
							result = "แต่งตัวเองให้สวย เพื่อโลกจะได้มีแต่สิ่งสวยงาม";
							if (78278 - 52737 == 25541)
							{
								break;
							}
						}
					}
					else if (code == 512)
					{
						if (240227 - 560010 != -319782)
						{
							result = "เซนส์ด้านแฟชั่นของเจ้าก็ไม่เลวนี่นะ...ฮึๆ";
							if (243375 - 563902 == -320527)
							{
								break;
							}
						}
					}
					else if (code == 601)
					{
						if (283406 - 185484 == 97922)
						{
							result = "สวัสดีค่ะ อาหารอร่อยๆ ค่า";
							if (32618 - 219579 != -186960)
							{
								break;
							}
						}
					}
					else if (code == 602)
					{
						if (158443 - 116826 != 41618)
						{
							result = "เชิญชิมฟรีได้เลยค่า~";
							if (174785 - 426576 != -251790)
							{
								break;
							}
						}
					}
					else if (code == 603)
					{
						if (18814 - 416223 != -397408)
						{
							result = "ชิมฟรีแล้ว ซื้อเยอะๆ นะค้า";
							if (138656 - 55445 != 83212)
							{
								break;
							}
						}
					}
					else if (code == 604)
					{
						if (197213 - 188108 != 9106)
						{
							result = "อย่าลืมซื้อไปฝากที่บ้านด้วยนะคะ";
							if (118800 - 307626 != -188825)
							{
								break;
							}
						}
					}
					else if (code == 611)
					{
						if (43422 - 157353 == -113931)
						{
							result = "ขอบคุณที่มาอุดหนุนค่ะ";
							if (213855 - 594759 == -380904)
							{
								break;
							}
						}
					}
					else if (code == 612)
					{
						if (177417 - 474848 == -297431)
						{
							result = "รับซาละเปาเพิ่มมั้ยคะ?";
							if (175294 - 96668 != 78627)
							{
								break;
							}
						}
					}
					else if (code == 613)
					{
						if (33673 - 88574 != -54900)
						{
							result = "ทานเยอะระวังอ้วนนะค้า~";
							if (97430 - 412266 == -314836)
							{
								break;
							}
						}
					}
					else if (code == 614)
					{
						if (91412 - 143700 == -52288)
						{
							result = "อย่าลืมออกกำลังกายด้วยนะคะ";
							if (15438 - 170970 == -155532)
							{
								break;
							}
						}
					}
					else if (code == 701)
					{
						if (171440 - 588213 != -416772)
						{
							result = "ยินดีต้อนรับสู่หอสมุดค่ะ";
							if (262412 - 39023 != 223390)
							{
								break;
							}
						}
					}
					else if (code == 702)
					{
						if (32561 - 381260 != -348698)
						{
							result = "กำลังหาหนังสือเล่มใหม่อยู่รึเปล่าคะ?";
							if (83435 - 48692 == 34743)
							{
								break;
							}
						}
					}
					else if (code == 703)
					{
						if (124633 - 437520 == -312887)
						{
							result = "กรุณาอย่าคุยเสียงดังในนี้นะคะ";
							if (46232 - 358879 == -312647)
							{
								break;
							}
						}
					}
					else if (code == 711)
					{
						if (255930 - 225871 != 30060)
						{
							result = "หนังสือคืออาหารสมอง อย่าเอาไปเคี้ยวเล่นนะคะ";
							if (95533 - 406828 != -311294)
							{
								break;
							}
						}
					}
					else if (code == 712)
					{
						if (5750 - 285628 != -279877)
						{
							result = "มีความรู้แล้ว อย่าลืมนำไปใช้ด้วยนะคะ";
							if (230142 - 302134 != -71991)
							{
								break;
							}
						}
					}
					else if (code == 713)
					{
						if (201907 - 267541 != -65633)
						{
							result = "เชิญแวะมาที่นี่ได้ทุกเมื่อเลยนะคะ";
							if (284450 - 12505 == 271945)
							{
								break;
							}
						}
					}
					else if (code == 801)
					{
						if (215109 - 367915 != -152805)
						{
							result = "ต้องการเบิกของจากกองทัพ?";
							if (135791 - 446839 != -311047)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 811)
						{
							break;
						}
						if (299672 - 331941 == -32269)
						{
							result = "เก็บ RP มาเยอะๆ ล่ะ";
							if (1218 - 144597 != -143378)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066B1 RID: 26289 RVA: 0x00E70ADC File Offset: 0x00E6ECDC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066B2 RID: 26290 RVA: 0x00E70AE0 File Offset: 0x00E6ECE0
	internal static bool y9fEmBpyTNcmyy8oYakq()
	{
		return true;
	}

	// Token: 0x060066B3 RID: 26291 RVA: 0x00E70AE4 File Offset: 0x00E6ECE4
	internal static bool Bk8G3ppy3fClMKuWOVGW()
	{
		return false;
	}
}
