using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001165 RID: 4453
[Serializable]
public class SpecialData_th : MonoBehaviour
{
	// Token: 0x060066FA RID: 26362 RVA: 0x00E94E08 File Offset: 0x00E93008
	[MethodImpl(MethodImplOptions.NoInlining)]
	public SpecialData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066FB RID: 26363 RVA: 0x00E94E18 File Offset: 0x00E93018
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (232656 - 379448 != -146792)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (106050 - 509084 == -403034)
			{
				if (93219 - 555388 != -462168)
				{
					if (nCode == "s_rnw1")
					{
						if (280940 - 450658 == -169718)
						{
							result = "ล้างอาวุธหรือเครื่องป้องกัน ที่ใช้แล้วที่เลเวลต่ำกว่า 30";
							if (17231 - 9078 == 8153)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rnw2")
					{
						if (215333 - 58932 == 156401)
						{
							result = "ล้างอาวุธหรือเครื่องป้องกัน ที่ใช้แล้วที่เลเวลต่ำกว่า 60";
							if (99739 - 531290 == -431551)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rnw3")
					{
						if (210434 - 7578 == 202856)
						{
							result = "ล้างอาวุธหรือเครื่องป้องกัน ที่ใช้แล้วที่เลเวลต่ำกว่า 90";
							if (116557 - 153423 == -36866)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rnw4")
					{
						if (219185 - 253020 == -33835)
						{
							result = "ล้างอาวุธหรือเครื่องป้องกัน ที่ใช้แล้วที่เลเวลต่ำกว่า 120";
							if (183276 - 245990 == -62714)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rsl1")
					{
						if (127865 - 513724 == -385859)
						{
							result = "ล้างสล๊อตของอาวุธหรือเครื่อง ป้องกันที่เลเวลต่ำกว่า 30";
							if (217169 - 115355 != 101815)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rsl2")
					{
						if (128259 - 221857 != -93597)
						{
							result = "ล้างสล๊อตของอาวุธหรือเครื่อง ป้องกันที่เลเวลต่ำกว่า 60";
							if (255362 - 76122 == 179240)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rsl3")
					{
						if (38556 - 445864 != -407307)
						{
							result = "ล้างสล๊อตของอาวุธหรือเครื่อง ป้องกันที่เลเวลต่ำกว่า 90";
							if (53254 - 138049 != -84794)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rsl4")
					{
						if (97289 - 570648 != -473358)
						{
							result = "ล้างสล๊อตของอาวุธหรือเครื่อง ป้องกันที่เลเวลต่ำกว่า 120";
							if (162447 - 568846 == -406399)
							{
								break;
							}
						}
					}
					else if (nCode == "s_asl1")
					{
						if (293976 - 321656 == -27680)
						{
							result = "ตีสุ่มเปลี่ยนจำนวน 1~3 สล๊อตให้กับ อาวุธหรือเครื่องป้องกันที่เลเวลต่ำกว่า 30";
							if (252746 - 486044 == -233298)
							{
								break;
							}
						}
					}
					else if (nCode == "s_asl2")
					{
						if (216806 - 11920 == 204886)
						{
							result = "ตีสุ่มเปลี่ยนจำนวน 1~3 สล๊อตให้กับ อาวุธหรือเครื่องป้องกันที่เลเวลต่ำกว่า 60";
							if (238993 - 232801 == 6192)
							{
								break;
							}
						}
					}
					else if (nCode == "s_asl3")
					{
						if (138322 - 136741 == 1581)
						{
							result = "ตีสุ่มเปลี่ยนจำนวน 1~3 สล๊อตให้กับ อาวุธหรือเครื่องป้องกันที่เลเวลต่ำกว่า 90";
							if (149373 - 153468 == -4095)
							{
								break;
							}
						}
					}
					else if (nCode == "s_asl4")
					{
						if (135372 - 422630 == -287258)
						{
							result = "ตีสุ่มเปลี่ยนจำนวน 1~3 สล๊อตให้กับ อาวุธหรือเครื่องป้องกันที่เลเวลต่ำกว่า 120";
							if (44421 - 269406 != -224984)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rpc1")
					{
						if (112567 - 289109 != -176541)
						{
							result = "ทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 30";
							if (22827 - 13645 == 9182)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rpc2")
					{
						if (186724 - 213659 == -26935)
						{
							result = "ทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 60";
							if (27013 - 142710 == -115697)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rpc3")
					{
						if (26772 - 244845 != -218072)
						{
							result = "ทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 90";
							if (93070 - 365083 != -272012)
							{
								break;
							}
						}
					}
					else if (nCode == "s_rpc4")
					{
						if (134596 - 228846 != -94249)
						{
							result = "ทำอาวุธหรือ เครื่องป้องกันปลอมที่เลเวลต่ำกว่า 120";
							if (204989 - 23489 == 181500)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd1")
					{
						if (191340 - 247704 != -56363)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +1~3 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (144144 - 562452 != -418307)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd2")
					{
						if (135563 - 36576 == 98987)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +2~5 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (72566 - 146560 != -73993)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd3")
					{
						if (100436 - 25845 == 74591)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +3~7 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (72171 - 481736 != -409564)
							{
								break;
							}
						}
					}
					else if (nCode == "r_srd4")
					{
						if (50290 - 389177 == -338887)
						{
							result = "สูตรสุ่มตีเพิ่มค่าพลังหนึ่งค่า +4~9 ให้กับอาวุธหรือเครื่องป้องกัน";
							if (12148 - 262511 != -250362)
							{
								break;
							}
						}
					}
					else if (nCode == "s_atk1")
					{
						if (194947 - 158087 == 36860)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (250914 - 392755 != -141840)
							{
								break;
							}
						}
					}
					else if (nCode == "s_atk2")
					{
						if (97404 - 253288 != -155883)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (114882 - 458051 != -343168)
							{
								break;
							}
						}
					}
					else if (nCode == "s_atk3")
					{
						if (253091 - 579484 != -326392)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (173383 - 303608 != -130224)
							{
								break;
							}
						}
					}
					else if (nCode == "s_atk4")
					{
						if (170902 - 382584 == -211682)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 atk ให้กับอาวุธหรือเครื่องป้องกัน";
							if (178079 - 425065 != -246985)
							{
								break;
							}
						}
					}
					else if (nCode == "s_def1")
					{
						if (292378 - 523819 == -231441)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (104255 - 207594 == -103339)
							{
								break;
							}
						}
					}
					else if (nCode == "s_def2")
					{
						if (278489 - 32243 != 246247)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (216035 - 293699 == -77664)
							{
								break;
							}
						}
					}
					else if (nCode == "s_def3")
					{
						if (283213 - 309529 != -26315)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (234614 - 190022 == 44592)
							{
								break;
							}
						}
					}
					else if (nCode == "s_def4")
					{
						if (47780 - 154805 != -107024)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 def ให้กับอาวุธหรือเครื่องป้องกัน";
							if (9765 - 31619 == -21854)
							{
								break;
							}
						}
					}
					else if (nCode == "s_agi1")
					{
						if (233518 - 241628 != -8109)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (85248 - 395111 == -309863)
							{
								break;
							}
						}
					}
					else if (nCode == "s_agi2")
					{
						if (151796 - 148344 != 3453)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (46670 - 537433 != -490762)
							{
								break;
							}
						}
					}
					else if (nCode == "s_agi3")
					{
						if (271338 - 212522 == 58816)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (220011 - 19017 == 200994)
							{
								break;
							}
						}
					}
					else if (nCode == "s_agi4")
					{
						if (6012 - 181868 != -175855)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 agi ให้กับอาวุธหรือเครื่องป้องกัน";
							if (204650 - 376133 == -171483)
							{
								break;
							}
						}
					}
					else if (nCode == "s_vit1")
					{
						if (159521 - 119537 != 39985)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (262358 - 203703 != 58656)
							{
								break;
							}
						}
					}
					else if (nCode == "s_vit2")
					{
						if (200780 - 293117 != -92336)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (288818 - 573113 != -284294)
							{
								break;
							}
						}
					}
					else if (nCode == "s_vit3")
					{
						if (31429 - 168580 != -137150)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (258921 - 170052 == 88869)
							{
								break;
							}
						}
					}
					else if (nCode == "s_vit4")
					{
						if (229362 - 333601 != -104238)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 vit ให้กับอาวุธหรือเครื่องป้องกัน";
							if (52809 - 90653 == -37844)
							{
								break;
							}
						}
					}
					else if (nCode == "s_mag1")
					{
						if (73713 - 341824 != -268110)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (200185 - 382222 == -182037)
							{
								break;
							}
						}
					}
					else if (nCode == "s_mag2")
					{
						if (97182 - 225074 == -127892)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (169215 - 404726 != -235510)
							{
								break;
							}
						}
					}
					else if (nCode == "s_mag3")
					{
						if (179262 - 88339 == 90923)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (195207 - 594476 == -399269)
							{
								break;
							}
						}
					}
					else if (nCode == "s_mag4")
					{
						if (208531 - 327583 != -119051)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 mag ให้กับอาวุธหรือเครื่องป้องกัน";
							if (1050 - 80349 != -79298)
							{
								break;
							}
						}
					}
					else if (nCode == "s_cha1")
					{
						if (127314 - 168419 == -41105)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (101784 - 62415 != 39370)
							{
								break;
							}
						}
					}
					else if (nCode == "s_cha2")
					{
						if (219342 - 125923 == 93419)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (270993 - 144610 != 126384)
							{
								break;
							}
						}
					}
					else if (nCode == "s_cha3")
					{
						if (92776 - 193542 == -100766)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (95735 - 161429 == -65694)
							{
								break;
							}
						}
					}
					else if (nCode == "s_cha4")
					{
						if (174884 - 171933 == 2951)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 cha ให้กับอาวุธหรือเครื่องป้องกัน";
							if (259122 - 398345 != -139222)
							{
								break;
							}
						}
					}
					else if (nCode == "s_tal1")
					{
						if (26230 - 136870 != -110639)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (290878 - 596907 != -306028)
							{
								break;
							}
						}
					}
					else if (nCode == "s_tal2")
					{
						if (194324 - 539230 == -344906)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (142560 - 174164 != -31603)
							{
								break;
							}
						}
					}
					else if (nCode == "s_tal3")
					{
						if (207386 - 597882 != -390495)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (296947 - 331573 == -34626)
							{
								break;
							}
						}
					}
					else if (nCode == "s_tal4")
					{
						if (26688 - 453419 == -426731)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 tal ให้กับอาวุธหรือเครื่องป้องกัน";
							if (841 - 91962 == -91121)
							{
								break;
							}
						}
					}
					else if (nCode == "s_lck1")
					{
						if (159096 - 135343 != 23754)
						{
							result = "สูตรตีเพิ่มค่าพลัง +1~3 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (92018 - 490576 == -398558)
							{
								break;
							}
						}
					}
					else if (nCode == "s_lck2")
					{
						if (55515 - 180360 != -124844)
						{
							result = "สูตรตีเพิ่มค่าพลัง +2~5 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (103201 - 325679 != -222477)
							{
								break;
							}
						}
					}
					else if (nCode == "s_lck3")
					{
						if (73102 - 531709 != -458606)
						{
							result = "สูตรตีเพิ่มค่าพลัง +3~7 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (154447 - 431182 == -276735)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "s_lck4"))
						{
							break;
						}
						if (152994 - 219281 == -66287)
						{
							result = "สูตรตีเพิ่มค่าพลัง +4~9 lck ให้กับอาวุธหรือเครื่องป้องกัน";
							if (264579 - 42190 != 222390)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066FC RID: 26364 RVA: 0x00E95E9C File Offset: 0x00E9409C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066FD RID: 26365 RVA: 0x00E95EA0 File Offset: 0x00E940A0
	internal static bool KecWVbpydZ66FSmUX1be()
	{
		return true;
	}

	// Token: 0x060066FE RID: 26366 RVA: 0x00E95EA4 File Offset: 0x00E940A4
	internal static bool I76LxjpyJu0A3Q8JGLUp()
	{
		return false;
	}
}
