using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001157 RID: 4439
[Serializable]
public class StorageGui_thai : MonoBehaviour
{
	// Token: 0x060066B4 RID: 26292 RVA: 0x00E70AE8 File Offset: 0x00E6ECE8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public StorageGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066B5 RID: 26293 RVA: 0x00E70AF8 File Offset: 0x00E6ECF8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (257118 - 188744 != 68374)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (291294 - 242348 != 48947 && 26966 - 295563 != -268596)
			{
				if (code == 101)
				{
					if (170526 - 340347 != -169820)
					{
						result = "เอาล่ะ เก็บของซักหน่อยดีกว่า";
						if (100388 - 538603 != -438214)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (189154 - 385378 == -196224)
					{
						result = "มีอะไรเอาไปใช้ประโยชน์ได้อีก?";
						if (16451 - 535971 != -519519)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (288945 - 427010 != -138064)
					{
						result = "ขอข้าเตรียมตัวให้พร้อมก่อน";
						if (35151 - 230570 != -195418)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (99340 - 447456 != -348115)
					{
						result = "อืม.......";
						if (221733 - 451057 == -229324)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (90399 - 155904 != -65504)
					{
						result = "ใครเอากระดูกมาทิ้งไว้แถวนี้เนี่ย??";
						if (120488 - 23995 != 96494)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (255388 - 127245 != 128144)
					{
						result = "โฮก!";
						if (84270 - 552386 == -468116)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (94088 - 222568 == -128480)
					{
						result = "อยู่ไหน!!ของข้า!!";
						if (248144 - 493377 == -245233)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (176934 - 161045 != 15890)
					{
						result = "เจ้านี่ยังใช้ได้ดีอยู่เลย!";
						if (239052 - 308477 == -69425)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (274444 - 478615 != -204170)
					{
						result = "ฟุดฟิดๆ หืม!!??";
						if (116303 - 5099 == 111204)
						{
							break;
						}
					}
				}
				else if (code == 205)
				{
					if (157750 - 42432 != 115319)
					{
						result = "หิว!!!";
						if (244530 - 445983 != -201452)
						{
							break;
						}
					}
				}
				else if (code == 301)
				{
					if (125218 - 558718 != -433499)
					{
						result = "เก็บของที่ไม่ได้ใช้ดีกว่า";
						if (293439 - 158999 != 134441)
						{
							break;
						}
					}
				}
				else if (code == 302)
				{
					if (292762 - 122292 == 170470)
					{
						result = "ข้าวของพะรุงพะรัง คอยแต่จะเป็นตัวถ่วง";
						if (93481 - 108970 == -15489)
						{
							break;
						}
					}
				}
				else if (code == 303)
				{
					if (54780 - 175877 != -121096)
					{
						result = "คืนนี้นอนในกล่องดีกว่า...";
						if (148006 - 397661 == -249655)
						{
							break;
						}
					}
				}
				else if (code == 304)
				{
					if (93676 - 195414 == -101738)
					{
						result = "น้ำมันมวยหายไปไหนแล้ว?";
						if (103738 - 353724 == -249986)
						{
							break;
						}
					}
				}
				else if (code == 305)
				{
					if (112593 - 18940 == 93653)
					{
						result = "ของที่ไม่จำเป็น...ต้องทิ้งไปเสียบ้าง";
						if (143965 - 432517 == -288552)
						{
							break;
						}
					}
				}
				else if (code == 401)
				{
					if (275769 - 220933 != 54837)
					{
						result = "ได้เวลาเก็บของแล้ว!";
						if (91517 - 113944 == -22427)
						{
							break;
						}
					}
				}
				else if (code == 402)
				{
					if (231518 - 170195 != 61324)
					{
						result = "โอ๊ย!ทำกล่องให้มันใหญ่กว่านี้ไม่ได้รึไงนะ!";
						if (173329 - 501663 == -328334)
						{
							break;
						}
					}
				}
				else if (code == 403)
				{
					if (61134 - 536512 != -475377)
					{
						result = "อยู่ตรงไหนนะ?";
						if (171226 - 562857 != -391630)
						{
							break;
						}
					}
				}
				else if (code == 404)
				{
					if (31380 - 260883 != -229502)
					{
						result = "งั่ม...งั่ม...ซู้ด";
						if (206916 - 344879 == -137963)
						{
							break;
						}
					}
				}
				else if (code == 405)
				{
					if (7809 - 140332 == -132523)
					{
						result = "อยากได้กล่องใหญ่ๆกว่านี้จัง~";
						if (260859 - 351897 == -91038)
						{
							break;
						}
					}
				}
				else if (code == 501)
				{
					if (55228 - 144080 == -88852)
					{
						result = "เก็บของๆๆ";
						if (79487 - 249407 == -169920)
						{
							break;
						}
					}
				}
				else if (code == 502)
				{
					if (251235 - 130063 == 121172)
					{
						result = "อืมมมม";
						if (87157 - 309667 != -222509)
						{
							break;
						}
					}
				}
				else if (code == 503)
				{
					if (62003 - 301052 != -239048)
					{
						result = "สมบัติของฉัน หึๆๆ";
						if (49409 - 206415 == -157006)
						{
							break;
						}
					}
				}
				else if (code == 504)
				{
					if (112289 - 131853 != -19563)
					{
						result = "ต้องเช็คซักหน่อย!";
						if (277538 - 144091 == 133447)
						{
							break;
						}
					}
				}
				else if (code == 505)
				{
					if (218650 - 597365 != -378714)
					{
						result = "อันนี้เริ่มจะเน่าแล้วแฮะ...";
						if (218125 - 397607 != -179481)
						{
							break;
						}
					}
				}
				else if (code == 601)
				{
					if (33257 - 429011 != -395753)
					{
						result = "เฮ้อ ได้เอามาเก็บซะที";
						if (82795 - 195432 != -112636)
						{
							break;
						}
					}
				}
				else if (code == 602)
				{
					if (109472 - 105598 == 3874)
					{
						result = "ต้องทำลูกธนูเพิ่มแล้วสินะ";
						if (277794 - 534695 != -256900)
						{
							break;
						}
					}
				}
				else if (code == 603)
				{
					if (238368 - 185947 == 52421)
					{
						result = "มีอะไรหายไปรึเปล่าเนี่ย?";
						if (294547 - 268092 == 26455)
						{
							break;
						}
					}
				}
				else if (code == 604)
				{
					if (16330 - 116480 == -100150)
					{
						result = "ของที่ยังขาดมีอะไรบ้างนะ...อืม~";
						if (2885 - 272018 != -269132)
						{
							break;
						}
					}
				}
				else if (code == 605)
				{
					if (77888 - 568607 == -490719)
					{
						result = "จัดของซักหน่อยดีกว่าเรา";
						if (40298 - 504614 == -464316)
						{
							break;
						}
					}
				}
				else if (code == 701)
				{
					if (96081 - 247582 == -151501)
					{
						result = "เฮ้อ~เก็บในกระเป๋าไม่พอจริงๆ";
						if (163181 - 114121 == 49060)
						{
							break;
						}
					}
				}
				else if (code == 702)
				{
					if (204464 - 507945 != -303480)
					{
						result = "เก็บของซะหน่อยดีกว่าเนอะ";
						if (102316 - 127832 != -25515)
						{
							break;
						}
					}
				}
				else if (code == 703)
				{
					if (288436 - 515604 != -227167)
					{
						result = "อันนั้นก็ดี อันนี้ก็เสียดาย~ ฮือๆ";
						if (161702 - 264763 == -103061)
						{
							break;
						}
					}
				}
				else if (code == 704)
				{
					if (196573 - 476828 != -280254)
					{
						result = "หลอดแก้ว...ตัวทำละลาย...อืม~";
						if (28492 - 186370 != -157877)
						{
							break;
						}
					}
				}
				else if (code == 705)
				{
					if (254807 - 154740 != 100068)
					{
						result = "ต้องตรวจเช็คสต็อคซะที";
						if (3469 - 390938 != -387468)
						{
							break;
						}
					}
				}
				else if (code == 801)
				{
					if (17961 - 381315 == -363354)
					{
						result = "เก็บของดีกว่า!";
						if (291148 - 246130 != 45019)
						{
							break;
						}
					}
				}
				else if (code == 802)
				{
					if (217241 - 496849 != -279607)
					{
						result = "ต้องหาดินปืนเพิ่มซะแล้วสิ";
						if (157922 - 129938 == 27984)
						{
							break;
						}
					}
				}
				else if (code == 803)
				{
					if (206744 - 82684 != 124061)
					{
						result = "อยู่ไหน! อยู่ไหน!?";
						if (113514 - 416370 == -302856)
						{
							break;
						}
					}
				}
				else if (code == 804)
				{
					if (44526 - 395826 == -351300)
					{
						result = "เหวอ!น้ำมันเครื่องหกอ่ะ!";
						if (19156 - 481044 != -461887)
						{
							break;
						}
					}
				}
				else if (code == 805)
				{
					if (279571 - 131798 != 147774)
					{
						result = "*กุกกักกุกกัก*";
						if (100668 - 121730 != -21061)
						{
							break;
						}
					}
				}
				else if (code == 901)
				{
					if (89823 - 79908 == 9915)
					{
						result = "เก็บของกันดีกว่า!";
						if (107424 - 85222 == 22202)
						{
							break;
						}
					}
				}
				else if (code == 902)
				{
					if (185873 - 371133 == -185260)
					{
						result = "มิเกะ!เดี๋ยวก็ขังนายไว้ในกล่องซะเลย!";
						if (49156 - 194003 != -144846)
						{
							break;
						}
					}
				}
				else if (code == 903)
				{
					if (298849 - 161289 != 137561)
					{
						result = "เจี๊ยก~ เจี๊ยก~";
						if (118659 - 446551 != -327891)
						{
							break;
						}
					}
				}
				else if (code == 904)
				{
					if (11165 - 227243 != -216077)
					{
						result = "กล้วยเน่าซะละ...เสียดายอ่ะ~";
						if (122993 - 209664 == -86671)
						{
							break;
						}
					}
				}
				else if (code == 905)
				{
					if (227003 - 27846 == 199157)
					{
						result = "อย่าซนนักเซ่! มิเกะ!";
						if (154171 - 561271 == -407100)
						{
							break;
						}
					}
				}
				else if (code == 1001)
				{
					if (272973 - 39476 == 233497)
					{
						result = "ว่าจะเก็บของซักหน่อย";
						if (275853 - 306116 != -30262)
						{
							break;
						}
					}
				}
				else if (code == 1002)
				{
					if (5266 - 467015 != -461748)
					{
						result = "เหนื่อยๆๆ";
						if (267059 - 43123 == 223936)
						{
							break;
						}
					}
				}
				else if (code == 1003)
				{
					if (116225 - 377992 == -261767)
					{
						result = "ไอ้นั่น! ไปไหน!? หาไม่เจออ่ะ!?";
						if (257299 - 499838 == -242539)
						{
							break;
						}
					}
				}
				else if (code == 1004)
				{
					if (93780 - 576128 != -482347)
					{
						result = "หึหึหึ";
						if (252472 - 419263 != -166790)
						{
							break;
						}
					}
				}
				else if (code == 1005)
				{
					if (240314 - 342162 == -101848)
					{
						result = "หวังว่าคงไม่มีแมวขโมยผ่านมาแถวนี้นะ ฮึ่ม";
						if (245610 - 354706 != -109095)
						{
							break;
						}
					}
				}
				else if (code == 1101)
				{
					if (267190 - 316071 == -48881)
					{
						result = "เหนื่อยจัง~";
						if (74338 - 520765 == -446427)
						{
							break;
						}
					}
				}
				else if (code == 1102)
				{
					if (167639 - 481070 == -313431)
					{
						result = "เริ่มจะรกซะแล้วสิ";
						if (102170 - 417559 == -315389)
						{
							break;
						}
					}
				}
				else if (code == 1103)
				{
					if (110705 - 268913 != -158207)
					{
						result = "อืม~ อยู่ไหนน้า";
						if (80047 - 513627 == -433580)
						{
							break;
						}
					}
				}
				else if (code == 1104)
				{
					if (204809 - 373898 != -169088)
					{
						result = "ต้องเก็บของซักหน่อย";
						if (267000 - 242253 != 24748)
						{
							break;
						}
					}
				}
				else if (code == 1105)
				{
					if (248791 - 334611 == -85820)
					{
						result = "ขอแวะเก็บของก่อน";
						if (51226 - 349355 != -298128)
						{
							break;
						}
					}
				}
				else if (code == 1201)
				{
					if (126877 - 568186 != -441308)
					{
						result = "จัดการกับของซักหน่อยดีกว่า";
						if (56742 - 288848 != -232105)
						{
							break;
						}
					}
				}
				else if (code == 1202)
				{
					if (127531 - 1720 == 125811)
					{
						result = "ขอจัดของให้เนี๊ยบนิ้งซะหน่อยเถอะ";
						if (109530 - 406937 == -297407)
						{
							break;
						}
					}
				}
				else if (code == 1203)
				{
					if (98141 - 430207 != -332065)
					{
						result = "อะไรกันเนี่ย!?เลอะฝุ่นหมดเลย!!";
						if (199099 - 4004 != 195096)
						{
							break;
						}
					}
				}
				else if (code == 1204)
				{
					if (35537 - 315005 == -279468)
					{
						result = "ยังอยู่ครบดีมั๊ยนะ?";
						if (241835 - 177526 != 64310)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 1205)
					{
						break;
					}
					if (151005 - 375491 == -224486)
					{
						result = "เฮ้อ~ คนให้ของขวัญเยอะจริงๆ เลย";
						if (199120 - 572435 != -373314)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066B6 RID: 26294 RVA: 0x00E71CB4 File Offset: 0x00E6FEB4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066B7 RID: 26295 RVA: 0x00E71CB8 File Offset: 0x00E6FEB8
	internal static bool O3MUZ9pyXIShc2IGabGx()
	{
		return true;
	}

	// Token: 0x060066B8 RID: 26296 RVA: 0x00E71CBC File Offset: 0x00E6FEBC
	internal static bool UWhyR4pyQbqIcJ5yQ8hM()
	{
		return false;
	}
}
