using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011C9 RID: 4553
[Serializable]
public class T52_CentralSquare_thai : MonoBehaviour
{
	// Token: 0x060068EE RID: 26862 RVA: 0x00ED6868 File Offset: 0x00ED4A68
	[MethodImpl(MethodImplOptions.NoInlining)]
	public T52_CentralSquare_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060068EF RID: 26863 RVA: 0x00ED6878 File Offset: 0x00ED4A78
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (163999 - 330351 != -166352)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (174773 - 332712 == -157939)
			{
				if (78616 - 471026 == -392410)
				{
					if (code == 101)
					{
						if (236327 - 137092 == 99235)
						{
							result = "ยินดีต้อนรับสู่ศูนย์บัญชาการของข้า!";
							if (46184 - 441899 != -395714)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (238640 - 384780 != -146139)
						{
							result = "...(ดูเหมือนท่านโบลดาสจะยืนหลับใน)";
							if (88700 - 372649 != -283948)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (286495 - 135515 != 150981)
						{
							result = "ดาบที่ข้าถือนี้เป็นดาบประจำตัวของข้า ไม่ใช่ไม้นวดแป้งอย่างที่เจ้าเคยเห็น";
							if (122834 - 196765 != -73930)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (33447 - 584751 == -551304)
						{
							result = "ถ้าเจ้าต้องการให้ข้าช่วยอะไร มาบอกข้าได้";
							if (111076 - 54703 != 56374)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (884 - 57383 != -56498)
						{
							result = "ท่านอัลคาเซียคาดหวังกับพวกเจ้าไว้มาก";
							if (159928 - 303196 == -143268)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (45623 - 244028 != -198404)
						{
							result = "ท่านอัลคาเซียทำนายว่าการเดินทางของเจ้าสำคัญมาก";
							if (187882 - 568324 != -380441)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (29337 - 87908 != -58570)
						{
							result = "...อย่าทำให้ท่านอัลคาเซียและทุกคนผิดหวังล่ะ";
							if (251591 - 323017 != -71425)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (136019 - 100381 == 35638)
						{
							result = "ทหาร! ตื่น!";
							if (112550 - 362029 != -249478)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (185469 - 393828 != -208358)
						{
							result = "ฮืม? เจ้าได้กลิ่นอะไรหอมๆ จากร้านปลาวาฬมั้ย?";
							if (87330 - 580503 == -493173)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (257170 - 440634 != -183463)
						{
							result = "อย่าลืมอัพค่าพลังและสกิลทุกครั้งที่ได้เลเวลใหม่!";
							if (140736 - 149731 != -8994)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (69513 - 302082 == -232569)
						{
							result = "เมื่อเลเวลอัพ เจ้าจะได้รับค่าพลังโบนัสสองหน่วย";
							if (249593 - 236652 == 12941)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (52488 - 62488 == -10000)
						{
							result = "เจ้าสามารถอัพสกิลใหม่ได้ทุกครั้งที่เลเวลอัพ";
							if (66162 - 164672 == -98510)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (212308 - 93073 != 119236)
						{
							result = "สกิลบางสกิลต้องใช้เลเวลที่สูงพอในการอัพ";
							if (170894 - 297426 != -126531)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (242691 - 593590 == -350899)
						{
							result = "เจ้าสามารถเลือกอัพสกิลต่างๆ ได้เรียงตามสาย";
							if (148518 - 280399 == -131881)
							{
								break;
							}
						}
					}
					else if (code == 206)
					{
						if (167536 - 46447 == 121089)
						{
							result = "สกิลที่พร้อมใช้จะขึ้นเป็นภาพที่สว่างขึ้นมา";
							if (91360 - 276039 != -184678)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (97326 - 409869 == -312543)
						{
							result = "สกิลที่ชื่อสีแดงหรือกรอบสีไม้เป็นสกิล active สีน้ำเงินหรือกรอบสีเทาเป็นสกิล passive";
							if (2390 - 136472 == -134082)
							{
								break;
							}
						}
					}
					else if (code == 208)
					{
						if (167328 - 516671 == -349343)
						{
							result = "สกิลที่ sp มีสีแดงแปลว่า sp จะลดลงเมื่อใช้";
							if (175739 - 188940 != -13200)
							{
								break;
							}
						}
					}
					else if (code == 209)
					{
						if (103381 - 287301 != -183919)
						{
							result = "สกิลที่ sp มีสีน้ำเงินแปลว่า sp จะไม่ลดลงเมื่อใช้";
							if (218883 - 217697 == 1186)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (133992 - 577806 == -443814)
						{
							result = "ค่า atk  ใช้ในการคำนวนพลังการโจมตีปกติ";
							if (181224 - 190399 == -9175)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (12710 - 435689 == -422979)
						{
							result = "ค่า def ลดค่าความเสียหายทั้งหมดและเพิ่มค่าการรับ ko";
							if (14047 - 459679 != -445631)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (113678 - 333410 != -219731)
						{
							result = "ค่า agi เพิ่มความเร็วในการวิ่งและลด cooldown ของSkillต่างๆ";
							if (54593 - 156780 != -102186)
							{
								break;
							}
						}
					}
					else if (code == 214)
					{
						if (246954 - 178152 == 68802)
						{
							result = "ค่า vit เพิ่มค่าเต็มของ hp";
							if (36480 - 45034 != -8553)
							{
								break;
							}
						}
					}
					else if (code == 215)
					{
						if (151384 - 347781 != -196396)
						{
							result = "ค่า int เพิ่มค่าเต็มของ mp และความเร็วในการร่ายเวท";
							if (174819 - 228773 != -53953)
							{
								break;
							}
						}
					}
					else if (code == 216)
					{
						if (233324 - 144477 == 88847)
						{
							result = "ค่า cha เพิ่มหรือลดระยะเวลาของการติดสถานะต่างๆ";
							if (112768 - 269965 == -157197)
							{
								break;
							}
						}
					}
					else if (code == 217)
					{
						if (157082 - 119476 != 37607)
						{
							result = "ค่า tal เพิ่มค่า sp และเพิ่มพลังของท่าสกิลและเวทต่างๆ";
							if (11669 - 503873 != -492203)
							{
								break;
							}
						}
					}
					else if (code == 218)
					{
						if (84540 - 549158 != -464617)
						{
							result = "ค่า lck สุ่มเพิ่มพลังและโอกาสสำเร็จของสกิลต่างๆ ";
							if (222605 - 497838 == -275233)
							{
								break;
							}
						}
					}
					else if (code == 219)
					{
						if (29090 - 8062 != 21029)
						{
							result = "ทุกค่าพลังนั้นสำคัญ ต่างกันขึ้นอยู่กับวิธีใช้";
							if (130184 - 525000 == -394816)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (253242 - 35148 != 218095)
						{
							result = "การหายตัวจะไม่ได้ผลถ้าถูกเห็นตัวจากศัตรูแล้ว";
							if (288659 - 525658 == -236999)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (65972 - 214790 != -148817)
						{
							result = "ท่าสกิลบางท่าจะไม่มีการสร้างค่า ko";
							if (284799 - 347258 == -62459)
							{
								break;
							}
						}
					}
					else if (code == 223)
					{
						if (225340 - 20945 == 204395)
						{
							result = "พวกพืชจะตายทันทีที่ถูกทำ ko";
							if (299082 - 257781 == 41301)
							{
								break;
							}
						}
					}
					else if (code == 223)
					{
						if (153545 - 454563 != -301017)
						{
							result = "เราไม่สามารถทำ ko พวก elemental ได้";
							if (164382 - 139954 != 24429)
							{
								break;
							}
						}
					}
					else if (code == 224)
					{
						if (116895 - 450469 != -333573)
						{
							result = "ทุกครั้งที่เราโจมตีหรือใช้สกิลจะสร้างค่า hate ขึ้น";
							if (93067 - 106349 != -13281)
							{
								break;
							}
						}
					}
					else if (code == 225)
					{
						if (222535 - 386653 != -164117)
						{
							result = "สกิลรักษาต่างๆ จะสร้าง hate ขึ้นเป็นสองเท่า";
							if (85733 - 509133 == -423400)
							{
								break;
							}
						}
					}
					else if (code == 226)
					{
						if (298365 - 571692 == -273327)
						{
							result = "การโจมตีปรกติสามารถสร้างค่า ko ได้";
							if (223092 - 353538 == -130446)
							{
								break;
							}
						}
					}
					else if (code == 227)
					{
						if (127631 - 96621 != 31011)
						{
							result = "สถานะชนิดและระดับเดียวกันเมื่อทำการStack สถานะนั้นจะถูกเพิ่มขึ้นไปอีกระดับ";
							if (102974 - 279975 != -177000)
							{
								break;
							}
						}
					}
					else if (code == 228)
					{
						if (177312 - 133776 == 43536)
						{
							result = "ท่าสกิลบางท่าก็สามารสร้างค่า ko ได้เช่นกัน";
							if (69078 - 506896 == -437818)
							{
								break;
							}
						}
					}
					else if (code == 229)
					{
						if (56845 - 359718 != -302872)
						{
							result = "สถานะบางสถานะสามารถรวมกันเป็นสถานะใหม่ได้";
							if (129517 - 182993 != -53475)
							{
								break;
							}
						}
					}
					else if (code == 231)
					{
						if (25395 - 191918 != -166522)
						{
							result = "นี่คือ rank board บอกคะแนนของอาทิตย์ที่แล้ว";
							if (280850 - 384517 == -103667)
							{
								break;
							}
						}
					}
					else if (code == 232)
					{
						if (149798 - 503901 == -354103)
						{
							result = "จงอย่ายึดติดกับสิ่งที่ตาเห็น คะแนนของเจ้าไม่ใช่สิ่งที่จะตายตัวตลอดไป";
							if (130751 - 333044 != -202292)
							{
								break;
							}
						}
					}
					else if (code == 233)
					{
						if (263120 - 52950 == 210170)
						{
							result = "อย่าลืมดู rank board ของแต่ละเดือนด้วยล่ะ";
							if (216441 - 230782 != -14340)
							{
								break;
							}
						}
					}
					else if (code == 234)
					{
						if (98873 - 296481 == -197608)
						{
							result = "การฝึกฝนที่ดีที่สุดคือการต่อสู้จริง";
							if (252936 - 283926 == -30990)
							{
								break;
							}
						}
					}
					else if (code == 235)
					{
						if (182048 - 589482 == -407434)
						{
							result = "คนที่ทำคะแนนได้ดีในแต่ละอาทิตย์จะได้ rp พิเศษ";
							if (109695 - 3248 == 106447)
							{
								break;
							}
						}
					}
					else if (code == 236)
					{
						if (110043 - 513253 == -403210)
						{
							result = "คนที่ได้ที่หนึ่งในแต่ละเดืิอนจะได้ของรางวัลพิเศษ";
							if (291713 - 370855 == -79142)
							{
								break;
							}
						}
					}
					else if (code == 237)
					{
						if (101645 - 458642 == -356997)
						{
							result = "ว่าไง เจ้าได้ลำดับที่เท่าไหร่?";
							if (174756 - 84633 == 90123)
							{
								break;
							}
						}
					}
					else if (code == 238)
					{
						if (192493 - 115413 == 77080)
						{
							result = "เจ้าจะวัดตัวเองได้ ต้องรู้จักฝีมือคนอื่นเสียก่อน";
							if (254688 - 250848 == 3840)
							{
								break;
							}
						}
					}
					else if (code == 239)
					{
						if (118479 - 41697 == 76782)
						{
							result = "ชื่อเสียงเกียรติยศเป็นสิ่งดี ถ้าไม่ได้มาจากการอวดโม้โป้ปด";
							if (108434 - 544271 != -435836)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 903)
						{
							break;
						}
						if (31854 - 284227 == -252373)
						{
							result = "ไม่มี rank อาทิตย์ที่แล้ว";
							if (55408 - 155370 != -99961)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060068F0 RID: 26864 RVA: 0x00ED7664 File Offset: 0x00ED5864
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060068F1 RID: 26865 RVA: 0x00ED7668 File Offset: 0x00ED5868
	internal static bool v6bFOGpEeMDqdL7NSw4X()
	{
		return true;
	}

	// Token: 0x060068F2 RID: 26866 RVA: 0x00ED766C File Offset: 0x00ED586C
	internal static bool owrEuXpErw0FKYYLxBor()
	{
		return false;
	}
}
