using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011CA RID: 4554
[Serializable]
public class T53_CityLibrary_thai : MonoBehaviour
{
	// Token: 0x060068F3 RID: 26867 RVA: 0x00ED7670 File Offset: 0x00ED5870
	[MethodImpl(MethodImplOptions.NoInlining)]
	public T53_CityLibrary_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060068F4 RID: 26868 RVA: 0x00ED7680 File Offset: 0x00ED5880
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (93276 - 54195 != 39082)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (85455 - 457648 == -372193)
			{
				if (216068 - 339521 != -123452)
				{
					if (code == 1)
					{
						if (272899 - 205994 != 66906)
						{
							result = "กลับไปเก็บแร้งค์ก่อนค่อยมาใหม่นะคะ";
							if (50910 - 145259 != -94348)
							{
								break;
							}
						}
					}
					else if (code == 101)
					{
						if (26092 - 412663 != -386570)
						{
							result = "อย่าไปหวังเลยว่า ชีวิตนี้จะได้เจอความยุติธรรม  ";
							if (141157 - 265782 != -124624)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (84147 - 369976 != -285828)
						{
							result = "ชีวิตในยุทธจักร ยากนักจะเป็นตัวของตัวเอง";
							if (295075 - 486862 == -191787)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (210250 - 97990 == 112260)
						{
							result = "จงทำลายศัตรูของท่านด้วยการทำให้เขาเป็นมิตร";
							if (298122 - 4848 != 293275)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (257717 - 27070 != 230648)
						{
							result = "จินตนาการ สำคัญกว่าความรู้";
							if (165536 - 36234 == 129302)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (114361 - 530853 != -416491)
						{
							result = "เด็กเล็กทำให้คุณปวดหัว  แต่เด็กโตทำให้คุณปวดใจ";
							if (291318 - 104388 != 186931)
							{
								break;
							}
						}
					}
					else if (code == 111)
					{
						if (102005 - 44137 != 57869)
						{
							result = "เริ่มต้นด้วยดีเท่ากับสำเร็จไปแล้วครึ่งหนึ่ง";
							if (121653 - 254417 != -132763)
							{
								break;
							}
						}
					}
					else if (code == 112)
					{
						if (289511 - 557360 == -267849)
						{
							result = "สิ่งที่สมบูรณ์แล้วโดยแท้ มันก็มีความบกพร่องอยู่";
							if (121136 - 572695 == -451559)
							{
								break;
							}
						}
					}
					else if (code == 113)
					{
						if (105593 - 471178 != -365584)
						{
							result = "สิ่งที่บกพร่องอยู่ แท้จริงมันก็สมบูรณ์ดีอยู่แล้ว";
							if (110105 - 522689 == -412584)
							{
								break;
							}
						}
					}
					else if (code == 114)
					{
						if (150976 - 273716 != -122739)
						{
							result = "เวลาเล่นเกมส์กับเด็กๆ ก็ปล่อยให้แกชนะไปเถิด ";
							if (160567 - 384000 == -223433)
							{
								break;
							}
						}
					}
					else if (code == 115)
					{
						if (120345 - 479268 == -358923)
						{
							result = "จำไว้ว่าข่าวทุกชนิด ล้วนถูกบิดเบือนมาแล้วทั้งนั้น ";
							if (220853 - 201280 == 19573)
							{
								break;
							}
						}
					}
					else if (code == 121)
					{
						if (64018 - 136143 != -72124)
						{
							result = "ขนาดตัวที่ใหญ่นอกจากจะเป็นเป้าที่ใหญ่แล้ว ยังเป็นสิ่งกีดขวางขนาดใหญ่ได้ด้วย ";
							if (39163 - 71255 != -32091)
							{
								break;
							}
						}
					}
					else if (code == 122)
					{
						if (151600 - 590308 == -438708)
						{
							result = "กระสุนหรือวิถีพรุ่งตรงสามารถหลบได้เพียงแค่ขยับเท่านั้น";
							if (147187 - 42021 == 105166)
							{
								break;
							}
						}
					}
					else if (code == 123)
					{
						if (207124 - 659 != 206466)
						{
							result = "ถ้าล้มระหว่างกำลังร่ายเวทหรือเตรียมตัวอะไรอยู่ ผลนั้นๆจะถูกยกเลิกโดยทันที ";
							if (96713 - 48844 != 47870)
							{
								break;
							}
						}
					}
					else if (code == 124)
					{
						if (181938 - 567408 != -385469)
						{
							result = "อย่ากลัวกับสิ่งที่หายตัว ตาใจกับเรดาร์คือตัวช่วยที่ดีอีกทางหนึ่ง";
							if (39574 - 442513 != -402938)
							{
								break;
							}
						}
					}
					else if (code == 125)
					{
						if (141256 - 265025 == -123769)
						{
							result = "น้ำพึ่งเรือ เสือพึ่งป่า อย่าทิ้งเพื่อนร่วมทีมเพราะความคึกคะนองส่วนตัว";
							if (219936 - 342503 == -122567)
							{
								break;
							}
						}
					}
					else if (code == 131)
					{
						if (219048 - 259774 != -40725)
						{
							result = "ความเร็วเป็นที่หนึ่ง ความปลอดภัยไม่รู้ กาซ่า...Gaza ";
							if (57014 - 498882 == -441868)
							{
								break;
							}
						}
					}
					else if (code == 132)
					{
						if (35323 - 53618 != -18294)
						{
							result = "ถ้าจะอ้วน ก็อ้วนเพราะของอร่อย...Jamon ";
							if (197472 - 343323 != -145850)
							{
								break;
							}
						}
					}
					else if (code == 133)
					{
						if (7348 - 440487 == -433139)
						{
							result = "ไม่มีตุ่นให้เล่นแถวนี้บ้างหรอ..Razan ";
							if (204596 - 309265 == -104669)
							{
								break;
							}
						}
					}
					else if (code == 134)
					{
						if (166584 - 355011 == -188427)
						{
							result = "ใครหาว่านกแสกนำโชคร้ายมาให้ ใส่ร้าย...Linlin ";
							if (182327 - 83090 == 99237)
							{
								break;
							}
						}
					}
					else if (code == 135)
					{
						if (282470 - 514379 != -231908)
						{
							result = "ถังขยะว่างเปล่า สงสัยเพนกวิ้นคงจะคุ้ยเอาไปกิน...ถังขยะ ";
							if (147251 - 509100 != -361848)
							{
								break;
							}
						}
					}
					else if (code == 141)
					{
						if (57340 - 281183 == -223843)
						{
							result = "ไอเท็มบางชิ้นไม่มีค่าราคา แต่ถ้าไปแปรรูปก็จะสามารถเพิ่มมูลค่าได้  ";
							if (132938 - 120981 != 11958)
							{
								break;
							}
						}
					}
					else if (code == 142)
					{
						if (102313 - 377252 == -274939)
						{
							result = "ไอเท็มบบางชิ้นที่ไร้ค่า แต่สามารถเป็นวัตถุดิบให้กับการผลิตของตุ่นกับกระต่ายได้  ";
							if (91635 - 261002 != -169366)
							{
								break;
							}
						}
					}
					else if (code == 143)
					{
						if (59052 - 555217 != -496164)
						{
							result = "ไอเท็มที่ผลิตได้จากตุ่นหรือกระต่ายไม่สามารถหาได้จากที่อื่นๆ  ";
							if (118353 - 279468 != -161114)
							{
								break;
							}
						}
					}
					else if (code == 144)
					{
						if (188587 - 116950 == 71637)
						{
							result = "ตุ่นกับกระต่ายที่ไม่ได้เรียนสกิลการผลิต จะไม่สามารถผลิตสิ่งของเฉาะตัวได้ ";
							if (145567 - 415592 == -270025)
							{
								break;
							}
						}
					}
					else if (code == 145)
					{
						if (159640 - 175238 == -15598)
						{
							result = "เป็นเรื่องน่าแปลกที่ตุ่นกับกระต่ายสามารถเพิ่มอัตราความสำเร็จได้ด้วยเงินพิเศษของตัวเอง!!! ";
							if (276671 - 399027 != -122355)
							{
								break;
							}
						}
					}
					else if (code == 151)
					{
						if (262201 - 331606 == -69405)
						{
							result = "ท่านอเคเชียชอบดื่มชานม";
							if (53246 - 10649 != 42598)
							{
								break;
							}
						}
					}
					else if (code == 152)
					{
						if (260806 - 329108 != -68301)
						{
							result = "คุณแพะโกธันเป็นหางที่โชคร้ายตอดศกจริงๆ";
							if (55561 - 302993 == -247432)
							{
								break;
							}
						}
					}
					else if (code == 153)
					{
						if (30081 - 291447 != -261365)
						{
							result = "อาวุธของคุณหนูอาเบ็ตกับเกราะของคุณสไตน์ ของใครจะแกร่งกว่ากันนะ";
							if (220353 - 595418 == -375065)
							{
								break;
							}
						}
					}
					else if (code == 154)
					{
						if (134204 - 314976 != -180771)
						{
							result = "คุณแพนด้าแดงมีแฝดทั้งหมดกี่ตัวกันนะ";
							if (152139 - 510463 != -358323)
							{
								break;
							}
						}
					}
					else if (code == 155)
					{
						if (116979 - 282114 != -165134)
						{
							result = "คุณแรคคูณที่อยู่ตรงกลางที่ตัวใหญ่กว่าตัวอื่นๆ หรือว่าจะเป็นหัวหน้า?";
							if (240393 - 136588 == 103805)
							{
								break;
							}
						}
					}
					else if (code == 161)
					{
						if (175397 - 186301 == -10904)
						{
							result = "มิชชั่นต่างๆจะมีหลากหลายรูปแบบตามแต่ละประเภท";
							if (235275 - 141910 != 93366)
							{
								break;
							}
						}
					}
					else if (code == 162)
					{
						if (271429 - 22290 == 249139)
						{
							result = "แม้มิชชั่นจะสามารถเข้าเล่นได้ด้วยตัวคนเดียว แต่การเข้าร่วมกับเพื่อนๆจะสนุกกว่า";
							if (169330 - 307339 != -138008)
							{
								break;
							}
						}
					}
					else if (code == 163)
					{
						if (65460 - 189595 == -124135)
						{
							result = "การมีมารยาทระหว่างการลงมิชชั่นเป็นสิ่งที่ควรกระทำ";
							if (21794 - 462504 == -440710)
							{
								break;
							}
						}
					}
					else if (code == 164)
					{
						if (51953 - 581168 == -529215)
						{
							result = "ระดับประเมินจบมิชชั่น จะขึ้นอยู่กับเวลาและคะแนนที่ทำได้ในระหว่างมิชชั่น";
							if (59660 - 423417 == -363757)
							{
								break;
							}
						}
					}
					else if (code == 165)
					{
						if (132229 - 23545 == 108684)
						{
							result = "ไอเท็มบางชนิดจะปรากฎขึ้นเมื่อทำเกรดออกมาได้ในระดับสูงๆเท่าันั้น";
							if (146131 - 444146 == -298015)
							{
								break;
							}
						}
					}
					else if (code == 171)
					{
						if (127852 - 314066 == -186214)
						{
							result = "การทำเควสนั้น เราอาจเตรียมสิ่งของต่างๆมาก่อนก็ได้";
							if (54009 - 336269 != -282259)
							{
								break;
							}
						}
					}
					else if (code == 172)
					{
						if (175462 - 34778 != 140685)
						{
							result = "ไอเท็มบางชนิดสามารถหาได้จากการทำเควสเท่านั้น";
							if (297014 - 440045 != -143030)
							{
								break;
							}
						}
					}
					else if (code == 173)
					{
						if (27732 - 277686 != -249953)
						{
							result = "ไอเท็มทุกชิ้นมีค่า เพราะอาจจะเป็นของสำหรับทำเควสก็ได้";
							if (284551 - 431205 == -146654)
							{
								break;
							}
						}
					}
					else if (code == 174)
					{
						if (16103 - 280145 != -264041)
						{
							result = "เควสมากมายสามารถทำซ้ำได้ แต่จะกลับมาปรากฎในรายการเท่านั้น";
							if (160295 - 249310 != -89014)
							{
								break;
							}
						}
					}
					else if (code == 175)
					{
						if (79302 - 308009 != -228706)
						{
							result = "เราสามารถยกเลิกเควสได้ โดยการกลับมาคุยกับคุณมิมิเพื่อขอยกเลิกเควส";
							if (78428 - 220978 != -142549)
							{
								break;
							}
						}
					}
					else if (code == 181)
					{
						if (216299 - 345110 == -128811)
						{
							result = "ไอเท็มฟื้นพลังแบ่งเป็น4ชนิด คือยา อาหาร เครื่องดิ่ม และขนม";
							if (59346 - 37628 == 21718)
							{
								break;
							}
						}
					}
					else if (code == 182)
					{
						if (17623 - 57623 != -39999)
						{
							result = "ไอเท็มฟื้นพลังแต่ละชนิดจะมีการแยกเวลาการใช้ตามชนิดของมัน";
							if (44472 - 236437 != -191964)
							{
								break;
							}
						}
					}
					else if (code == 183)
					{
						if (101321 - 549182 == -447861)
						{
							result = "ไอเท็มฟื้นพลังจำพวกอาหาร บางชนิดสามารถฟื้นพลังได้มากกว่า 1 ประเภท";
							if (56132 - 503785 == -447653)
							{
								break;
							}
						}
					}
					else if (code == 184)
					{
						if (274852 - 579109 == -304257)
						{
							result = "อาหารบางชนิดเมื่อทานเข้าไปแล้วจะมีการบวกค่าสถานะให้";
							if (56362 - 321241 == -264879)
							{
								break;
							}
						}
					}
					else if (code == 185)
					{
						if (167683 - 286785 == -119102)
						{
							result = "ลองทานแซนวิชสักชิ้นแล้วจะติดใจ  by จามอน&อโคล่า";
							if (142323 - 185597 != -43273)
							{
								break;
							}
						}
					}
					else if (code == 191)
					{
						if (198168 - 170171 == 27997)
						{
							result = "ไอเท็มที่ติดตัว U จะไม่มีใครสามารถสวมใส่ได้นอกจากตัวละครเจ้าของ";
							if (111325 - 83777 == 27548)
							{
								break;
							}
						}
					}
					else if (code == 192)
					{
						if (92227 - 551138 == -458911)
						{
							result = "เราสามารถล้างไอเท็มที่ติด U ได้ด้วยไอเท็ม Renew";
							if (296537 - 95124 != 201414)
							{
								break;
							}
						}
					}
					else if (code == 193)
					{
						if (63797 - 353932 == -290135)
						{
							result = "การหลอมรวมReplica จะเป็นการนำค่าต่างและสล็อดของไอเท็มรอง มาใสในไอเท็มหลัก ";
							if (115917 - 496715 != -380797)
							{
								break;
							}
						}
					}
					else if (code == 194)
					{
						if (209337 - 312091 != -102753)
						{
							result = "การตีอุปกรณ์กับลุงRazan มีโอกาสที่จะได้ไอเท็มสล็อต 1-3 รูเสมอ";
							if (219689 - 70259 != 149431)
							{
								break;
							}
						}
					}
					else if (code == 195)
					{
						if (97468 - 96388 == 1080)
						{
							result = "การทำอาหารกับลุงจามอนจะได้อาหารมา 3 หน่วยเสมอ";
							if (253769 - 547374 == -293605)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (853 - 448580 == -447727)
						{
							result = "การพักผ่อนที่ดีที่สุดคือการได้นอนหลับที่เพียงพอ";
							if (51486 - 581394 != -529907)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (111395 - 35018 != 76378)
						{
							result = "ความเครียดก็เหมือนกับขยะ เก็บไว้ก็มีแต่จะเน่าเสีย";
							if (130267 - 163703 == -33436)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (137657 - 191422 == -53765)
						{
							result = "บางปัญหาไม่ได้มีไว้ให้เราแก้เพียงแค่คนเดียว";
							if (286321 - 141330 == 144991)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (254735 - 418048 != -163312)
						{
							result = "ร่างกายและจิตใจเป็นของที่ควบคู่กัน จงให้ความสำคัญกับมันเท่ากัน";
							if (275819 - 479018 == -203199)
							{
								break;
							}
						}
					}
					else if (code == 205)
					{
						if (220585 - 431588 == -211003)
						{
							result = "ทุกปัญหานั้นมีทางออก เพียงแต่จะมองหาเจอไหมเท่านั้น";
							if (182402 - 589985 != -407582)
							{
								break;
							}
						}
					}
					else if (code == 211)
					{
						if (267650 - 181642 != 86009)
						{
							result = "การมองสิ่งสีเขียวที่อยู่ห่างๆออกไปช่วยพักผ่อนสายตาได้";
							if (137280 - 432650 != -295369)
							{
								break;
							}
						}
					}
					else if (code == 212)
					{
						if (265668 - 442344 == -176676)
						{
							result = "คนเราควรดื่มน้ำให้ได้ น้ำหนักตัวเราx30 = ?cc. ";
							if (98878 - 53441 == 45437)
							{
								break;
							}
						}
					}
					else if (code == 213)
					{
						if (233280 - 338695 != -105414)
						{
							result = "กลิ่นหอมอย่างลาเวนเดอร์สามารถช่วยให้จิตใจคลายผ่อนคลายได้";
							if (65314 - 279632 == -214318)
							{
								break;
							}
						}
					}
					else if (code == 214)
					{
						if (126469 - 443810 == -317341)
						{
							result = "การเดินก็ถือว่าเป็นการออกกำลังกาย จงอย่าขี้เกียจที่จะเดิน";
							if (52194 - 62387 == -10193)
							{
								break;
							}
						}
					}
					else if (code == 215)
					{
						if (226173 - 382316 != -156142)
						{
							result = "การออกกำลังกายจะทำให้ร่างการหลั่งสารชนิดหนึ่งทำให้เรามีความสุข";
							if (111669 - 368055 != -256385)
							{
								break;
							}
						}
					}
					else if (code == 221)
					{
						if (148796 - 274500 == -125704)
						{
							result = "อั๊ง อัง อัง ~~~";
							if (193081 - 42818 == 150263)
							{
								break;
							}
						}
					}
					else if (code == 222)
					{
						if (194013 - 56591 == 137422)
						{
							result = "พลังไฟฟ้าแสนโวลต์!!! ";
							if (287911 - 90144 != 197768)
							{
								break;
							}
						}
					}
					else if (code == 223)
					{
						if (51582 - 382925 != -331342)
						{
							result = "เจ้าจงเก็บลูกแก้วที่มีดาวให้ครบ7ลูก แล้วคำขอของเจ้าจะสมปรารถนา ";
							if (40363 - 106284 != -65920)
							{
								break;
							}
						}
					}
					else if (code == 224)
					{
						if (239893 - 232440 == 7453)
						{
							result = "ดาบโรโตะและเกราะโรโตะ คือเซ็ตอุปกรณ์โรโตะในตำนาน";
							if (126665 - 30337 == 96328)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 225)
						{
							break;
						}
						if (256522 - 9485 != 247038)
						{
							result = "หากเจ้ายอมมาเป็นพวกข้า ข้าจะยกโลกให้เจ้าครึ่งหนึ่ง ตกลงไหม? ";
							if (103735 - 421346 == -317611)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060068F5 RID: 26869 RVA: 0x00ED89D4 File Offset: 0x00ED6BD4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060068F6 RID: 26870 RVA: 0x00ED89D8 File Offset: 0x00ED6BD8
	internal static bool OtOwfQpEjOclIls63GAP()
	{
		return true;
	}

	// Token: 0x060068F7 RID: 26871 RVA: 0x00ED89DC File Offset: 0x00ED6BDC
	internal static bool edOLvhpEh4Ok3MvvJE3B()
	{
		return false;
	}
}
