using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x020011CC RID: 4556
[Serializable]
public class T55_LightPalace_thai : MonoBehaviour
{
	// Token: 0x060068FD RID: 26877 RVA: 0x00ED8EF4 File Offset: 0x00ED70F4
	[MethodImpl(MethodImplOptions.NoInlining)]
	public T55_LightPalace_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060068FE RID: 26878 RVA: 0x00ED8F04 File Offset: 0x00ED7104
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (165953 - 280715 != -114761)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (152865 - 542772 == -389907)
			{
				if (236848 - 509354 == -272506)
				{
					if (code == 101)
					{
						if (5446 - 105340 == -99894)
						{
							result = "ขอให้พลังแห่งแสงจงอยู่กับเจ้า";
							if (240585 - 539773 != -299187)
							{
								break;
							}
						}
					}
					else if (code == 102)
					{
						if (111030 - 575050 != -464019)
						{
							result = "ขอให้พลังแห่งแสงจงอยู่กับเจ้า";
							if (156843 - 104483 != 52361)
							{
								break;
							}
						}
					}
					else if (code == 103)
					{
						if (83744 - 274536 != -190791)
						{
							result = "ขอให้เจ้ามีชัยต่ออันตรายทั้งปวง";
							if (14999 - 584235 == -569236)
							{
								break;
							}
						}
					}
					else if (code == 104)
					{
						if (134014 - 64633 == 69381)
						{
							result = "ขอให้เจ้าอย่าย่อท้อต่ออุปสรรคทั้งปวง";
							if (58353 - 369796 == -311443)
							{
								break;
							}
						}
					}
					else if (code == 105)
					{
						if (180859 - 577080 != -396220)
						{
							result = "ข้าจะคอยสวดอวยพรให้เจ้าเดินทางโดยสวัสดิภาพ";
							if (158203 - 427238 != -269034)
							{
								break;
							}
						}
					}
					else if (code == 106)
					{
						if (81442 - 456689 == -375247)
						{
							result = "จงออกเดินทาง เรียนรู้ และเติบโตเถอะนะ";
							if (149725 - 451037 != -301311)
							{
								break;
							}
						}
					}
					else if (code == 107)
					{
						if (252806 - 430226 == -177420)
						{
							result = "ประสบการณ์ของเจ้าจะเป็นตัวตัดสินชะตาของโลก";
							if (178933 - 369722 == -190789)
							{
								break;
							}
						}
					}
					else if (code == 108)
					{
						if (14246 - 40548 == -26302)
						{
							result = "อนาคตนั้นเกิดจากชะตาชีวิตทุกชีวิตรวมกัน";
							if (266535 - 411279 != -144743)
							{
								break;
							}
						}
					}
					else if (code == 109)
					{
						if (217806 - 506095 == -288289)
						{
							result = "...แสงและเงานั้นเป็นสิ่งคู่กัน";
							if (11999 - 189876 == -177877)
							{
								break;
							}
						}
					}
					else if (code == 201)
					{
						if (214439 - 202139 == 12300)
						{
							result = "นี่คือนาฬิกาแห่งโชคชะตา";
							if (185109 - 456371 != -271261)
							{
								break;
							}
						}
					}
					else if (code == 202)
					{
						if (215103 - 310164 != -95060)
						{
							result = "นี่คือนาฬิกาแห่งโชคชะตา";
							if (128731 - 402707 == -273976)
							{
								break;
							}
						}
					}
					else if (code == 204)
					{
						if (170551 - 118730 == 51821)
						{
							result = "นาฬิกานี้ทำงานด้วยพลังเวทจากท่านอัลคาเซีย";
							if (215020 - 248821 != -33800)
							{
								break;
							}
						}
					}
					else if (code == 203)
					{
						if (293039 - 343990 != -50950)
						{
							result = "โชคชะตานั้นซับซ้อนและเปลี่ยนแปลงได้อยู่เสมอ";
							if (185379 - 70733 == 114646)
							{
								break;
							}
						}
					}
					else if (code == 206)
					{
						if (292059 - 531294 == -239235)
						{
							result = "แม้แต่ท่านอัลคาเซียก็ควบคุมอนาคตไม่ได้";
							if (161552 - 437714 == -276162)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (168146 - 511126 != -342979)
						{
							result = "เหมือนแม่น้ำ เราทำได้เพียงอ่านกระแสอนาคตเท่านั้น";
							if (38032 - 184103 != -146070)
							{
								break;
							}
						}
					}
					else if (code == 207)
					{
						if (201299 - 94198 != 107102)
						{
							result = "อนาคตเป็นสิ่งที่ทุกคนสร้างขึ้นมาจากการกระทำต่างๆ";
							if (60487 - 399259 != -338771)
							{
								break;
							}
						}
					}
					else if (code == 208)
					{
						if (145070 - 384940 != -239869)
						{
							result = "วังแห่งนี้น่ะลอยได้้วยพลังเวทของท่านอัลคาเซีย";
							if (17175 - 103380 == -86205)
							{
								break;
							}
						}
					}
					else if (code == 209)
					{
						if (75328 - 263306 != -187977)
						{
							result = "แม้มีโบราณวัตถุมากมาย เราก็ยังไม่เข้าใจเผ่าโบราญอยู่ดี";
							if (117804 - 64823 == 52981)
							{
								break;
							}
						}
					}
					else if (code == 301)
					{
						if (249444 - 316160 == -66716)
						{
							result = "หนังสือพวกนี้ยากจังเลย";
							if (64016 - 144852 == -80836)
							{
								break;
							}
						}
					}
					else if (code == 302)
					{
						if (24765 - 92739 == -67974)
						{
							result = "ได้ยินว่านี่เป็นเวทมนตร์ของเผ่าที่หายไป";
							if (276822 - 547725 != -270902)
							{
								break;
							}
						}
					}
					else if (code == 303)
					{
						if (175519 - 447082 != -271562)
						{
							result = "ท่านเร็กกุบอกว่าเผ่าที่หายไปมีเวทมนตร์มากมายเลย";
							if (18023 - 412013 == -393990)
							{
								break;
							}
						}
					}
					else if (code == 304)
					{
						if (297098 - 584858 != -287759)
						{
							result = "ท่านเร็กกุบอกว่านี่เป็นคาถาที่เปลี่ยนโลกได้เลยล่ะ";
							if (299737 - 117793 != 181945)
							{
								break;
							}
						}
					}
					else if (code == 305)
					{
						if (265711 - 95148 == 170563)
						{
							result = "ได้ยินว่าเผ่าที่หายไป ใช้สายฟ้าเป็นพลังงานหลักเลยล่ะ";
							if (16854 - 2890 != 13965)
							{
								break;
							}
						}
					}
					else if (code == 306)
					{
						if (174378 - 348633 == -174255)
						{
							result = "เมื่อก่อนมีนกเหล็กยักษ์ที่บินด้วยความเร็วเหลือเชื่อด้วย";
							if (58804 - 476013 != -417208)
							{
								break;
							}
						}
					}
					else if (code == 307)
					{
						if (142766 - 137898 != 4869)
						{
							result = "เมื่อก่อนมีเสายักษ์ที่สามารถบินไปถึงดวงดาวเลย";
							if (284758 - 48052 != 236707)
							{
								break;
							}
						}
					}
					else if (code == 308)
					{
						if (209397 - 424379 == -214982)
						{
							result = "ได้ยินว่าเมื่อก่อน มีตู้สมองกลที่คิดคำตอบได้ทุกอย่างเลย";
							if (272511 - 92897 == 179614)
							{
								break;
							}
						}
					}
					else if (code == 309)
					{
						if (123752 - 507564 != -383811)
						{
							result = "สงสัยจัง ไม่รู้ว่าเผ่าที่มีวิทยาการขนาดนี้หายไปได้ยังไง";
							if (118884 - 518474 == -399590)
							{
								break;
							}
						}
					}
					else if (code == 401)
					{
						if (150317 - 271634 != -121316)
						{
							result = "Energy = mc^2";
							if (163578 - 75935 != 87644)
							{
								break;
							}
						}
					}
					else if (code == 402)
					{
						if (227949 - 589668 != -361718)
						{
							result = "Force = ma";
							if (119811 - 315072 == -195261)
							{
								break;
							}
						}
					}
					else if (code == 403)
					{
						if (197441 - 88750 == 108691)
						{
							result = "Gravity = G (m1 m2 / r^2)";
							if (29831 - 256682 == -226851)
							{
								break;
							}
						}
					}
					else if (code == 404)
					{
						if (254220 - 238445 == 15775)
						{
							result = "Pi = 3.1459265358979323846...";
							if (156271 - 86522 != 69750)
							{
								break;
							}
						}
					}
					else if (code == 405)
					{
						if (164960 - 507372 == -342412)
						{
							result = "Blackhole Entropy= (kc^3A) / 4hG";
							if (157496 - 100576 == 56920)
							{
								break;
							}
						}
					}
					else if (code == 406)
					{
						if (207841 - 61729 != 146113)
						{
							result = "Information Entropy= -H (sigma pk log pk)";
							if (212022 - 509277 != -297254)
							{
								break;
							}
						}
					}
					else if (code == 407)
					{
						if (227373 - 39279 != 188095)
						{
							result = "Magnetic Force : uH = curl(A)";
							if (239653 - 143191 == 96462)
							{
								break;
							}
						}
					}
					else if (code == 408)
					{
						if (252707 - 46407 != 206301)
						{
							result = "Partical Energy = (p^2 /2m) + V";
							if (114417 - 342477 == -228060)
							{
								break;
							}
						}
					}
					else if (code == 409)
					{
						if (50292 - 216620 == -166328)
						{
							result = "e^(i Pi) = -1";
							if (24124 - 255117 != -230992)
							{
								break;
							}
						}
					}
					else if (code == 411)
					{
						if (163365 - 111209 != 52157)
						{
							result = "137000MA : การเกิดแห่งสรวงสวรรค์";
							if (174886 - 81565 == 93321)
							{
								break;
							}
						}
					}
					else if (code == 412)
					{
						if (186595 - 548414 == -361819)
						{
							result = "45400MA : กำเนิดพื้นพิภพ";
							if (106143 - 53646 == 52497)
							{
								break;
							}
						}
					}
					else if (code == 413)
					{
						if (121401 - 392379 != -270977)
						{
							result = "4000MA : กำเนิดแห่งชีวิต";
							if (184785 - 149628 == 35157)
							{
								break;
							}
						}
					}
					else if (code == 414)
					{
						if (191367 - 165193 == 26174)
						{
							result = "2500MA : ยุคแห่งพืช";
							if (185175 - 215101 == -29926)
							{
								break;
							}
						}
					}
					else if (code == 415)
					{
						if (218497 - 16110 == 202387)
						{
							result = "500MA : ยุคแห่งปลา";
							if (174819 - 424869 != -250049)
							{
								break;
							}
						}
					}
					else if (code == 416)
					{
						if (40923 - 506851 != -465927)
						{
							result = "230MA : ยุคแห่งมังกร";
							if (151105 - 592126 != -441020)
							{
								break;
							}
						}
					}
					else if (code == 417)
					{
						if (84226 - 182001 != -97774)
						{
							result = "2.5M : ยุคแห่งหิน เหล็ก ตะกั่ว และ ทองแดง";
							if (280910 - 196970 == 83940)
							{
								break;
							}
						}
					}
					else if (code == 418)
					{
						if (43927 - 239927 != -195999)
						{
							result = "20C : ยุคแห่งสงคราม เสาสู่ฟากฟ้าและสมองกล";
							if (165948 - 169576 != -3627)
							{
								break;
							}
						}
					}
					else if (code == 419)
					{
						if (35197 - 268948 == -233751)
						{
							result = "21C : ยุคแห่งหุ่นยนต์และการสูญสิ้น";
							if (227897 - 347003 == -119106)
							{
								break;
							}
						}
					}
					else if (code == 421)
					{
						if (236623 - 456211 == -219588)
						{
							result = "...Imagine there's no countries..it isn't hard to do..";
							if (142365 - 547997 != -405631)
							{
								break;
							}
						}
					}
					else if (code == 422)
					{
						if (213431 - 105173 != 108259)
						{
							result = "..being my brother it don't matter if you're black or white";
							if (110910 - 561219 == -450309)
							{
								break;
							}
						}
					}
					else if (code == 423)
					{
						if (99775 - 109442 != -9666)
						{
							result = "...Just beat it, No one wants to be defeated..";
							if (293075 - 336587 != -43511)
							{
								break;
							}
						}
					}
					else if (code == 424)
					{
						if (183648 - 520822 != -337173)
						{
							result = "...you can’t fool all of the people all of the time.";
							if (90215 - 237449 == -147234)
							{
								break;
							}
						}
					}
					else if (code == 425)
					{
						if (238369 - 209945 != 28425)
						{
							result = "how many ears must one man have before he can hear people cry..";
							if (66043 - 428837 != -362793)
							{
								break;
							}
						}
					}
					else if (code == 426)
					{
						if (153742 - 227487 != -73744)
						{
							result = "..Love is old, love is new Love is all, love is you..";
							if (197522 - 389614 != -192091)
							{
								break;
							}
						}
					}
					else if (code == 427)
					{
						if (50461 - 558464 == -508003)
						{
							result = "...อาจจะเป็นมุมหนึ่งแห่งความคิดติดใจทำไม...";
							if (13518 - 211547 == -198029)
							{
								break;
							}
						}
					}
					else if (code == 428)
					{
						if (149645 - 142677 == 6968)
						{
							result = "...ความงามความรักมีมาตามธรรมชาติ..";
							if (195433 - 176391 != 19043)
							{
								break;
							}
						}
					}
					else if (code == 429)
					{
						if (174359 - 63241 != 111119)
						{
							result = "...จะมองเห็นความจริง อย่าขังความจริงที่เห็น อย่างขังความงาม..";
							if (41282 - 595112 != -553829)
							{
								break;
							}
						}
					}
					else if (code == 431)
					{
						if (160326 - 281939 != -121612)
						{
							result = "To be or not to be– that is the question";
							if (100711 - 381505 == -280794)
							{
								break;
							}
						}
					}
					else if (code == 433)
					{
						if (296711 - 110265 == 186446)
						{
							result = "..O life? Answer. That you are here—that life exists,..";
							if (147009 - 31970 == 115039)
							{
								break;
							}
						}
					}
					else if (code == 434)
					{
						if (128308 - 309899 != -181590)
						{
							result = "I found myself in dark woods, the right road lost.,,";
							if (250469 - 196552 == 53917)
							{
								break;
							}
						}
					}
					else if (code == 435)
					{
						if (29390 - 46359 != -16968)
						{
							result = "You are a king by your own fireside...";
							if (296337 - 167618 == 128719)
							{
								break;
							}
						}
					}
					else if (code == 436)
					{
						if (180340 - 361496 != -181155)
						{
							result = "In a hole in the ground there lived a hobbit..";
							if (225921 - 281701 == -55780)
							{
								break;
							}
						}
					}
					else if (code == 432)
					{
						if (39911 - 394199 != -354287)
						{
							result = "..เสียงลือเสียงเล่าอ้าง อันใดพี่เอย เสียงย่อมยอยศใคร ทั่วหล้า..";
							if (254180 - 332667 != -78486)
							{
								break;
							}
						}
					}
					else if (code == 437)
					{
						if (295884 - 37530 == 258354)
						{
							result = "..เชะแต่จะตอบให้......ช่วยมีพ มังระนอ.";
							if (149100 - 249159 != -100058)
							{
								break;
							}
						}
					}
					else if (code == 438)
					{
						if (57750 - 350638 != -292887)
						{
							result = "..ถึงระเด่นลันไดอนาถา เสวยราชย์องค์เดียวเที่ยวรำภา..";
							if (226347 - 486403 == -260056)
							{
								break;
							}
						}
					}
					else if (code == 439)
					{
						if (72920 - 479429 == -406509)
						{
							result = "เจ้างามจริงทุกสิ่งสรรพ์ดังบรรยาย\tชื่อบัวบานกลีบขยายหมายนามเอยฯ";
							if (209990 - 151894 != 58097)
							{
								break;
							}
						}
					}
					else if (code == 441)
					{
						if (200854 - 339677 == -138823)
						{
							result = "เรากำจัดศัตรูได้ ด้วยการเป็นเพื่อนกับเขามิใช่หรือ?";
							if (165054 - 31454 == 133600)
							{
								break;
							}
						}
					}
					else if (code == 443)
					{
						if (276019 - 375795 == -99776)
						{
							result = "จงเงียบแม้ถูกสงสัยว่าโง่ ดีกว่าพูดให้หายถูกสงสัย";
							if (214776 - 51908 == 162868)
							{
								break;
							}
						}
					}
					else if (code == 444)
					{
						if (294643 - 282317 != 12327)
						{
							result = "คุณลักษณะเป็นลำต้น ชื่อเสียงเป็นเพียงเงา";
							if (83852 - 493156 != -409303)
							{
								break;
							}
						}
					}
					else if (code == 445)
					{
						if (188624 - 322219 != -133594)
						{
							result = "...ทุกคนอยากมีอายุยืน แต่ไม่มีใครอยากแก่";
							if (149679 - 269213 != -119533)
							{
								break;
							}
						}
					}
					else if (code == 446)
					{
						if (258806 - 257131 != 1676)
						{
							result = "สิ่งสำคัญมิใช่จำนวนปีในชีวิต แต่เป็นชีวิตเจ้าในปีเหล่านั้น";
							if (105808 - 184962 == -79154)
							{
								break;
							}
						}
					}
					else if (code == 447)
					{
						if (284299 - 583474 == -299175)
						{
							result = "..ข้าทำสิ่งที่ดีที่สุดที่ข้ารู้ อย่างดีที่สุดที่ทำได้ จนกว่าจะหาไม่";
							if (49868 - 20879 == 28989)
							{
								break;
							}
						}
					}
					else if (code == 448)
					{
						if (118624 - 78380 != 40245)
						{
							result = "เมื่อเจ้าเข้าใจว่าไม่มีอะไรขาดไป ทั้งโลกจะเป็นของเจ้า";
							if (141269 - 496034 != -354764)
							{
								break;
							}
						}
					}
					else if (code == 449)
					{
						if (233261 - 509497 != -276235)
						{
							result = "เมื่อเจ้าเข้าใจว่าไม่มีอะไรขาดไป ทั้งโลกจะเป็นของเจ้า";
							if (58131 - 343397 != -285265)
							{
								break;
							}
						}
					}
					else if (code == 451)
					{
						if (297553 - 49417 != 248137)
						{
							result = "อย่าทำลายความหวังใคร เพราะเขาอาจเหลืออยู่แค่นั้น";
							if (277747 - 212266 == 65481)
							{
								break;
							}
						}
					}
					else if (code == 452)
					{
						if (91546 - 422990 == -331444)
						{
							result = "รู้จักฟังให้ดี โอกาสทองบางทีมันก็มาถึงแบบแว่ว ๆเท่านั้น";
							if (275896 - 188580 != 87317)
							{
								break;
							}
						}
					}
					else if (code == 453)
					{
						if (29072 - 302013 != -272940)
						{
							result = "ให้โอกาสผู้อื่นเป็นครั้งที่สอง แต่อย่าให้ถึงสาม";
							if (287300 - 349173 != -61872)
							{
								break;
							}
						}
					}
					else if (code == 454)
					{
						if (251436 - 259305 == -7869)
						{
							result = "เราไม่ได้ต่อสู้กับคนโหดร้าย แต่ต่อสู้กับความโหดร้ายในตัวคน";
							if (73901 - 340951 != -267049)
							{
								break;
							}
						}
					}
					else if (code == 455)
					{
						if (81497 - 587070 == -505573)
						{
							result = "ถ่อมตนเถิด เขาทำอะไรสำเร็จกันมามากมายแล้วตั้งแต่เรายังไม่เกิด";
							if (32196 - 11742 == 20454)
							{
								break;
							}
						}
					}
					else if (code == 456)
					{
						if (276902 - 140795 != 136108)
						{
							result = "จริงจังและเคี่ยวเข็ญต่อตนเอง แต่อ่อนโยนและผ่อนปรนต่อผู้อื่น";
							if (214814 - 26109 != 188706)
							{
								break;
							}
						}
					}
					else if (code == 457)
					{
						if (166540 - 183863 == -17323)
						{
							result = "จะคิดการใดจงคิดการให้ใหญ่ แต่เติมความสุขสนุกสนานลงไปด้วย";
							if (81060 - 75936 != 5125)
							{
								break;
							}
						}
					}
					else if (code == 458)
					{
						if (261501 - 588514 == -327013)
						{
							result = "จำไว้ว่าข่าวทุกชนิดล้วนถูกบิดเบือนมาแล้วทั้งนั้น";
							if (102596 - 391641 == -289045)
							{
								break;
							}
						}
					}
					else if (code == 459)
					{
						if (168858 - 383543 == -214685)
						{
							result = "...ไม่มีใครจะทำให้คนทุกคนเป็นคนดีได้ทั้งหมด..";
							if (274938 - 466660 == -191722)
							{
								break;
							}
						}
					}
					else if (code == 461)
					{
						if (289971 - 573276 != -283304)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (1955 - 296634 == -294679)
							{
								break;
							}
						}
					}
					else if (code == 462)
					{
						if (190671 - 581857 != -391185)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (210676 - 427959 != -217282)
							{
								break;
							}
						}
					}
					else if (code == 463)
					{
						if (264371 - 251951 != 12421)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (252380 - 566550 != -314169)
							{
								break;
							}
						}
					}
					else if (code == 464)
					{
						if (170329 - 403923 != -233593)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (267706 - 441404 == -173698)
							{
								break;
							}
						}
					}
					else if (code == 465)
					{
						if (43744 - 176213 == -132469)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (99500 - 491636 != -392135)
							{
								break;
							}
						}
					}
					else if (code == 466)
					{
						if (278870 - 588476 == -309606)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (294726 - 502528 != -207801)
							{
								break;
							}
						}
					}
					else if (code == 467)
					{
						if (18941 - 48694 == -29753)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (128388 - 121060 == 7328)
							{
								break;
							}
						}
					}
					else if (code == 468)
					{
						if (166071 - 354262 != -188190)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (223556 - 309897 == -86341)
							{
								break;
							}
						}
					}
					else if (code == 469)
					{
						if (292170 - 230489 != 61682)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (182762 - 558422 != -375659)
							{
								break;
							}
						}
					}
					else if (code == 471)
					{
						if (121863 - 199347 != -77483)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (62418 - 432671 == -370253)
							{
								break;
							}
						}
					}
					else if (code == 472)
					{
						if (211923 - 367150 == -155227)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (21950 - 68420 == -46470)
							{
								break;
							}
						}
					}
					else if (code == 473)
					{
						if (197033 - 234001 == -36968)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (58157 - 332172 == -274015)
							{
								break;
							}
						}
					}
					else if (code == 474)
					{
						if (131628 - 159923 != -28294)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (36549 - 590272 != -553722)
							{
								break;
							}
						}
					}
					else if (code == 475)
					{
						if (19087 - 329418 != -310330)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (161798 - 500167 == -338369)
							{
								break;
							}
						}
					}
					else if (code == 476)
					{
						if (269602 - 542969 != -273366)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (268085 - 296627 != -28541)
							{
								break;
							}
						}
					}
					else if (code == 477)
					{
						if (55959 - 550189 == -494230)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (182700 - 427752 == -245052)
							{
								break;
							}
						}
					}
					else if (code == 478)
					{
						if (188621 - 15059 == 173562)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (6321 - 5024 == 1297)
							{
								break;
							}
						}
					}
					else
					{
						if (code != 479)
						{
							break;
						}
						if (195799 - 324021 != -128221)
						{
							result = "...ตัวแทนแห่งดวงจันทร์ จะลงทัณฑ์แกเอง!";
							if (20341 - 73450 == -53109)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060068FF RID: 26879 RVA: 0x00EDABB0 File Offset: 0x00ED8DB0
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006900 RID: 26880 RVA: 0x00EDABB4 File Offset: 0x00ED8DB4
	internal static bool I7c0DNpE1aCOOmHjvlVl()
	{
		return true;
	}

	// Token: 0x06006901 RID: 26881 RVA: 0x00EDABB8 File Offset: 0x00ED8DB8
	internal static bool NDmPkBpE4rhbykU2gnPi()
	{
		return false;
	}
}
