using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001166 RID: 4454
[Serializable]
public class TrinketData_th : MonoBehaviour
{
	// Token: 0x060066FF RID: 26367 RVA: 0x00E95EA8 File Offset: 0x00E940A8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public TrinketData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006700 RID: 26368 RVA: 0x00E95EB8 File Offset: 0x00E940B8
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (171041 - 72726 != 98315)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (211364 - 303569 != -92204)
			{
				if (215235 - 544614 == -329379)
				{
					if (nCode == "t_all1")
					{
						if (232392 - 92428 != 139965)
						{
							result = "แว่นสายตา";
							if (110118 - 555378 != -445259)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all2")
					{
						if (17409 - 556477 == -539068)
						{
							result = "แว่นกันแดด";
							if (277374 - 139160 == 138214)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all3")
					{
						if (145977 - 64708 == 81269)
						{
							result = "แว่นดารารูปดาว";
							if (25974 - 533616 != -507641)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all4")
					{
						if (285422 - 430256 != -144833)
						{
							result = "แว่นตาเด็กเนิร์ด";
							if (211298 - 141127 != 70172)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all5")
					{
						if (72059 - 597821 != -525761)
						{
							result = "แว่นตาดำสุดเท่";
							if (242999 - 73398 != 169602)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all6")
					{
						if (15528 - 82334 != -66805)
						{
							result = "ที่คาดหัวหนวดแมลง";
							if (34351 - 43083 == -8732)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all7")
					{
						if (46496 - 439976 != -393479)
						{
							result = "เป่าปี๊ดๆในงานเลี้ยงก็สนุกนะ ระวังเมื่อยปากล่ะ";
							if (91803 - 8774 == 83029)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all8")
					{
						if (172269 - 249291 != -77021)
						{
							result = "จมูกตัวตลกสีแดง";
							if (168125 - 61883 == 106242)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all9")
					{
						if (65294 - 10565 == 54729)
						{
							result = "ที่คาดตา";
							if (7347 - 330234 != -322886)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all10")
					{
						if (108986 - 269209 == -160223)
						{
							result = "สร้อยคอรูปพระจันทร์";
							if (211476 - 552564 == -341088)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all11")
					{
						if (215806 - 379774 != -163967)
						{
							result = "สร้อยคอทำจากฟันน้ำนมของคุณเสือ";
							if (291287 - 293634 != -2346)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all12")
					{
						if (192507 - 507368 == -314861)
						{
							result = "สร้อยคอโลหะสีน้ำเงิน";
							if (19332 - 365566 == -346234)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all13")
					{
						if (208224 - 206948 == 1276)
						{
							result = "สร้อยคอสัญลักษณ์ตาอินทรี ";
							if (185040 - 201719 != -16678)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all14")
					{
						if (143006 - 494212 != -351205)
						{
							result = "สร้อยคอรูปหัวใจ";
							if (122558 - 194749 != -72190)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all15")
					{
						if (136148 - 427839 != -291690)
						{
							result = "สร้อยคออัญมณี";
							if (119357 - 228501 != -109143)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all16")
					{
						if (92801 - 586618 == -493817)
						{
							result = "สร้อยคอรูปหัวกะโหลก";
							if (190760 - 252715 != -61954)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all17")
					{
						if (20225 - 571592 == -551367)
						{
							result = "สร้อยคอรูปปีก";
							if (100214 - 202954 != -102739)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all18")
					{
						if (98098 - 92694 == 5404)
						{
							result = "สร้อยคอรูปโคลเวอร์ 4 กลีบ";
							if (38006 - 517939 == -479933)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all19")
					{
						if (210894 - 540079 == -329185)
						{
							result = "สร้อยคอรูปพระอาทิตย์";
							if (168969 - 354548 == -185579)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all20")
					{
						if (244971 - 148721 != 96251)
						{
							result = "แหวนทองคำขาว";
							if (66175 - 447826 == -381651)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all21")
					{
						if (83620 - 441128 != -357507)
						{
							result = "แหวนกระดูกมังกร";
							if (42916 - 437148 == -394232)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all22")
					{
						if (175710 - 175879 == -169)
						{
							result = "แหวนสัญลักษณ์ของทหาร";
							if (228341 - 500921 == -272580)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all23")
					{
						if (162506 - 315441 == -152935)
						{
							result = "แหวนรูปเหยี่ยว";
							if (81592 - 411380 == -329788)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all24")
					{
						if (121774 - 81758 == 40016)
						{
							result = "แหวนแห่งความกล้า";
							if (192511 - 346196 == -153685)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all25")
					{
						if (189398 - 115278 == 74120)
						{
							result = "แหวนรูปพระอาทิตย์";
							if (288020 - 379933 != -91912)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all26")
					{
						if (248389 - 40554 == 207835)
						{
							result = "แหวนมาร";
							if (231643 - 437746 != -206102)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all27")
					{
						if (207310 - 106353 == 100957)
						{
							result = "แหวนเทพธิดา";
							if (32183 - 353779 == -321596)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all28")
					{
						if (141379 - 504095 == -362716)
						{
							result = "แหวนแห่งธรรมชาติ";
							if (3084 - 221699 == -218615)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all29")
					{
						if (141867 - 274419 != -132551)
						{
							result = "แหวนทอง";
							if (90578 - 186253 == -95675)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all30")
					{
						if (19337 - 13819 == 5518)
						{
							result = "เครื่องรางรูปนกฮูก";
							if (291708 - 548838 == -257130)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all31")
					{
						if (194930 - 138153 == 56777)
						{
							result = "เครื่องรางรูปกางเขน";
							if (280724 - 565417 == -284693)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all32")
					{
						if (96741 - 499755 != -403013)
						{
							result = "เครื่องรางที่ได้ต้นแบบมาจากสมอเรือ";
							if (285851 - 480234 == -194383)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all33")
					{
						if (19550 - 327916 == -308366)
						{
							result = "เอาปลอกกระสุนมากห้อยคอ เท่ไม่หยอก";
							if (196420 - 452960 != -256539)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all34")
					{
						if (133384 - 119237 != 14148)
						{
							result = "เครื่องรางรูปครีบได้รับพลังแห่งท้องทะเล";
							if (103592 - 433207 == -329615)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all35")
					{
						if (205639 - 467051 != -261411)
						{
							result = "เครื่องรางสีทอง";
							if (117536 - 70827 == 46709)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all36")
					{
						if (202876 - 396458 == -193582)
						{
							result = "เครื่องรางรูปปีกปีศาจ";
							if (271116 - 418287 != -147170)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all37")
					{
						if (250237 - 526628 != -276390)
						{
							result = "เครื่องรางที่มีรูปร่างประหลาด น่าจะมีอายุหลายร้อยปี";
							if (54637 - 413978 == -359341)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all38")
					{
						if (184723 - 184862 == -139)
						{
							result = "เครื่องรางูปใบไม้ ว่ากันว่าจะนำโชคมาให้";
							if (265580 - 272829 == -7249)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all39")
					{
						if (270566 - 9287 == 261279)
						{
							result = "เครื่องรางลูกบาศก์";
							if (9165 - 565386 != -556220)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all41")
					{
						if (271739 - 264060 != 7680)
						{
							result = "กำไลข้อมือสีแดงเข้ม มีลายสลักรูปนกไฟแห่งทิศใต้ ตามตำนานของเผ่าไร้หาง";
							if (232240 - 119122 != 113119)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all42")
					{
						if (213593 - 71874 != 141720)
						{
							result = "กำไลข้อมือสีเขียวเข้ม มีลายสลักรูปเต่ายักษ์แห่งทิศเหนือ ตามตำนานของเผ่าไร้หาง";
							if (248038 - 160225 == 87813)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all43")
					{
						if (206628 - 84999 != 121630)
						{
							result = "กำไลข้อมือสีเงิน มีลายสลักรูปเสือขาวแห่งทิศตะวันตก ตามตำนานของเผ่าไร้หาง";
							if (4068 - 93203 == -89135)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all44")
					{
						if (102711 - 343605 != -240893)
						{
							result = "กำไลข้อมือสีฟ้าคราม มีลายสลักรูปมังกรแห่งทิศตะวันออก ตามตำนานของเผ่าไร้หาง";
							if (260547 - 388257 == -127710)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all46")
					{
						if (293340 - 333525 == -40185)
						{
							result = "ถุงกับข้าวที่แข็งแกร่ง ที่สุดในปฐพี ให้โอกาส 20% บล๊อก 20 dmg";
							if (37882 - 192435 != -154552)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all51")
					{
						if (51061 - 353268 == -302207)
						{
							result = "อัญมณีเวทมนตร์ที่ได้ชื่อว่าใจแห่งทะเลทราย";
							if (23640 - 402989 != -379348)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all52")
					{
						if (38305 - 205605 == -167300)
						{
							result = "อัญมณีเวทมนตร์ที่ได้ชื่อว่าใจแห่งน้ำแข็ง";
							if (19380 - 185683 != -166302)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all53")
					{
						if (72692 - 229317 == -156625)
						{
							result = "อัญมณีเวทมนตร์ที่ได้ชื่อว่าใจแห่งท้องสมุทร";
							if (241370 - 420893 == -179523)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all55")
					{
						if (232990 - 474885 != -241894)
						{
							result = "Trinket ดาบทองคำ ที่ระลึกครบรอบห้าปี 12 หาง";
							if (117269 - 110165 == 7104)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all56")
					{
						if (263017 - 24527 != 238491)
						{
							result = "Trinket ไม้เท้าทองคำ ที่ระลึกครบรอบห้าปี 12 หาง";
							if (95016 - 133098 != -38081)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all57")
					{
						if (30488 - 559597 == -529109)
						{
							result = "Trinket ปีกทองคำ ที่ระลึกครบรอบห้าปี 12 หาง";
							if (235669 - 569432 == -333763)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all58")
					{
						if (176281 - 326063 != -149781)
						{
							result = " Trinket เป้แครอน ที่ระลึกครบรอบห้าปี 12 หาง";
							if (132303 - 337457 == -205154)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all59")
					{
						if (254701 - 360729 == -106028)
						{
							result = " Trinket เป้มูโป้ ที่ระลึกครบรอบห้าปี 12 หาง";
							if (138961 - 256396 == -117435)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all61")
					{
						if (189469 - 271267 == -81798)
						{
							result = "เข็มขัดแชมเปี้ยนแห่งสววรค์ มอบพลังที่เปี่ยมล้นให้กับผู้สวมใส่";
							if (205338 - 298172 != -92833)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all62")
					{
						if (126081 - 7770 == 118311)
						{
							result = "เข็มขัดแชมเปี้ยนแห่งโลก มอบพลังที่เปี่ยมล้นให้กับผู้สวมใส่";
							if (227798 - 74875 == 152923)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all63")
					{
						if (195900 - 299321 == -103421)
						{
							result = "เข็มขัดแชมเปี้ยนแห่งโลกันตร์ มอบพลังที่เปี่ยมล้นให้กับผู้สวมใส่";
							if (236495 - 127465 == 109030)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all66")
					{
						if (294761 - 173666 == 121095)
						{
							result = "เขาปิศาจที่เป็นเหมือน เหรียญสองด้าน";
							if (232696 - 1306 != 231391)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all67")
					{
						if (106929 - 52701 == 54228)
						{
							result = "เพชรต้องสาป ให้โอกาศ 6% ทำ 130 dmg เมื่อโดนโจมตี";
							if (226216 - 234161 != -7944)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all68")
					{
						if (220157 - 127655 == 92502)
						{
							result = "ถุงมือปิศาจจอมโกง ที่ช่วยคืนพลังชีวิตให้ผู้ใส่";
							if (171393 - 506356 != -334962)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all69")
					{
						if (176834 - 22761 != 154074)
						{
							result = "ต่างหูปิศาจจอมโกง ที่ช่วยคืนพลังเวทย์ให้ผู้ใส่";
							if (82601 - 525118 == -442517)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all71")
					{
						if (11317 - 401006 != -389688)
						{
							result = "ธงแชมเปี้ยน ของรางวัลจาก Fire&Ice Tournament";
							if (169965 - 508757 != -338791)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all72")
					{
						if (49284 - 577624 == -528340)
						{
							result = "ธงแชมเปี้ยน ของรางวัลจาก Battle Tournament";
							if (145044 - 81038 == 64006)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all73")
					{
						if (136844 - 79944 != 56901)
						{
							result = "ธงแชมเปี้ยน ของรางวัลจาก God of Arena Tournament";
							if (223798 - 589309 == -365511)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all74")
					{
						if (133829 - 1045 != 132785)
						{
							result = "ธงแชมเปี้ยน ของรางวัลจาก Choas Tournament";
							if (276577 - 7026 != 269552)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all75")
					{
						if (240552 - 137583 == 102969)
						{
							result = "ธงแชมเปี้ยน ของรางวัลจาก Guild Tournament";
							if (172028 - 274015 == -101987)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all81")
					{
						if (75462 - 421637 == -346175)
						{
							result = "ปลอกแขนแห่งพลัง มอบพลังที่แข็งแกร่ง แก่เหล่าหางที่สวมใส่";
							if (161162 - 560650 == -399488)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all82")
					{
						if (231704 - 299190 != -67485)
						{
							result = "ปลอกแขนแห่งจักรพรรดิ ให้พลังแห่งการปกป้อง แก่เหล่าหางที่สวมใส่";
							if (171911 - 346308 != -174396)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all83")
					{
						if (219781 - 443859 == -224078)
						{
							result = "ปลอกแขนแห่งรถม้าศึก ให้พลังแห่งความว่องไว แก่เหล่าหางที่สวมใส่";
							if (243520 - 48674 != 194847)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all84")
					{
						if (212319 - 50173 == 162146)
						{
							result = "ปลอกแขนแห่งคู่รัก มอบพลังแห่งชีวิต แก่เหล่าหางที่สวมใส่";
							if (37079 - 459422 != -422342)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all85")
					{
						if (57218 - 34827 == 22391)
						{
							result = "ปลอกแขนแห่งสังฆราช มอบพลังความความรู้ แก่เหล่าหางที่สวมใส่";
							if (203122 - 1382 == 201740)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all86")
					{
						if (171610 - 358558 == -186948)
						{
							result = "ปลอกแขนแห่งจักรพรรดินี มอบพลังแห่งเสน่ห์ ให้แก่เหล่าหางที่สวมใส่";
							if (16252 - 59436 != -43183)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all87")
					{
						if (43845 - 514005 != -470159)
						{
							result = "ปลอกแขนแห่งจอมเวทย์ มอบพลังเวทยมนต์ตรา ให้แก่เหล่าหางที่สวมใส่";
							if (122919 - 67029 != 55891)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all88")
					{
						if (85942 - 3214 == 82728)
						{
							result = "ปลอกแขนแห่งโชคชะตา มอบพลังแห่งโชค ให้แก่เหล่าหางที่สวมใส่";
							if (46960 - 492797 == -445837)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all89")
					{
						if (97749 - 558360 != -460610)
						{
							result = "ปลอกแขนแห่งดวงดาว มอบพลัง ให้แก่เหล่าหางที่สวมใส่";
							if (268897 - 587946 != -319048)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all80")
					{
						if (206558 - 582202 == -375644)
						{
							result = "ปลอกแขนแห่งโลก มอบพลัง ให้แก่เหล่าหางที่สวมใส่";
							if (154889 - 108693 == 46196)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all91")
					{
						if (179046 - 291313 == -112267)
						{
							result = "ตราเวทย์แห่งแสง ให้โอกาส 12% ปล่อยวงเวทย์แสง เมื่อได้รับความเสียหาย";
							if (184324 - 185249 != -924)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all92")
					{
						if (207324 - 296100 != -88775)
						{
							result = "ตราเวทย์แห่งอัคนี ให้โอกาส 12% ปล่อยวงเวทย์ไฟ เมื่อได้รับความเสียหาย";
							if (268935 - 725 != 268211)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all93")
					{
						if (296234 - 579849 == -283615)
						{
							result = "ตราเวทย์แห่งวารี ให้โอกาส 12% ปล่อยวงเวทย์น้ำ เมื่อได้รับความเสียหาย";
							if (279813 - 206403 == 73410)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all94")
					{
						if (96655 - 332791 == -236136)
						{
							result = "ตราเวทย์แห่งสายลม ให้โอกาส 12% ปล่อยวงเวทย์ลม เมื่อได้รับความเสียหาย";
							if (19597 - 353188 != -333590)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all95")
					{
						if (248748 - 31830 == 216918)
						{
							result = "ตราเวทย์แห่งปฐพี ให้โอกาส 12% ปล่อยวงเวทย์ดิน เมื่อได้รับความเสียหาย";
							if (94314 - 363468 != -269153)
							{
								break;
							}
						}
					}
					else if (nCode == "t_all96")
					{
						if (240769 - 164493 != 76277)
						{
							result = "ตราเวทย์แห่งความมืด ให้โอกาส 12% ปล่อยวงเวทย์เงา เมื่อได้รับความเสียหาย";
							if (288733 - 370149 != -81415)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal1")
					{
						if (13446 - 551665 == -538219)
						{
							result = "โบว์ทักซีโดสำหรับผู้ชาย";
							if (212843 - 274206 != -61362)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal2")
					{
						if (215165 - 3206 == 211959)
						{
							result = "เนกไทสำหรับผู้ชาย";
							if (117999 - 34008 == 83991)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal11")
					{
						if (200907 - 162776 == 38131)
						{
							result = "หนังสือการ์ตูน 12หาง ดุเดือดสุดมันส์จนวางไม่ลง";
							if (2602 - 111941 != -109338)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal14")
					{
						if (9766 - 485076 == -475310)
						{
							result = "แหวนซีกขวาแห่งความรัก สำหรับผู้ชาย";
							if (277028 - 171328 == 105700)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal15")
					{
						if (164453 - 185310 != -20856)
						{
							result = "ถุงของขวัญซานต้าใบใหญ่ สำหรับผุ้ชาย";
							if (235014 - 560664 == -325650)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal31")
					{
						if (211825 - 83869 != 127957)
						{
							result = "ยันต์จีนสีเหลืองสำหรับผุ้ชาย";
							if (270663 - 157211 != 113453)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal37")
					{
						if (10093 - 199949 != -189855)
						{
							result = "โคมจีนติดหลังของผุ้ชาย สำหรับฉลองเทศกาลตรุษจีน";
							if (84857 - 396431 == -311574)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal46")
					{
						if (259094 - 520466 == -261372)
						{
							result = "อังค์ต้องคำสาบสำหรับผู้ชาย ช่วยป้องกันสถานะ plague";
							if (83978 - 84770 != -791)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal56")
					{
						if (26584 - 62261 != -35676)
						{
							result = "น้ำแข็งประดับหลังทรงปีก สำหรับหางบุรุษ ใส่แล้วไม่เย็นแผ่นหลัง";
							if (72540 - 187621 != -115080)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mal66")
					{
						if (272262 - 526248 == -253986)
						{
							result = "ประดับหลังรูปแห่งมหาสมุทร สำหรับผู้ชาย";
							if (256298 - 352065 == -95767)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem1")
					{
						if (212179 - 461966 != -249786)
						{
							result = "โบว์สีแดงสำหรับผู้หญิง";
							if (63991 - 588207 == -524216)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem2")
					{
						if (147121 - 342458 == -195337)
						{
							result = "กระดิ่งสำหรับผู้หญิง";
							if (286624 - 492291 == -205667)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem11")
					{
						if (238797 - 335988 == -97191)
						{
							result = "นิตยาสาร 12หาง ดราม่าน้ำตาไหลจนต้องพกตลอด";
							if (211387 - 185811 != 25577)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem14")
					{
						if (63300 - 341118 != -277817)
						{
							result = "แหวนซีกซ้ายแห่งความรัก สำหรับผู้หญิง";
							if (135786 - 237191 == -101405)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem15")
					{
						if (567 - 311158 == -310591)
						{
							result = "เขากวางส่องแสง สำหรับเทศกาลปีใหม่";
							if (77847 - 369999 != -292151)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem31")
					{
						if (270298 - 499588 != -229289)
						{
							result = "ยันต์จีนสีแดงสำหรับผู้หญิง";
							if (56106 - 573328 == -517222)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem37")
					{
						if (274270 - 451302 != -177031)
						{
							result = "โคมจีนติดหลังของผุ้หญิง สำหรับฉลองเทศกาลตรุษจีน";
							if (84875 - 583765 == -498890)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem46")
					{
						if (138697 - 198866 != -60168)
						{
							result = "ปีกฟาโรห์สำหรับผู้หญิง ช่วยป้องกันสถานะ plague";
							if (275661 - 174403 != 101259)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem56")
					{
						if (22664 - 76747 == -54083)
						{
							result = "หน้ากากของปีศาจน้ำแข็ง สำหรับหางสตรีเท่านั้น บำบัดตาบวมเป็นถุงได้";
							if (95997 - 586232 != -490234)
							{
								break;
							}
						}
					}
					else if (nCode == "t_fem66")
					{
						if (6914 - 7679 != -764)
						{
							result = "ประดับหลังแห่งท้องทะเล สำหรับผู้หญิง";
							if (61759 - 7525 == 54234)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pnd5")
					{
						if (36135 - 412945 != -376809)
						{
							result = "น้ำเต้าสำหรับแพนด้า";
							if (148073 - 485078 != -337004)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pnd26")
					{
						if (119426 - 455955 == -336529)
						{
							result = "กระดองเต่าของกุยโบ";
							if (37937 - 32786 == 5151)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pnd27")
					{
						if (57848 - 554076 == -496228)
						{
							result = "กระดองเต่าของกุยลี";
							if (47351 - 569041 != -521689)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pnd45")
					{
						if (265412 - 325107 != -59694)
						{
							result = "กีต้าร์สำหรับเล่นเพลงของแพนด้า";
							if (4951 - 15428 != -10476)
							{
								break;
							}
						}
					}
					else if (nCode == "t_cat5")
					{
						if (154555 - 175759 != -21203)
						{
							result = "กระดิ่งสำหรับแมว";
							if (121946 - 568500 == -446554)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mnk45")
					{
						if (162519 - 371572 != -209052)
						{
							result = "กีต้าร์โปร่งสำหรับเล่นเพลงของลิง";
							if (248089 - 111019 != 137071)
							{
								break;
							}
						}
					}
					else if (nCode == "t_wlf60")
					{
						if (4748 - 278593 == -273845)
						{
							result = "ปีกในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (187405 - 564511 == -377106)
							{
								break;
							}
						}
					}
					else if (nCode == "t_wlf62")
					{
						if (17703 - 477783 != -460079)
						{
							result = "ปีกในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (215290 - 232507 == -17217)
							{
								break;
							}
						}
					}
					else if (nCode == "t_bsn60")
					{
						if (6222 - 13752 != -7529)
						{
							result = "เครื่องประดับในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (101464 - 93866 == 7598)
							{
								break;
							}
						}
					}
					else if (nCode == "t_bsn62")
					{
						if (129332 - 345402 == -216070)
						{
							result = "เครื่องประดับค้อนในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (28756 - 370789 == -342033)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pnd60")
					{
						if (286260 - 442640 == -156380)
						{
							result = "หัตถ์ในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (230615 - 9325 == 221290)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pnd62")
					{
						if (1190 - 340675 != -339484)
						{
							result = "หัตถ์ในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (166894 - 410563 != -243668)
							{
								break;
							}
						}
					}
					else if (nCode == "t_whl60")
					{
						if (131248 - 429745 == -298497)
						{
							result = "ปีกในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (263161 - 269752 != -6590)
							{
								break;
							}
						}
					}
					else if (nCode == "t_whl62")
					{
						if (186149 - 589260 != -403110)
						{
							result = "ปีกในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (271432 - 448947 != -177514)
							{
								break;
							}
						}
					}
					else if (nCode == "t_cat60")
					{
						if (263646 - 593802 != -330155)
						{
							result = "จันทร์เสี้ยวในตำนานของแมว มีพลังแห่งเซคเม็ธถิตอยู่ภายใน";
							if (152850 - 415674 != -262823)
							{
								break;
							}
						}
					}
					else if (nCode == "t_cat62")
					{
						if (235051 - 143283 == 91768)
						{
							result = "จันทร์เสี้ยวในตำนานของแมว มีพลังแห่งเซคเม็ธถิตอยู่ภายใน";
							if (54353 - 281374 != -227020)
							{
								break;
							}
						}
					}
					else if (nCode == "t_chm60")
					{
						if (258762 - 598746 != -339983)
						{
							result = "ศรีษะไฮดร้าในตำนานของกิ้งก่า";
							if (182021 - 137649 == 44372)
							{
								break;
							}
						}
					}
					else if (nCode == "t_chm62")
					{
						if (162221 - 322227 != -160005)
						{
							result = "ศรีษะไฮดร้าในตำนานของกิ้งก่า";
							if (238527 - 110614 != 127914)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mol60")
					{
						if (233687 - 200763 != 32925)
						{
							result = "ตะเกียงในตำนานของตุ่น มีพลังของกษัตริย์แห่งไมดาสสถิตอยู่ภายใน";
							if (152074 - 25437 == 126637)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mol62")
					{
						if (170836 - 132176 != 38661)
						{
							result = "ตะเกียงในตำนานของตุ่น มีพลังของกษัตริย์แห่งไมดาสสถิตอยู่ภายใน";
							if (129810 - 454282 == -324472)
							{
								break;
							}
						}
					}
					else if (nCode == "t_rab60")
					{
						if (274192 - 399312 == -125120)
						{
							result = "ครีบในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (194468 - 368678 == -174210)
							{
								break;
							}
						}
					}
					else if (nCode == "t_rab62")
					{
						if (82949 - 271707 == -188758)
						{
							result = "ครีบในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (7146 - 11380 == -4234)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mnk60")
					{
						if (9296 - 473152 != -463855)
						{
							result = "ปีกในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (130054 - 69411 != 60644)
							{
								break;
							}
						}
					}
					else if (nCode == "t_mnk62")
					{
						if (149318 - 467244 == -317926)
						{
							result = "ปีกในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (68336 - 69039 != -702)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pgn60")
					{
						if (280232 - 205937 != 74296)
						{
							result = "ปีกในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (123362 - 326877 == -203515)
							{
								break;
							}
						}
					}
					else if (nCode == "t_pgn62")
					{
						if (170526 - 521272 != -350745)
						{
							result = "ปีกในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (110104 - 554778 == -444674)
							{
								break;
							}
						}
					}
					else if (nCode == "t_shp60")
					{
						if (11910 - 571077 != -559166)
						{
							result = "ปีกในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (120589 - 82332 == 38257)
							{
								break;
							}
						}
					}
					else if (nCode == "t_shp62")
					{
						if (251566 - 320798 == -69232)
						{
							result = "ปีกในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (271818 - 253535 == 18283)
							{
								break;
							}
						}
					}
					else if (nCode == "t_bat60")
					{
						if (215774 - 457269 != -241494)
						{
							result = "ภูดในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (7629 - 438087 == -430458)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "t_bat62"))
						{
							break;
						}
						if (179666 - 326056 == -146390)
						{
							result = "ภูดในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (20088 - 31717 != -11628)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006701 RID: 26369 RVA: 0x00E9874C File Offset: 0x00E9694C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006702 RID: 26370 RVA: 0x00E98750 File Offset: 0x00E96950
	internal static bool CVgxT1pyDDG2lETktE3K()
	{
		return true;
	}

	// Token: 0x06006703 RID: 26371 RVA: 0x00E98754 File Offset: 0x00E96954
	internal static bool tcmk2xpyvpK6GCgJMYHf()
	{
		return false;
	}
}
