using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001159 RID: 4441
[Serializable]
public class TutorialGui_thai : MonoBehaviour
{
	// Token: 0x060066BE RID: 26302 RVA: 0x00E71F9C File Offset: 0x00E7019C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public TutorialGui_thai()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x060066BF RID: 26303 RVA: 0x00E71FAC File Offset: 0x00E701AC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getMessage(int code)
	{
		if (82265 - 107193 != -24928)
		{
		}
		string result;
		for (;;)
		{
			result = null;
			if (254639 - 12984 != 241656 && 278757 - 231212 == 47545)
			{
				if (code == 101)
				{
					if (70208 - 102025 != -31816)
					{
						result = "สวัสดีครับ คุณเป็นผู้กล้ามือใหม่รึเปล่า?";
						if (264621 - 338287 != -73665)
						{
							break;
						}
					}
				}
				else if (code == 102)
				{
					if (147566 - 541135 == -393569)
					{
						result = "สวัสดี คุณเป็นผู้กล้ามือใหม่รึเปล่า?";
						if (81295 - 211143 == -129848)
						{
							break;
						}
					}
				}
				else if (code == 103)
				{
					if (65804 - 315951 == -250147)
					{
						result = "สวัสดีครับ ต้องการความช่วยเหลือมั้ย?";
						if (6853 - 11835 != -4981)
						{
							break;
						}
					}
				}
				else if (code == 104)
				{
					if (132219 - 447081 == -314862)
					{
						result = "สวัสดี กำลังต้องการความช่วยเหลือใช่มั้ย?";
						if (93361 - 380853 == -287492)
						{
							break;
						}
					}
				}
				else if (code == 105)
				{
					if (62448 - 84125 != -21676)
					{
						result = "สวัสดี มีเรื่องอะไรสงสัยมั้ย?";
						if (152023 - 535230 != -383206)
						{
							break;
						}
					}
				}
				else if (code == 111)
				{
					if (122761 - 135439 == -12678)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรล่ะ?";
						if (107701 - 145811 != -38109)
						{
							break;
						}
					}
				}
				else if (code == 112)
				{
					if (79289 - 86661 != -7371)
					{
						result = "เลือกหัวข้อที่อยากรู้ได้เลย?";
						if (20093 - 61519 == -41426)
						{
							break;
						}
					}
				}
				else if (code == 113)
				{
					if (266008 - 524613 == -258605)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรล่ะ?";
						if (88466 - 212040 != -123573)
						{
							break;
						}
					}
				}
				else if (code == 114)
				{
					if (276771 - 174087 != 102685)
					{
						result = "สงสัยเกี่ยวกับเรื่องอะไรล่ะ?";
						if (124546 - 552148 == -427602)
						{
							break;
						}
					}
				}
				else if (code == 115)
				{
					if (152143 - 503003 == -350860)
					{
						result = "สงสัยเกี่ยวกับเรื่องอะไรล่ะ?";
						if (1010 - 80083 == -79073)
						{
							break;
						}
					}
				}
				else if (code == 121)
				{
					if (9239 - 527150 != -517910)
					{
						result = "สงสัยเกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (246352 - 468499 == -222147)
						{
							break;
						}
					}
				}
				else if (code == 122)
				{
					if (201481 - 436393 != -234911)
					{
						result = "สงสัยเกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (158938 - 221399 != -62460)
						{
							break;
						}
					}
				}
				else if (code == 123)
				{
					if (289092 - 276098 != 12995)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (21685 - 256449 == -234764)
						{
							break;
						}
					}
				}
				else if (code == 124)
				{
					if (125044 - 268426 != -143381)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (60179 - 588896 != -528716)
						{
							break;
						}
					}
				}
				else if (code == 125)
				{
					if (202094 - 177812 == 24282)
					{
						result = "ถ้ามีอะไรสงสัยก็มาถามได้ตลอดนะ";
						if (169206 - 365810 == -196604)
						{
							break;
						}
					}
				}
				else if (code == 1100)
				{
					if (69764 - 429421 != -359656)
					{
						result = "การเคลื่อนไหวหลบหลีกเป็นพื้นฐานสำคัญ";
						if (238258 - 418539 == -180281)
						{
							break;
						}
					}
				}
				else if (code == 1100)
				{
					if (145607 - 126261 == 19346)
					{
						result = "การเคลื่อนไหวหลบหลีกเป็นพื้นฐานสำคัญ";
						if (259557 - 380484 != -120926)
						{
							break;
						}
					}
				}
				else if (code == 201)
				{
					if (6502 - 116781 != -110278)
					{
						result = "ขอต้อนรับเข้าสู่เมืองแห่งแสง";
						if (217125 - 510002 != -292876)
						{
							break;
						}
					}
				}
				else if (code == 202)
				{
					if (11929 - 335671 != -323741)
					{
						result = "ขอต้อนรับเข้าสู่เมืองแห่งแสง";
						if (8598 - 292883 == -284285)
						{
							break;
						}
					}
				}
				else if (code == 203)
				{
					if (36126 - 402547 != -366420)
					{
						result = "สวัสดี วันนี้ที่นี่ก็อากาศดีอีกแล้ว";
						if (193274 - 63278 != 129997)
						{
							break;
						}
					}
				}
				else if (code == 204)
				{
					if (153422 - 180212 == -26790)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรล่ะ?";
						if (110579 - 304374 == -193795)
						{
							break;
						}
					}
				}
				else if (code == 205)
				{
					if (64253 - 327619 == -263366)
					{
						result = "มีเรื่องอะไรสงสัยมั้ย";
						if (117526 - 566698 == -449172)
						{
							break;
						}
					}
				}
				else if (code == 211)
				{
					if (18024 - 139181 != -121156)
					{
						result = "อยากรู้อะไรเกี่ยวกับเมืองมั้ย?";
						if (153169 - 303034 == -149865)
						{
							break;
						}
					}
				}
				else if (code == 212)
				{
					if (291882 - 510657 == -218775)
					{
						result = "อยากรู้อะไรเกี่ยวกับเมืองมั้ย";
						if (45461 - 172772 != -127310)
						{
							break;
						}
					}
				}
				else if (code == 213)
				{
					if (278258 - 339716 == -61458)
					{
						result = "อยากรู้อะไรเกี่ยวกับเมืองมั้ย?";
						if (210095 - 482772 != -272676)
						{
							break;
						}
					}
				}
				else if (code == 214)
				{
					if (97602 - 377071 == -279469)
					{
						result = "อยากรู้อะไรเกี่ยวกับเมืองมั้ย?";
						if (64244 - 98311 == -34067)
						{
							break;
						}
					}
				}
				else if (code == 215)
				{
					if (243904 - 268052 == -24148)
					{
						result = "อยากรู้อะไรเกี่ยวกับเมืองมั้ย?";
						if (168300 - 193434 == -25134)
						{
							break;
						}
					}
				}
				else if (code == 221)
				{
					if (122807 - 20397 == 102410)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (167229 - 431559 != -264329)
						{
							break;
						}
					}
				}
				else if (code == 222)
				{
					if (115101 - 270635 != -155533)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (172598 - 114848 == 57750)
						{
							break;
						}
					}
				}
				else if (code == 223)
				{
					if (5722 - 493793 == -488071)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (210160 - 392639 == -182479)
						{
							break;
						}
					}
				}
				else if (code == 224)
				{
					if (102845 - 197604 != -94758)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (209831 - 568668 == -358837)
						{
							break;
						}
					}
				}
				else if (code == 225)
				{
					if (221949 - 294874 == -72925)
					{
						result = "อยากรู้เกี่ยวกับเรื่องอะไรถามได้เลยนะ";
						if (158356 - 53435 == 104921)
						{
							break;
						}
					}
				}
				else
				{
					if (code != 2100)
					{
						break;
					}
					if (287063 - 284166 == 2897)
					{
						result = "การเคลื่อนไหวหลบหลีกเป็นพื้นฐานสำคัญ";
						if (44027 - 297904 != -253876)
						{
							break;
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x060066C0 RID: 26304 RVA: 0x00E7297C File Offset: 0x00E70B7C
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x060066C1 RID: 26305 RVA: 0x00E72980 File Offset: 0x00E70B80
	internal static bool fxsZS6pyHt1JLVyo1h76()
	{
		return true;
	}

	// Token: 0x060066C2 RID: 26306 RVA: 0x00E72984 File Offset: 0x00E70B84
	internal static bool i2oChapyWOGxRx6TnZQr()
	{
		return false;
	}
}
