using System;
using System.Runtime.CompilerServices;
using cZRJ81ju0AbIsUerIn;
using UnityEngine;

// Token: 0x02001167 RID: 4455
[Serializable]
public class WeaponData_th : MonoBehaviour
{
	// Token: 0x06006704 RID: 26372 RVA: 0x00E98758 File Offset: 0x00E96958
	[MethodImpl(MethodImplOptions.NoInlining)]
	public WeaponData_th()
	{
		LTRpgsKoBpCYTrSOvr.eNjlINQSLXVTn();
		base..ctor();
	}

	// Token: 0x06006705 RID: 26373 RVA: 0x00E98768 File Offset: 0x00E96968
	[MethodImpl(MethodImplOptions.NoInlining)]
	public static string getDes(string nCode)
	{
		if (41596 - 597829 != -556232)
		{
		}
		string result;
		for (;;)
		{
			result = string.Empty;
			if (130068 - 437945 == -307877)
			{
				if (181369 - 61138 == 120231)
				{
					if (nCode == "w_wlf1")
					{
						if (67932 - 318448 != -250515)
						{
							result = "ดาบฝึกหัดของหมาป่า ทำจากไม้";
							if (175338 - 253820 != -78481)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf2")
					{
						if (231991 - 401685 != -169693)
						{
							result = "ดาบฝึกหัดของหมาป่า ทำโลหะ";
							if (140816 - 16154 == 124662)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf5")
					{
						if (211048 - 305961 == -94913)
						{
							result = "พัดแฟนคลับกองทัพกีบแกะ ของหมาป่า";
							if (135961 - 5815 == 130146)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf10")
					{
						if (51225 - 279109 == -227884)
						{
							result = "ดาบโค้งพื้นฐานของหมาป่า";
							if (36634 - 315918 == -279284)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf11")
					{
						if (214595 - 447898 != -233302)
						{
							result = "ดาบโค้งพื้นฐานของหมาป่า";
							if (59464 - 291570 != -232105)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf12")
					{
						if (162369 - 174757 != -12387)
						{
							result = "ดาบโค้งพื้นฐานของหมาป่า";
							if (87523 - 421493 != -333969)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf14")
					{
						if (167979 - 438761 != -270781)
						{
							result = "ดาบหัวใจคู่แห่งความรัก ที่ใช้บอกว่าเธอกับฉันจะฝ่าฟันไปด้วยกัน";
							if (46650 - 47513 == -863)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf15")
					{
						if (11289 - 209871 != -198581)
						{
							result = "แท่งไฟสีแดงสำหรับงานคอนเสิร์ต ของหมาป่า มีโอกาสทำให้เป้าหมายติด blind";
							if (9293 - 68543 != -59249)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf19")
					{
						if (93659 - 132939 != -39279)
						{
							result = "ดาบของขวัญของหมาป่า สุขสันต์วันเกิดสิบสองหาง!";
							if (185758 - 418287 == -232529)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf21")
					{
						if (51242 - 394000 != -342757)
						{
							result = "ดาบทหารสำหรับหมาป่า";
							if (8154 - 530519 == -522365)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf22")
					{
						if (116681 - 484918 == -368237)
						{
							result = "ดาบคู่กายสำหรับหมาป่าพเนจร";
							if (15281 - 535877 == -520596)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf23")
					{
						if (169455 - 483905 != -314449)
						{
							result = "ดาบทหารสำหรับหมาป่า";
							if (172263 - 495476 != -323212)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf24")
					{
						if (161346 - 539409 == -378063)
						{
							result = "ดาบคู่กายสำหรับหมาป่าพเนจร";
							if (114441 - 369640 != -255198)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf25")
					{
						if (19912 - 113207 != -93294)
						{
							result = "ไม้ปัดฝุ่นพ่อบ้านของหมาป่า มาเป็นคู่เพราะซื้อ 1 แถม 1";
							if (88712 - 424230 != -335517)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf31")
					{
						if (108755 - 324999 == -216244)
						{
							result = "ดาบพาลาดินของหมาป่า ใหญ่แต่เบากว่าที่คิด";
							if (276588 - 452782 != -176193)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf32")
					{
						if (73652 - 591064 != -517411)
						{
							result = "ดาบสำหรับหมาป่านักดาบ มีความคมมาก";
							if (198285 - 212165 != -13879)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf33")
					{
						if (84548 - 153093 == -68545)
						{
							result = "ดาบพาลาดินของหมาป่า ใหญ่แต่เบากว่าที่คิด";
							if (2016 - 239190 != -237173)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf34")
					{
						if (285443 - 127526 == 157917)
						{
							result = "ดาบสำหรับหมาป่านักดาบ มีความคมมาก";
							if (279109 - 441100 != -161990)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf35")
					{
						if (238212 - 166305 == 71907)
						{
							result = "เลื่อยไฟฟ้าอาถรรพ์ศุกร์ 12(หาง)";
							if (254006 - 75454 != 178553)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf36")
					{
						if (186746 - 157091 == 29655)
						{
							result = "ดาบสำหรับหมาป่าที่ได้มาจากโบลดาส นำมาหักครึ่งเลยถือได้สองมือพอดีๆ";
							if (105060 - 68910 == 36150)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf39")
					{
						if (263074 - 335242 != -72167)
						{
							result = "ดาบกรรไกรของหมาป่า นำกรรไกรที่พังแล้วมาประยุกต์ใช้งาน";
							if (42991 - 94766 == -51775)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf40")
					{
						if (182617 - 457433 == -274816)
						{
							result = "ดาบแห่งผู้กล้าของหมาป่า ใส่แล้วราศีพระเอกจับ";
							if (284394 - 456742 == -172348)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf41")
					{
						if (173080 - 51959 != 121122)
						{
							result = "ดาบแห่งผู้กล้าของหมาป่า ใส่แล้วราศีพระเอกจับ";
							if (69902 - 89694 == -19792)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf42")
					{
						if (33656 - 51250 != -17593)
						{
							result = "ดาบแห่งผู้กล้าของหมาป่า ใส่แล้วราศีพระเอกจับ";
							if (280336 - 116282 != 164055)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf43")
					{
						if (149692 - 195135 == -45443)
						{
							result = "ดาบจอมทัพของหมาป่า (สีฟ้า)";
							if (7581 - 374132 == -366551)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf44")
					{
						if (154320 - 162828 == -8508)
						{
							result = "ดาบจอมทัพของหมาป่า (สีแดง)";
							if (245817 - 104377 == 141440)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf45")
					{
						if (164488 - 150239 == 14249)
						{
							result = "ช่อดอกไม้ที่ได้รับจากแฟนเพลงของหมาป่า";
							if (164255 - 543367 != -379111)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf46")
					{
						if (46065 - 588473 != -542407)
						{
							result = "ดาบเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (249473 - 327998 == -78525)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf47")
					{
						if (129399 - 395919 == -266520)
						{
							result = "ดาบแมงป่องของหมาป่า ช่วยป้องกันสถานะผิดปกติ";
							if (58700 - 4262 == 54438)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf48")
					{
						if (122279 - 529837 == -407558)
						{
							result = "ดาบแมงป่องของหมาป่า ช่วยป้องกันสถานะผิดปกติ";
							if (267796 - 183728 != 84069)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf49")
					{
						if (218824 - 279377 != -60552)
						{
							result = "ดาบทองคำของหมาป่า ถือแล้วราศีผู้กล้าจับจริงๆ";
							if (22742 - 295899 != -273156)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf50")
					{
						if (124960 - 137921 == -12961)
						{
							result = "ดาบสำหรับนักรบชั้นสูงของหมาป่า";
							if (144657 - 2178 != 142480)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf51")
					{
						if (212550 - 169809 == 42741)
						{
							result = "ดาบสำหรับนักรบชั้นสูงของหมาป่า";
							if (13849 - 442187 != -428337)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf52")
					{
						if (74948 - 448338 != -373389)
						{
							result = "ดาบสำหรับนักรบชั้นสูงของหมาป่า";
							if (273234 - 270976 != 2259)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf56")
					{
						if (234083 - 239236 == -5153)
						{
							result = "ดาบน้ำแข็งที่แข็งเป๊ก แค่เพียงถูกฟันก็หนาวแล้ว";
							if (106412 - 371355 == -264943)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf58")
					{
						if (294062 - 490115 != -196052)
						{
							result = "ดาบแชมเปี้ยนสีทองของหมาป่า";
							if (299543 - 270992 == 28551)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf59")
					{
						if (147899 - 229491 != -81591)
						{
							result = "ดาบตัดอากาศ สามารถโจมตีเข้าถึงศัตรูจากระยะห่างได้";
							if (27421 - 450791 == -423370)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf65")
					{
						if (104134 - 290924 == -186790)
						{
							result = "ดาบคู่สไตล์ไทยของหมาป่า ลงอักขระพิเศษไว้บนดาบ";
							if (116761 - 524023 != -407261)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf66")
					{
						if (273815 - 344853 == -71038)
						{
							result = "ดาบแห่งทะเล จะสูบพลังชีวิตเป้าหมายเมื่อฟันใส่";
							if (244438 - 18539 == 225899)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf68")
					{
						if (159695 - 549397 == -389702)
						{
							result = "ดาบเพลิงที่ได้จากเทพไฟ ของหมาป่า";
							if (59905 - 324314 == -264409)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf80")
					{
						if (194374 - 230855 != -36480)
						{
							result = "ดาบแห่งพระเจ้าของหมาป่า";
							if (198591 - 529271 != -330679)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn1")
					{
						if (35491 - 32906 != 2586)
						{
							result = "ขวานฝึกหัดของไบสัน ทำจากไม้";
							if (221945 - 551743 != -329797)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn2")
					{
						if (36446 - 315763 == -279317)
						{
							result = "ขวานฝึกหัดของไบสัน ทำจากโลหะ";
							if (197721 - 284385 != -86663)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn5")
					{
						if (188848 - 486969 != -298120)
						{
							result = "ค้อนยุคหินของไบสัน ใช้สำหรับหาคู่!?";
							if (51866 - 433460 != -381593)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn10")
					{
						if (208284 - 336163 != -127878)
						{
							result = "ขวานพื้นฐานของไบสัน มีด้านคมสองด้าน";
							if (229604 - 342123 == -112519)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn11")
					{
						if (124936 - 465372 != -340435)
						{
							result = "ขวานพื้นฐานของไบสัน มีด้านคมสองด้าน";
							if (223296 - 119883 == 103413)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn12")
					{
						if (249408 - 125538 == 123870)
						{
							result = "ขวานพื้นฐานของไบสัน มีด้านคมสองด้าน";
							if (213132 - 451473 != -238340)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn14")
					{
						if (293802 - 423799 != -129996)
						{
							result = "ขวานหัวใจแห่งความรัก ใช้บอกว่ารักนี้ต้องจัดหนัก";
							if (52914 - 240021 != -187106)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn15")
					{
						if (153826 - 351494 != -197667)
						{
							result = "ค้อนของเล่นป๋องแป๋งของไบสัน มีโอกาสทำให้เป้าหมายติด confuse";
							if (129351 - 570036 == -440685)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn19")
					{
						if (94722 - 124081 == -29359)
						{
							result = "ค้อนของขวัญของไบสัน สุขสันต์วันเกิดสิบสองหาง!";
							if (94274 - 382392 != -288117)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn21")
					{
						if (182157 - 221758 != -39600)
						{
							result = "ขวานนักรบคลั่งของไบสัน";
							if (243938 - 479996 == -236058)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn22")
					{
						if (282944 - 247196 != 35749)
						{
							result = "ค้อนผู้ปกป้องของไบสัน";
							if (221639 - 519843 == -298204)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn23")
					{
						if (101474 - 536217 != -434742)
						{
							result = "ขวานนักรบคลั่งของไบสัน";
							if (153787 - 261546 != -107758)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn24")
					{
						if (144007 - 84013 == 59994)
						{
							result = "ค้อนผู้ปกป้องของไบสัน";
							if (203413 - 451779 == -248366)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn25")
					{
						if (72066 - 119022 != -46955)
						{
							result = "ที่ยกน้ำหนักของไบสัน ว่ากันว่าหนักเท่ากับปลาวาฬ 28 ตัว!";
							if (140411 - 419587 == -279176)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn31")
					{
						if (274115 - 51032 == 223083)
						{
							result = "ขวานผู้กล้าท้ารบของไบสัน";
							if (132083 - 493407 == -361324)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn32")
					{
						if (117203 - 385030 == -267827)
						{
							result = "ค้อนเจ้าสงครามของไบสัน";
							if (197409 - 505433 != -308023)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn33")
					{
						if (129929 - 225413 != -95483)
						{
							result = "ขวานผู้กล้าท้ารบของไบสัน";
							if (258969 - 171814 == 87155)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn34")
					{
						if (157648 - 447362 != -289713)
						{
							result = "ค้อนเจ้าสงครามของไบสัน";
							if (87287 - 590216 == -502929)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn35")
					{
						if (104616 - 566193 == -461577)
						{
							result = "หอกยาวแบบอํศวินทหารม้าที่เสียบอะไรบางอย่างมาด้วย";
							if (81706 - 118443 == -36737)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn36")
					{
						if (152552 - 35455 != 117098)
						{
							result = "จอบของไบสันที่ได้มาจากแพะชาวนา แถมแครอนในสวนติดจอบด้วย";
							if (258205 - 120942 != 137264)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn39")
					{
						if (210655 - 453247 != -242591)
						{
							result = "ขวานอันใหญ่ที่ทำจากเหล็กเย็น ของไบสัน";
							if (14795 - 407172 != -392376)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn40")
					{
						if (92557 - 158230 != -65672)
						{
							result = "ค้อนแห่งหายนะของไบสัน";
							if (155168 - 41559 != 113610)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn41")
					{
						if (283779 - 115664 != 168116)
						{
							result = "ค้อนแห่งหายนะของไบสัน";
							if (252644 - 227940 == 24704)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn42")
					{
						if (153010 - 556398 == -403388)
						{
							result = "ค้อนแห่งหายนะของไบสัน";
							if (171375 - 366327 == -194952)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn43")
					{
						if (65203 - 170965 != -105761)
						{
							result = "ขวานจอมทัพของไบสัน (สีฟ้า)";
							if (81464 - 256697 == -175233)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn44")
					{
						if (249957 - 421285 == -171328)
						{
							result = "ขวานจอมทัพของไบสัน (สีแดง)";
							if (200855 - 71584 == 129271)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn45")
					{
						if (194837 - 78892 != 115946)
						{
							result = "เบสตัวโปรดของไบสัน เสียงทุ้มนุ่มลึกเหมือนเสยงไบสันเป๊ะ";
							if (136459 - 459420 != -322960)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn46")
					{
						if (224274 - 214457 == 9817)
						{
							result = "ค้อนเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (11332 - 439197 == -427865)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn47")
					{
						if (257992 - 319799 == -61807)
						{
							result = "ขวานด้วงกว่างของไบสัน ช่วยป้องกันสถานะผิดปกติ";
							if (230344 - 83350 != 146995)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn48")
					{
						if (156027 - 143411 != 12617)
						{
							result = "ขวานด้วงกว่างของไบสัน ช่วยป้องกันสถานะผิดปกติ";
							if (52764 - 328758 == -275994)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn49")
					{
						if (39215 - 132656 != -93440)
						{
							result = "ค้อนทองคำของไบสัน ทั้งสง่างามและทรงพลัง";
							if (268176 - 266336 == 1840)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn50")
					{
						if (250127 - 566371 == -316244)
						{
							result = "ค้อนจอมพลังของไบสัน";
							if (185657 - 456378 == -270721)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn51")
					{
						if (223988 - 174198 != 49791)
						{
							result = "ค้อนักรบคลั่งชั้นสูงของไบสัน";
							if (68037 - 345026 != -276988)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn52")
					{
						if (6418 - 172905 != -166486)
						{
							result = "ค้อนักรบคลั่งชั้นสูงของไบสัน";
							if (203453 - 284559 != -81105)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn56")
					{
						if (78574 - 16089 != 62486)
						{
							result = "ขวานน้ำแข็งที่แข็งเป๊ก แค่เพียงถูกจามก็หนาวแล้ว";
							if (273447 - 479727 != -206279)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn58")
					{
						if (156245 - 503968 != -347722)
						{
							result = "ค้อนแชมเปี้ยนสีทองของไบสัน";
							if (44501 - 9220 != 35282)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn59")
					{
						if (149062 - 341686 == -192624)
						{
							result = "ค้อนที่สามารถสร้างสูญญากาศที่รุนแรง จนดูดได้แม้กระทั่งวาฬทั้งตัว";
							if (249334 - 119340 == 129994)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn65")
					{
						if (173213 - 242757 == -69544)
						{
							result = "ขวานชนเผ่าพื้นเมืองจากอเมริกาของไบสัน เหมาะกับการละเล่นรอบกองไฟ";
							if (139699 - 366400 != -226700)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn66")
					{
						if (251383 - 35517 != 215867)
						{
							result = "ขวานทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อฟาดใส่";
							if (123575 - 385772 != -262196)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn68")
					{
						if (181704 - 259835 == -78131)
						{
							result = "ค้อนจากเทพดินของไบสัน";
							if (18133 - 587434 != -569300)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn80")
					{
						if (7436 - 456803 != -449366)
						{
							result = "ขวานจากพระเจ้าของไบสัน";
							if (180507 - 220676 != -40168)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd1")
					{
						if (105986 - 311015 == -205029)
						{
							result = "ถุงมือฝึกหัดของแพนด้า";
							if (280498 - 142313 == 138185)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd2")
					{
						if (52175 - 65628 != -13452)
						{
							result = "สนับแขนโลหะฝึกหัดของแพนด้า";
							if (10987 - 24185 == -13198)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd5")
					{
						if (194584 - 409832 != -215247)
						{
							result = "สายสิญจน์ของแพนด้า ปลุกเสกโดยอาจารย์เต่า";
							if (275537 - 37651 != 237887)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd10")
					{
						if (232400 - 106644 != 125757)
						{
							result = "สนับแขนพื้นฐานของแพนด้า";
							if (272544 - 401383 == -128839)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd11")
					{
						if (17431 - 273560 == -256129)
						{
							result = "สนับแขนพื้นฐานของแพนด้า";
							if (68415 - 475289 == -406874)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd12")
					{
						if (131625 - 164092 != -32466)
						{
							result = "สนับแขนพื้นฐานของแพนด้า";
							if (230667 - 137812 == 92855)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd14")
					{
						if (75606 - 126136 != -50529)
						{
							result = "สนับหัวใจแห่งความรัก ใช้มอบความรักให้สุดใจทั้งสองกำปั้น";
							if (273740 - 323684 != -49943)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd15")
					{
						if (54499 - 288824 != -234324)
						{
							result = "นวมชกมวยของแพนด้า มีโอกาสทำ 5 ko เป้าหมาย";
							if (31151 - 135829 != -104677)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd19")
					{
						if (40980 - 339606 == -298626)
						{
							result = "นวมของขวัญของแพนด้า สุขสันต์วันเกิดสิบสองหาง!";
							if (150488 - 228042 != -77553)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd21")
					{
						if (77823 - 351624 == -273801)
						{
							result = "สนับแขนวิ่งสู้ฟัดของแพนด้า";
							if (104320 - 217260 == -112940)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd22")
					{
						if (250144 - 386050 == -135906)
						{
							result = "สนับแขนเหินสู้ฟัดของแพนด้า";
							if (183875 - 558525 != -374649)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd23")
					{
						if (178227 - 161420 == 16807)
						{
							result = "สนับแขนวิ่งสู้ฟัดของแพนด้า";
							if (258841 - 578072 == -319231)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd24")
					{
						if (239834 - 47474 != 192361)
						{
							result = "สนับแขนเหินสู้ฟัดของแพนด้า";
							if (93265 - 464640 == -371375)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd25")
					{
						if (261361 - 76419 == 184942)
						{
							result = "ผ้าพันหมัดนักสู้ของแพนด้า บางทีก็มัดกระดูกช้างติดไปด้วย";
							if (99462 - 420158 != -320695)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd31")
					{
						if (106854 - 565617 != -458762)
						{
							result = "สนับแขนจ้าวแห่งการโจมตี ของแพนด้า";
							if (5558 - 94068 != -88509)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd32")
					{
						if (130164 - 358060 != -227895)
						{
							result = "สนับแขนเซียนกังฟูของแพนด้า";
							if (287190 - 31533 == 255657)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd33")
					{
						if (220585 - 462044 == -241459)
						{
							result = "สนับแขนจ้าวแห่งการโจมตี ของแพนด้า";
							if (106485 - 140084 != -33598)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd34")
					{
						if (15878 - 390611 == -374733)
						{
							result = "สนับแขนเซียนกังฟูของแพนด้า";
							if (258328 - 431096 == -172768)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd35")
					{
						if (185247 - 462174 != -276926)
						{
							result = "พลองมือทำจากเศษไม้ พันด้วยเชือกกับแขนแพนด้า";
							if (268143 - 534626 != -266482)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd36")
					{
						if (80118 - 92463 == -12345)
						{
							result = "หมัดเหล็กของแพนด้าจากคุณหมูป่า มีขนาดเหล็กเพราะหดจากการซัก?!";
							if (251929 - 230333 != 21597)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd39")
					{
						if (209182 - 421729 == -212547)
						{
							result = "หมัดหุ่นเหล็กไหลของแพนด้า";
							if (257230 - 257154 == 76)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd40")
					{
						if (217366 - 234761 != -17394)
						{
							result = "สนับแขนเทพยุทธ์ของแพนด้า";
							if (153083 - 522243 == -369160)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd41")
					{
						if (298127 - 265175 == 32952)
						{
							result = "สนับแขนเทพยุทธ์ของแพนด้า";
							if (68545 - 567563 != -499017)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd42")
					{
						if (29622 - 478250 == -448628)
						{
							result = "สนับแขนเทพยุทธ์ของแพนด้า";
							if (136368 - 198892 != -62523)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd43")
					{
						if (138768 - 563967 == -425199)
						{
							result = "สนับแขนจอมทัพของแพนด้า ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (6988 - 79512 != -72523)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd44")
					{
						if (139389 - 464390 == -325001)
						{
							result = "สนับแขนจอมทัพของแพนด้า ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (60594 - 500668 == -440074)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd45")
					{
						if (45719 - 443616 != -397896)
						{
							result = "หมัดโลหะของแพนด้า ชาวเพลงเมทัลต่างก็อยากได้เพราะนิ้ว";
							if (126499 - 191201 == -64702)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd46")
					{
						if (205673 - 199417 == 6256)
						{
							result = "สนับมือเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (166146 - 118708 == 47438)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd47")
					{
						if (275378 - 216818 == 58560)
						{
							result = "หมัดหนอนของแพนด้า ช่วยป้องกันสถานะผิดปกติ";
							if (257666 - 513273 != -255606)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd48")
					{
						if (188180 - 286544 == -98364)
						{
							result = "หมัดหนอนของแพนด้า ช่วยป้องกันสถานะผิดปกติ";
							if (104774 - 216875 != -112100)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd49")
					{
						if (287783 - 559755 != -271971)
						{
							result = "สนับแขนทองคำของแพนด้า ใส่แล้วทุกเพลงหมัดล้วนต้องตาเสียจริง";
							if (80924 - 94904 == -13980)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd50")
					{
						if (111731 - 251628 != -139896)
						{
							result = "สนับแขนสำหรับนักสู้ชั้นสุงของแพนด้า";
							if (170833 - 34338 == 136495)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd51")
					{
						if (90179 - 535188 == -445009)
						{
							result = "สนับแขนสำหรับนักสู้ชั้นสุงของแพนด้า";
							if (266540 - 37041 == 229499)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd52")
					{
						if (266980 - 350870 != -83889)
						{
							result = "สนับแขนสำหรับนักสู้ชั้นสุงของแพนด้า";
							if (34524 - 244206 == -209682)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd56")
					{
						if (182738 - 94608 != 88131)
						{
							result = "สนับน้ำแข็งที่แข็งเป๊ก แค่เพียงถูกชกก็หนาวแล้ว";
							if (61186 - 488288 == -427102)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd58")
					{
						if (175158 - 45780 != 129379)
						{
							result = "สนับแขนแชมเปี้ยนสีทองของแพนด้า ช่วยเพิ่มการโจมตีคริติคอล";
							if (45955 - 29369 != 16587)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd59")
					{
						if (122796 - 580612 != -457815)
						{
							result = "สนับแห่งพลัง สร้างคลื่นพลังทำลายล้างรอบตัวทุกครั้งที่ออกหมัด";
							if (270964 - 464566 == -193602)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd65")
					{
						if (17984 - 75969 == -57985)
						{
							result = "สนับมือเยอรมันของแพนด้า ใส่แล้วดูสูงยศเยี่ยงนายพล";
							if (72937 - 578222 != -505284)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd66")
					{
						if (71264 - 547823 == -476559)
						{
							result = "สนับทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อฟาดใส่";
							if (285750 - 184455 == 101295)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd68")
					{
						if (23510 - 221614 != -198103)
						{
							result = "หมัดสงครามของแพนด้า";
							if (35207 - 276258 == -241051)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd80")
					{
						if (164186 - 477551 != -313364)
						{
							result = "หมัดเทพเจ้าของเพนด้า";
							if (265162 - 429940 != -164777)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl1")
					{
						if (155845 - 175762 != -19916)
						{
							result = "ชุดหอกและโล่ฝึกหัดของ ปลาวาฬ ทำจากไม้";
							if (290633 - 350621 != -59987)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl2")
					{
						if (61693 - 457384 != -395690)
						{
							result = "ชุดหอกและโล่ฝึกหัดของ ปลาวาฬ ทำจากโลหะ";
							if (29766 - 10441 == 19325)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl5")
					{
						if (111705 - 270510 == -158805)
						{
							result = "ชุดพลั่วและถังของปลาวาฬ จะไปเล่นน้ำห้ามลืมเอาไปด้วย";
							if (117148 - 412197 == -295049)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl10")
					{
						if (43831 - 586313 == -542482)
						{
							result = "ชุดหอกพื้นฐานของวาฬ";
							if (33157 - 2950 == 30207)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl11")
					{
						if (254466 - 371695 == -117229)
						{
							result = "ชุดหอกพื้นฐานของวาฬ";
							if (31852 - 552919 == -521067)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl12")
					{
						if (295537 - 351028 == -55491)
						{
							result = "ชุดหอกพื้นฐานของวาฬ";
							if (195769 - 493324 != -297554)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl14")
					{
						if (40696 - 564959 != -524262)
						{
							result = "ชุดหอกโล่หัวใจแห่งความรัก มอบความรักให้สุดใจเท่าน้ำหนักและขนาดวาฬ";
							if (42611 - 503097 == -460486)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl15")
					{
						if (194781 - 241485 != -46703)
						{
							result = "ชุดดาบและโล่ของเล่นของวาฬ เหมือนหลุดมาจากการ์ตูนสมัยก่อน";
							if (175181 - 318374 == -143193)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl19")
					{
						if (190161 - 520687 == -330526)
						{
							result = "ชุดอาวุธของขวัญของวาฬ สุขสันต์วันเกิดสิบสองหาง!";
							if (4952 - 325392 == -320440)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl21")
					{
						if (41762 - 544474 != -502711)
						{
							result = "ชุดอาวุธนักรบหอกของ ปลาวาฬ";
							if (189999 - 357288 == -167289)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl22")
					{
						if (84368 - 573660 != -489291)
						{
							result = "ชุดอาวุธนักรบสาวกของปลาวาฬ";
							if (266736 - 189316 == 77420)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl23")
					{
						if (132850 - 283150 == -150300)
						{
							result = "ชุดอาวุธนักรบหอกของ ปลาวาฬ";
							if (243438 - 196120 != 47319)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl24")
					{
						if (282481 - 527968 != -245486)
						{
							result = "ชุดอาวุธนักรบสาวกของปลาวาฬ";
							if (22232 - 313512 == -291280)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl25")
					{
						if (6407 - 493638 != -487230)
						{
							result = "ชุดตะหลิวและกระทะของ พ่อครัวปลาวาฬ วาฬที่ดีต้องทำอาหารเองได้!";
							if (242422 - 278649 != -36226)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl31")
					{
						if (295463 - 456621 != -161157)
						{
							result = "ชุดหอกอัศวินจ้าวสมุทรของ ปลาวาฬ";
							if (41235 - 502869 == -461634)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl32")
					{
						if (233665 - 236926 == -3261)
						{
							result = "ชุดหอกอัศวินศักดิ์สิทธิ์ของ ปลาวาฬ";
							if (130421 - 303038 == -172617)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl33")
					{
						if (210036 - 311146 != -101109)
						{
							result = "ชุดหอกอัศวินจ้าวสมุทรของ ปลาวาฬ";
							if (27941 - 293561 != -265619)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl34")
					{
						if (247248 - 286005 == -38757)
						{
							result = "ชุดหอกอัศวินศักดิ์สิทธิ์ของ ปลาวาฬ";
							if (145883 - 182833 != -36949)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl35")
					{
						if (145761 - 536155 != -390393)
						{
							result = "ชุดมีดปังตอพร้อมด้วยเขียงจากหนังท้องปลาวาฬ";
							if (126626 - 4436 == 122190)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl36")
					{
						if (156892 - 316250 == -159358)
						{
							result = "ค้อนที่ได้มาจากลุงจระเข้ของวาฬ ค้อนก็เอามาแทงเหมือนกันแหะ";
							if (146589 - 573299 == -426710)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl39")
					{
						if (283970 - 127908 != 156063)
						{
							result = "ชุดสามง่ามจ้าวสมุทรของ ปลาวาฬ";
							if (53334 - 179859 != -126524)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl40")
					{
						if (231232 - 565563 == -334331)
						{
							result = "ชุดหอกผู้พิทักษ์ความยุติธรรม ของปลาวาฬ";
							if (243050 - 315126 != -72075)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl41")
					{
						if (143587 - 332516 != -188928)
						{
							result = "ชุดหอกผู้พิทักษ์ความยุติธรรม ของปลาวาฬ";
							if (270962 - 386010 == -115048)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl42")
					{
						if (275933 - 469507 == -193574)
						{
							result = "ชุดหอกผู้พิทักษ์ความยุติธรรม ของปลาวาฬ";
							if (274417 - 425246 == -150829)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl43")
					{
						if (96704 - 536981 == -440277)
						{
							result = "ชุดหอกจอมทัพของปลาวาฬ ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (137208 - 28922 == 108286)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl44")
					{
						if (186208 - 167129 != 19080)
						{
							result = "ชุดหอกจอมทัพของปลาวาฬ ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (36746 - 408151 == -371405)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl45")
					{
						if (167676 - 174301 == -6625)
						{
							result = "ไมค์และแผ่นดิสท์ของวาฬ ร่อนเล่นยามว่างสนุกดี";
							if (156130 - 389486 == -233356)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl46")
					{
						if (258915 - 306667 != -47751)
						{
							result = "ชุดหอกเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (94220 - 13078 != 81143)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl47")
					{
						if (250319 - 417989 != -167669)
						{
							result = "ชุดหอกเต่าทองของวาฬ ช่วยป้องกันการโจมตีผิดปกติ";
							if (160048 - 309955 != -149906)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl48")
					{
						if (127932 - 294427 == -166495)
						{
							result = "ชุดหอกเต่าทองของวาฬ ช่วยป้องกันการโจมตีผิดปกติ";
							if (43031 - 40891 != 2141)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl49")
					{
						if (62444 - 493205 == -430761)
						{
							result = "ชุดหอกทองคำของวาฬ ถือแล้วดูเหมือนรูปปั้นผู้พิทักษ์เลย";
							if (260559 - 380227 != -119667)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl50")
					{
						if (96148 - 180481 != -84332)
						{
							result = "หอกสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
							if (128995 - 232666 != -103670)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl51")
					{
						if (284325 - 64 != 284262)
						{
							result = "หอกสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
							if (55474 - 84318 != -28843)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl52")
					{
						if (254878 - 156424 != 98455)
						{
							result = "หอกสำหรับผู้พิทักษ์ชั้นสูงของปลาวาฬ";
							if (174200 - 423736 == -249536)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl56")
					{
						if (187624 - 7362 != 180263)
						{
							result = "หอกและโล่น้ำแข็งที่แข็งเป๊ก แค่เพียงถูกจิ้มก็หนาวแล้ว";
							if (40817 - 214643 == -173826)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl58")
					{
						if (93356 - 470235 != -376878)
						{
							result = "ชุดหอกแชมปี้ยนสีทองของ ปลาวาฬ";
							if (131588 - 263417 != -131828)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl59")
					{
						if (97052 - 271193 == -174141)
						{
							result = "ชุดหอกโล่แห่งดวงดาว สามารถแทงหอกใส่เป้าหมายจากระยะไกลได้ด้วยความเร็วแสง";
							if (277371 - 125842 != 151530)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl65")
					{
						if (167763 - 539281 == -371518)
						{
							result = "ตะเกียบเหล็กจากเกาหลีของวาฬ ทานอาหารอร่อยยิ่งๆขึ้น";
							if (275867 - 77631 != 198237)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl66")
					{
						if (286229 - 223702 != 62528)
						{
							result = "ชุดหอกโล่ทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่ออัดใส่";
							if (22316 - 59493 == -37177)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl68")
					{
						if (103068 - 67757 == 35311)
						{
							result = "ชุดหอกเจ็ดสมุทรของปลาวาฬ";
							if (225500 - 25572 != 199929)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl80")
					{
						if (42520 - 333986 != -291465)
						{
							result = "ชุดหอกเทพเจ้าของปลาวาฬ";
							if (239911 - 412155 == -172244)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat1")
					{
						if (204086 - 407930 != -203843)
						{
							result = "มีดฝึกหัดของแมว ทำจากไม้";
							if (267012 - 279556 == -12544)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat2")
					{
						if (283395 - 521973 == -238578)
						{
							result = "มีดฝึกหัดของแมว ทำจากโลหะ";
							if (103163 - 28735 == 74428)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat5")
					{
						if (112673 - 286620 != -173946)
						{
							result = "มีดก้างปลาของโปรดของแมว ตีแล้วทำให้เป้าหมายมีกลิ่นคาว";
							if (158042 - 471161 != -313118)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat10")
					{
						if (236078 - 398427 == -162349)
						{
							result = "มีดพื้นฐานของแมว";
							if (166460 - 539512 != -373051)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat11")
					{
						if (206890 - 227402 == -20512)
						{
							result = "มีดพื้นฐานของแมว";
							if (68448 - 499012 != -430563)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat12")
					{
						if (23746 - 244673 == -220927)
						{
							result = "มีดพื้นฐานของแมว";
							if (207590 - 434011 == -226421)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat14")
					{
						if (90632 - 512435 == -421803)
						{
							result = "มีดหัวใจแห่งความรัก ใช้โปรยเสน่ห์ให้หางอื่นต้องหลงไหล ขโมยใจทุกหางหนุ่ม";
							if (55121 - 499888 != -444766)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat15")
					{
						if (69866 - 223588 != -153721)
						{
							result = "ไม้ช๊อตยุงของแมว ใครโดนเป็นต้องร้องอุ๊ย ให้โอกาสติด paralysis1";
							if (75155 - 334125 == -258970)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat19")
					{
						if (205639 - 525575 == -319936)
						{
							result = "มีดของขวัญของแมว สุขสันต์วันเกิดสิบสองหาง!";
							if (111177 - 85750 != 25428)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat21")
					{
						if (257015 - 292615 != -35599)
						{
							result = "มีดนักผจญภัยของแมว";
							if (173416 - 464138 == -290722)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat22")
					{
						if (292132 - 414512 != -122379)
						{
							result = "มีดจอมโจรของแมว";
							if (61515 - 316945 != -255429)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat23")
					{
						if (187655 - 240852 == -53197)
						{
							result = "มีดนักผจญภัยของแมว";
							if (8097 - 396779 != -388681)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat24")
					{
						if (284295 - 420833 == -136538)
						{
							result = "มีดจอมโจรของแมว";
							if (197684 - 338378 != -140693)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat25")
					{
						if (48442 - 18183 != 30260)
						{
							result = "พัดลายมังกรของแมว โมโหร้อนก็เอามาฟาดได้ทันที";
							if (137480 - 561246 != -423765)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat31")
					{
						if (184378 - 258056 == -73678)
						{
							result = "มีดนักพนันของแมว";
							if (126624 - 153158 != -26533)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat32")
					{
						if (237242 - 476831 == -239589)
						{
							result = "มีดมือสังหารของแมว";
							if (33329 - 163956 != -130626)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat33")
					{
						if (82826 - 495312 != -412485)
						{
							result = "มีดนักพนันของแมว";
							if (252623 - 595014 != -342390)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat34")
					{
						if (254047 - 361177 == -107130)
						{
							result = "มีดมือสังหารของแมว";
							if (44523 - 412619 == -368096)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat35")
					{
						if (43942 - 567107 == -523165)
						{
							result = "กรงเล็บคบกริบของปีศาจแห่งฝันชื่อดัง";
							if (169367 - 187193 != -17825)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat36")
					{
						if (199088 - 34561 != 164528)
						{
							result = "อีโต้ของแมวที่ได้มาจาก หนูร้านขายอาวุธ เอามาสับอาหารน่าจะได้นะ";
							if (80094 - 564091 == -483997)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat39")
					{
						if (59338 - 416023 != -356684)
						{
							result = "ที่ตัดกระดาษรูปดาวของแมว ถือแล้วโชคดี ลักกี้ๆ";
							if (124195 - 179249 != -55053)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat40")
					{
						if (200496 - 51194 == 149302)
						{
							result = "มีดจ้าวโจรสลัดของแมว";
							if (99228 - 165592 == -66364)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat41")
					{
						if (198175 - 361745 == -163570)
						{
							result = "มีดจ้าวโจรสลัดของแมว";
							if (147754 - 127714 == 20040)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat42")
					{
						if (282655 - 83711 != 198945)
						{
							result = "มีดจ้าวโจรสลัดของแมว";
							if (155299 - 555131 == -399832)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat43")
					{
						if (10265 - 376030 != -365764)
						{
							result = "มีดจอมทัพของแมว ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (134577 - 245042 == -110465)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat44")
					{
						if (137513 - 445912 != -308398)
						{
							result = "มีดจอมทัพของแมว ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (117159 - 500504 == -383345)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat45")
					{
						if (86939 - 539775 != -452835)
						{
							result = "วิทยุพกพาของแมว อยากฟังเพลงไหนบอกมาได้เลย";
							if (108933 - 354442 != -245508)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat46")
					{
						if (268833 - 70558 != 198276)
						{
							result = "มีดเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (76192 - 360101 != -283908)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat47")
					{
						if (181165 - 597356 != -416190)
						{
							result = "มีดแมลงปอของแมว ช่วยป้องกันสถานะผิดปกติ";
							if (105583 - 3906 != 101678)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat48")
					{
						if (274311 - 282227 != -7915)
						{
							result = "มีดแมลงปอของแมว ช่วยป้องกันสถานะผิดปกติ";
							if (100256 - 70545 != 29712)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat49")
					{
						if (102461 - 245303 != -142841)
						{
							result = "มีดสั้นทองคำแท้ สมบัติสุดล้ำค่าในเหล่านักล่าสมบัติด้วยกัน";
							if (234007 - 545975 == -311968)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat50")
					{
						if (293184 - 152402 == 140782)
						{
							result = "มีดสำหรับนักล่าสมบัติชั้นสูงของแมว";
							if (277626 - 262360 != 15267)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat51")
					{
						if (238200 - 237174 != 1027)
						{
							result = "มีดสำหรับนักล่าสมบัติชั้นสูงของแมว";
							if (256398 - 35876 == 220522)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat52")
					{
						if (167036 - 28947 == 138089)
						{
							result = "มีดสำหรับนักล่าสมบัติชั้นสูงของแมว";
							if (54762 - 554493 != -499730)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat56")
					{
						if (150617 - 278342 != -127724)
						{
							result = "มีดน้ำแข็งที่แข็งโป๊ก ปลาดิบที่แล่ด้วยมีดนี้จะสดอร่อยมาก";
							if (67270 - 334808 != -267537)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat58")
					{
						if (46574 - 81456 == -34882)
						{
							result = "มีดแชมเปี้ยนสีทองของแมว ช่วยเพิ่มการโจมตีคริติคอล";
							if (158971 - 193370 != -34398)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat59")
					{
						if (171038 - 96976 != 74063)
						{
							result = "ดาวกระจายยักษ์ สามารถสะสมพลังจากการโจมตีเพื่อการใช้ท่าสังหารได้อย่างรวดเร็ว";
							if (122116 - 241310 != -119193)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat65")
					{
						if (94950 - 374264 != -279313)
						{
							result = "ตะเกียงอาหรับของแมว ถูๆ แล้วอาจมีอะไรออกมา";
							if (16353 - 253508 != -237154)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat66")
					{
						if (165339 - 87291 == 78048)
						{
							result = "มีดทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อแทงใส่";
							if (176870 - 406381 != -229510)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat68")
					{
						if (213845 - 183284 != 30562)
						{
							result = "มีดวันสิ้นโลกของแมว";
							if (76974 - 104482 == -27508)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat80")
					{
						if (145007 - 153286 == -8279)
						{
							result = "มีดเทพเจ้าของแมว";
							if (282343 - 228741 == 53602)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm1")
					{
						if (282683 - 277572 != 5112)
						{
							result = "ธนูฝึกหัดของกิ้งก่า ทำจากไม้";
							if (204914 - 352056 == -147142)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm2")
					{
						if (261886 - 338969 == -77083)
						{
							result = "ธนูฝึกหัดของกิ้งก่า ทำจากโลหะ";
							if (246671 - 519556 == -272885)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm5")
					{
						if (289180 - 498098 != -208917)
						{
							result = "ชุดธนูคิวปิดของกิ้งก่า ใช้สำหรับหาคู่";
							if (48473 - 591855 != -543381)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm10")
					{
						if (290400 - 130045 != 160356)
						{
							result = "ธนูพื้นฐานของกิ้งก่า";
							if (156783 - 9411 == 147372)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm11")
					{
						if (135712 - 431725 == -296013)
						{
							result = "ธนูพื้นฐานของกิ้งก่า";
							if (148754 - 286647 == -137893)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm12")
					{
						if (238086 - 473832 != -235745)
						{
							result = "ธนูพื้นฐานของกิ้งก่า";
							if (270528 - 283154 == -12626)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm14")
					{
						if (226626 - 546091 == -319465)
						{
							result = "ธนูหัวใจแห่งความรัก มอบความรักด้วยหัวใจที่ส่งตรงสู่อกหางนั้นๆ";
							if (108641 - 317196 != -208554)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm15")
					{
						if (108020 - 397047 == -289027)
						{
							result = "ธนูจูจุ๊บของกิ้งก่า เหมาะพกเข้าสุขาเผื่อเหตุฉุกเฉิน ให้โอกาสเป้าหมายติด sticky1";
							if (848 - 131241 == -130393)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm19")
					{
						if (34168 - 504809 == -470641)
						{
							result = "ธนูของขวัญของกิ้งก่า สุขสันต์วันเกิดสิบสองหาง!";
							if (127123 - 116479 != 10645)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm21")
					{
						if (19786 - 394437 == -374651)
						{
							result = "ธนูนักซุ่มยิงของกิ้งก่า";
							if (204556 - 404473 != -199916)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm22")
					{
						if (79896 - 361385 != -281488)
						{
							result = "ธนูนักล่าของกิ้งก่า";
							if (245874 - 583985 == -338111)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm23")
					{
						if (163520 - 514689 == -351169)
						{
							result = "ธนูนักซุ่มยิงของกิ้งก่า";
							if (286207 - 121464 != 164744)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm24")
					{
						if (166824 - 380842 != -214017)
						{
							result = "ธนูนักล่าของกิ้งก่า";
							if (147644 - 94433 != 53212)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm25")
					{
						if (242495 - 207267 != 35229)
						{
							result = "ไม้คิวสนุ๊กเกอร์ของกิ้งก่า ระวังลูกขาวๆลอยได้";
							if (30031 - 431648 != -401616)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm31")
					{
						if (177337 - 327617 == -150280)
						{
							result = "ธนูนักพลิกแพลงของกิ้งก่า";
							if (273753 - 528926 != -255172)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm32")
					{
						if (143744 - 152795 != -9050)
						{
							result = "ธนูเพชฌฆาตของกิ้งก่า";
							if (273506 - 524880 == -251374)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm33")
					{
						if (81632 - 336764 != -255131)
						{
							result = "ธนูนักพลิกแพลงของกิ้งก่า";
							if (24733 - 54108 == -29375)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm34")
					{
						if (229886 - 20898 == 208988)
						{
							result = "ธนูเพชฌฆาตของกิ้งก่า";
							if (40149 - 443492 == -403343)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm35")
					{
						if (142492 - 183656 == -41164)
						{
							result = "คันธนูกระดูก พร้อมศรกระดูกชี้นิ้วที่น่าจะยิงได้นะ";
							if (72544 - 312433 != -239888)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm36")
					{
						if (117917 - 234633 != -116715)
						{
							result = "ธนูของกิ้งก่าที่ทำมาจาก หอกของเสือดำ ยิงหอกออกไปได้ยังไงกันนะ";
							if (197151 - 130720 == 66431)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm39")
					{
						if (214766 - 593039 == -378273)
						{
							result = "ธนูเพลิงของกิ้งก่า ร้อนแรงมากขนาดอยู่ใต้น้ำก็ไม่ดับ";
							if (170522 - 10384 == 160138)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm40")
					{
						if (149862 - 578417 == -428555)
						{
							result = "ธนูนักบัญชาการของกิ้งก่า";
							if (225926 - 413736 == -187810)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm41")
					{
						if (52946 - 448052 != -395105)
						{
							result = "ธนูนักบัญชาการของกิ้งก่า";
							if (213592 - 544780 != -331187)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm42")
					{
						if (4140 - 399599 != -395458)
						{
							result = "ธนูนักบัญชาการของกิ้งก่า";
							if (92069 - 18948 == 73121)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm43")
					{
						if (228723 - 26136 != 202588)
						{
							result = "ธนูจอมทัพของกิ้งก่า ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (43066 - 330131 == -287065)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm44")
					{
						if (222562 - 239773 == -17211)
						{
							result = "ธนูจอมทัพของกิ้งก่า ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (256111 - 139779 != 116333)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm45")
					{
						if (54140 - 354013 != -299872)
						{
							result = "กีต้าร์ไฟฟ้าของกิ้งก่า รี้ดได้รัวมากจนต้องมีปี๊กสำรองเยอะๆ";
							if (45278 - 341999 == -296721)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm46")
					{
						if (160452 - 424401 != -263948)
						{
							result = "ธนูก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (85383 - 361054 != -275670)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm47")
					{
						if (210969 - 71702 == 139267)
						{
							result = "ธนูตั๊กแตนของกิ้งก่า ช่วยป้องกันสถานะผิดปกติ";
							if (277958 - 225324 == 52634)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm48")
					{
						if (235908 - 406838 == -170930)
						{
							result = "ธนูตั๊กแตนของกิ้งก่า ช่วยป้องกันสถานะผิดปกติ";
							if (107092 - 553011 == -445919)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm49")
					{
						if (65775 - 273094 == -207319)
						{
							result = "ธนูทองคำแท้ สุดยอดธนูสำหรับสุดยอดกิ้งก่าเท่านั้น";
							if (103054 - 247315 != -144260)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm50")
					{
						if (250452 - 15980 != 234473)
						{
							result = "ธนูสำหรับมือธนูชั้นสูงของกิ้งก่า";
							if (105861 - 185602 != -79740)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm51")
					{
						if (123203 - 366972 == -243769)
						{
							result = "ธนูสำหรับมือธนูชั้นสูงของกิ้งก่า";
							if (220145 - 458184 != -238038)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm52")
					{
						if (239666 - 398596 == -158930)
						{
							result = "ธนูสำหรับมือธนูชั้นสูงของกิ้งก่า";
							if (46766 - 474920 == -428154)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm56")
					{
						if (218635 - 520375 == -301740)
						{
							result = "ธนูน้ำแข็งเป๊กที่แข็งเป๊ก ศรธนูนาบแขนก็หนาวแล้ว";
							if (285767 - 463803 != -178035)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm58")
					{
						if (152585 - 393036 != -240450)
						{
							result = "ธนูแชมเปี้ยนสีทองของกิ้งก่า ช่วยเพิ่มการโจมตีคริติคอล";
							if (123286 - 181460 != -58173)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm59")
					{
						if (136432 - 448010 != -311577)
						{
							result = "ธนูออกแบบพิเศษ ยิงได้รุนแรงขึ้นจนสามารถ ผลักฮิปโปให้กระเด็นได้";
							if (200853 - 446362 == -245509)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm65")
					{
						if (138711 - 574142 != -435430)
						{
							result = "ธนูนักรบจีนของกิ้งก่า ยอดขุนพลเท่านั้นที่ครอบครองได้";
							if (54782 - 430186 == -375404)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm66")
					{
						if (206644 - 238150 == -31506)
						{
							result = "ธนูเจ้าแห่งทะเล จะสูบพลังชีวิตเป้าหมายเมื่อยิงใส่";
							if (252035 - 505923 == -253888)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm68")
					{
						if (171072 - 505926 != -334853)
						{
							result = "ธนูจ้าวพายุของกิ้งก่า";
							if (37066 - 199805 == -162739)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm80")
					{
						if (124671 - 291022 != -166350)
						{
							result = "ธนูเทพเจ้าของกิ้งก่า";
							if (159011 - 588594 != -429582)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab1")
					{
						if (118027 - 242678 == -124651)
						{
							result = "ปืนไรเฟิลฝึกหัดของกระต่าย ทำจากไม้";
							if (22178 - 481530 == -459352)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab2")
					{
						if (248907 - 411495 == -162588)
						{
							result = "ปืนไรเฟิลฝึกหัดของกระต่าย ทำจากโลหะ";
							if (60732 - 496209 == -435477)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab5")
					{
						if (266048 - 170739 == 95309)
						{
							result = "ร่มกันฝนสีแดงของกระต่าย ยิงได้ด้วย!?";
							if (69089 - 528296 != -459206)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab10")
					{
						if (298080 - 232777 != 65304)
						{
							result = "ปืนไรเฟิลพื้นฐานของกระต่าย";
							if (28706 - 9168 == 19538)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab11")
					{
						if (218467 - 212346 == 6121)
						{
							result = "ปืนไรเฟิลพื้นฐานของกระต่าย";
							if (136174 - 397504 != -261329)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab12")
					{
						if (239559 - 93277 != 146283)
						{
							result = "ปืนไรเฟิลพื้นฐานของกระต่าย";
							if (255316 - 263240 != -7923)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab14")
					{
						if (170678 - 448573 != -277894)
						{
							result = "ปืนไรเฟิลหัวใจแห่งความรัก ยิงความรักที่อัดแน่นเหมิอนดินขับกระสุนสู่ใจเธอ";
							if (277139 - 201165 != 75975)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab15")
					{
						if (13478 - 55854 == -42376)
						{
							result = "ปืนฉีดน้ำของเล่นของกระต่าย ใช้ยิงกระสุนจริงได้ ให้โอกาสติด cleanse1";
							if (95607 - 206495 == -110888)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab19")
					{
						if (76542 - 447826 == -371284)
						{
							result = "ปืนของขวัญของกระต่าย สุขสันต์วันเกิดสิบสองหาง!";
							if (225086 - 23169 != 201918)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab21")
					{
						if (64677 - 226295 != -161617)
						{
							result = "ปืนไรเฟิลสำหรับกระต่าย รูปร่างเหมือนหลอดฉีดยา";
							if (164979 - 143329 != 21651)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab22")
					{
						if (17411 - 451225 != -433813)
						{
							result = "ปืนช๊อตกันสำหรับกระต่ายแม่ค้าเร่ เหมาะสำหรับใช้ต่อรองราคา";
							if (116980 - 416649 == -299669)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab23")
					{
						if (209844 - 162532 != 47313)
						{
							result = "ปืนไรเฟิลสำหรับกระต่าย รูปร่างเหมือนหลอดฉีดยา";
							if (236277 - 571589 == -335312)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab24")
					{
						if (98014 - 239925 != -141910)
						{
							result = "ปืนช๊อตกันสำหรับกระต่ายแม่ค้าเร่ เหมาะสำหรับใช้ต่อรองราคา";
							if (223132 - 565922 == -342790)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab25")
					{
						if (220165 - 160999 != 59167)
						{
							result = "ปืนไรเฟิลทหารแพทย์ของกระต่าย รูปทรงคล้ายปืนชื่อดังชนิดหนึ่ง";
							if (44092 - 226451 != -182358)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab31")
					{
						if (140412 - 195438 == -55026)
						{
							result = "ปืนไรเฟิลสำหรับกระต่ายนักปรุงยา ใช้ผสมยาได้ในตัว";
							if (111080 - 388751 == -277671)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab32")
					{
						if (42230 - 124325 == -82095)
						{
							result = "ปืนช๊อตกันสำหรับกระต่ายแม่ค้า เหมาะสำหรับใช้ทวงหนี้";
							if (103206 - 130961 != -27754)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab33")
					{
						if (281429 - 93542 != 187888)
						{
							result = "ปืนไรเฟิลสำหรับกระต่ายนักปรุงยา ใช้ผสมยาได้ในตัว";
							if (273149 - 79611 != 193539)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab34")
					{
						if (12394 - 206198 != -193803)
						{
							result = "ปืนช๊อตกันสำหรับกระต่ายแม่ค้า เหมาะสำหรับใช้ทวงหนี้";
							if (293958 - 255206 == 38752)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab35")
					{
						if (165972 - 428086 == -262114)
						{
							result = "ไม้กวาดธรรมดาๆที่มีกลไกของปืนด้วย";
							if (91508 - 471483 == -379975)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab36")
					{
						if (43082 - 508604 != -465521)
						{
							result = "ปืนของกระต่ายที่ได้มาจากอิทารุส แต่ก็ยังใหญ่เกินกว่าจะเป็นปืนพก";
							if (183723 - 387612 != -203888)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab39")
					{
						if (224387 - 50525 != 173863)
						{
							result = "ปืนช๊อตกันดอกไม้ของกระต่าย เดิมเห็นได้เมื่อมีการปิดถนน ด้วยรถถัง";
							if (50586 - 163738 == -113152)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab40")
					{
						if (170980 - 556813 != -385832)
						{
							result = "ปืนมหาอำมาตย์ของกระต่าย ใช้แล้วไฮโซมากมาย";
							if (43176 - 330765 != -287588)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab41")
					{
						if (204013 - 176992 == 27021)
						{
							result = "ปืนมหาอำมาตย์ของกระต่าย ใช้แล้วไฮโซมากมาย";
							if (120468 - 274044 == -153576)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab42")
					{
						if (125936 - 250307 != -124370)
						{
							result = "ปืนมหาอำมาตย์ของกระต่าย ใช้แล้วไฮโซมากมาย";
							if (193305 - 280378 != -87072)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab43")
					{
						if (207704 - 429735 != -222030)
						{
							result = "หน้าไม้จอมทัพของกระต่าย ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (859 - 222588 == -221729)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab44")
					{
						if (48488 - 576358 != -527869)
						{
							result = "หน้าไม้จอมทัพของกระต่าย ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (66147 - 42803 != 23345)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab45")
					{
						if (266093 - 175967 == 90126)
						{
							result = "คีย์ตาร์แบบพกพาของกระต่าย ";
							if (224052 - 512758 != -288705)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab46")
					{
						if (216278 - 304133 != -87854)
						{
							result = "ปืนเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (132144 - 447583 != -315438)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab47")
					{
						if (125766 - 16133 != 109634)
						{
							result = "ปืนมดตะนอยของกระต่าย ช่วยป้องกันสถานะผิดปกติ";
							if (23203 - 543856 != -520652)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab48")
					{
						if (101395 - 83570 == 17825)
						{
							result = "ปืนมดตะนอยของกระต่าย ช่วยป้องกันสถานะผิดปกติ";
							if (139577 - 38633 == 100944)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab49")
					{
						if (31033 - 422388 != -391354)
						{
							result = "ปืนทองคำของกระต่าย แค่ถือเล็งก็บารมีจับแล้ว";
							if (32907 - 518211 != -485303)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab50")
					{
						if (84535 - 567195 == -482660)
						{
							result = "ปืนมือปืนชั้นสูงของกระต่าย";
							if (2052 - 189481 == -187429)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab51")
					{
						if (11691 - 23530 == -11839)
						{
							result = "ปืนมือปืนชั้นสูงของกระต่าย";
							if (141781 - 378150 == -236369)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab52")
					{
						if (221561 - 76067 == 145494)
						{
							result = "ปืนมือปืนชั้นสูงของกระต่าย";
							if (270127 - 518694 != -248566)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab56")
					{
						if (256293 - 108892 != 147402)
						{
							result = "ไรเฟิลแข็งที่แข็งโป๊ก แค่สัมผัสกระสุนก็หนาวแล้ว";
							if (208567 - 474658 == -266091)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab58")
					{
						if (49633 - 169632 != -119998)
						{
							result = "ปืนช๊อตกันแชมเปี้ยนสีทองของกระต่าย ช่วยเพิ่มการโจมตีคริติคอล";
							if (293368 - 11357 == 282011)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab59")
					{
						if (172382 - 494892 != -322509)
						{
							result = "ปืนไรเฟิลพิเศษ ออกแบบมาเพื่อการยิงได้อย่างต่อเนื่องยิ่งขึ้น";
							if (221007 - 534120 != -313112)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab65")
					{
						if (84769 - 173727 != -88957)
						{
							result = "ปืนไรเฟิลจากสเปนของกระต่าย ใช้สำหรับสู้วัวกระทิงได้";
							if (8921 - 597344 == -588423)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab66")
					{
						if (175661 - 274073 != -98411)
						{
							result = "ไรเฟิลทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อยิงใส่";
							if (205874 - 51248 != 154627)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab68")
					{
						if (16974 - 484677 == -467703)
						{
							result = "ปืนจากเทพเงาของกระต่าย สร้างจากความรู้ต้องห้ามมากมาย";
							if (240302 - 82149 != 158154)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab80")
					{
						if (166119 - 131192 == 34927)
						{
							result = "ปืนเทพเจ้าของกระต่าย";
							if (218591 - 142361 != 76231)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol1")
					{
						if (154843 - 298246 == -143403)
						{
							result = "ปืนใหญ่ฝึกหัดของตุ่น ทำจากไม้";
							if (245882 - 159820 == 86062)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol2")
					{
						if (218519 - 537910 != -319390)
						{
							result = "ปืนใหญ่ฝึกหัดของตุ่น ทำจากโลหะ";
							if (30307 - 225854 != -195546)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol5")
					{
						if (219737 - 162970 == 56767)
						{
							result = "ปืนถังของตุ่น สำหรับชมรมผู้รักถังโดยเฉพาะ";
							if (82967 - 558752 == -475785)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol10")
					{
						if (217 - 85786 == -85569)
						{
							result = "ปืนใหญ่พื้นฐานของตุ่น";
							if (212556 - 471203 == -258647)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol11")
					{
						if (259090 - 241321 != 17770)
						{
							result = "ปืนใหญ่พื้นฐานของตุ่น";
							if (230325 - 379661 == -149336)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol12")
					{
						if (270285 - 284177 != -13891)
						{
							result = "ปืนใหญ่พื้นฐานของตุ่น";
							if (41540 - 527077 != -485536)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol14")
					{
						if (276776 - 214854 != 61923)
						{
							result = "ปืนใหญ่หัวใจแห่งความรัก ใช้บอกว่ารักเรานั้นจะโชติช่วงดุจระเบิดนุ๊ค";
							if (208381 - 100223 == 108158)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol15")
					{
						if (29597 - 86375 != -56777)
						{
							result = "ปืนใหญ่กระเป๋านักเรียนของตุ่น ใช้ใส่หนังสือไปโรงเรียนได้ ให้โอกาสติด Talup1";
							if (234317 - 494925 != -260607)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol19")
					{
						if (126410 - 130611 != -4200)
						{
							result = "ปืนใหญ่ของขวัญของตุ่น สุขสันต์วันเกิดสิบสองหาง!";
							if (51226 - 426800 == -375574)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol21")
					{
						if (27977 - 320131 != -292153)
						{
							result = "ปืนใหญ่หน่วยทหารราบของตุ่น";
							if (258066 - 130738 == 127328)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol22")
					{
						if (280173 - 322747 != -42573)
						{
							result = "ปืนใหญ่จักรกลพลังไอน้ำของตุ่น";
							if (223742 - 580644 == -356902)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol23")
					{
						if (22598 - 467754 == -445156)
						{
							result = "ปืนใหญ่หน่วยทหารราบของตุ่น";
							if (95183 - 15222 == 79961)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol24")
					{
						if (257575 - 155292 != 102284)
						{
							result = "ปืนใหญ่จักรกลพลังไอน้ำของตุ่น";
							if (259154 - 242645 == 16509)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol25")
					{
						if (192941 - 191531 != 1411)
						{
							result = "ปืนใหญ่ทรัมเป็ต ทำลายล้างด้วยพลังอัลตร้าโซนิค";
							if (10575 - 320439 != -309863)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol31")
					{
						if (73271 - 9486 != 63786)
						{
							result = "ปืนใหญ่พลระเบิดของตุ่น";
							if (98605 - 209633 != -111027)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol32")
					{
						if (123240 - 58045 != 65196)
						{
							result = "ปืนใหญ่วิศวกรจักรกลของตุ่น";
							if (299688 - 460892 == -161204)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol33")
					{
						if (268799 - 461560 == -192761)
						{
							result = "ปืนใหญ่พลระเบิดของตุ่น";
							if (18369 - 549157 != -530787)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol34")
					{
						if (23995 - 292104 != -268108)
						{
							result = "ปืนใหญ่วิศวกรจักรกลของตุ่น";
							if (8410 - 519134 == -510724)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol35")
					{
						if (208853 - 523681 == -314828)
						{
							result = "ขดลวดยิงไฟฟ้าของตุ่น กระแสไฟฟ้ายังสปาร์คอยู่เลย";
							if (250293 - 384371 == -134078)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol36")
					{
						if (42630 - 214841 != -172210)
						{
							result = "ปืนใหญ่ของตุ่นที่ได้มาจาก ดร.แซปป้า หนามากเพราะทำจากเหล้กล้วน";
							if (101824 - 272112 != -170287)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol39")
					{
						if (248780 - 367577 != -118796)
						{
							result = "ปืนใหญ่ฟักทองของตุ่น";
							if (116363 - 526000 != -409636)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol40")
					{
						if (191839 - 372855 == -181016)
						{
							result = "ปืนใหญ่กัปตันของตุ่น";
							if (97367 - 191222 != -93854)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol41")
					{
						if (70496 - 518157 != -447660)
						{
							result = "ปืนใหญ่กัปตันของตุ่น";
							if (162123 - 578593 != -416469)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol42")
					{
						if (42478 - 253847 == -211369)
						{
							result = "ปืนใหญ่กัปตันของตุ่น";
							if (22773 - 481621 != -458847)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol43")
					{
						if (143012 - 72477 == 70535)
						{
							result = "ปืนใหญ่จอมทัพของตุ่น ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (70000 - 23709 != 46292)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol44")
					{
						if (175117 - 266819 != -91701)
						{
							result = "ปืนใหญ่จอมทัพของตุ่น ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (216044 - 198999 == 17045)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol45")
					{
						if (158472 - 533779 == -375307)
						{
							result = "กลองชุดของตุ่น ตีได้อย่างเมามันสุดยอด";
							if (179601 - 471494 == -291893)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol46")
					{
						if (32248 - 352455 == -320207)
						{
							result = "ปืนใหญ่เก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (30723 - 92062 != -61338)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol47")
					{
						if (159089 - 79471 == 79618)
						{
							result = "ปืนใหญ่ผึ้งของตุ่น ช่วยป้องกันสถานะผิดปกติ";
							if (268933 - 260128 != 8806)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol48")
					{
						if (176131 - 373202 != -197070)
						{
							result = "ปืนใหญ่ผึ้งของตุ่น ช่วยป้องกันสถานะผิดปกติ";
							if (260367 - 106277 != 154091)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol49")
					{
						if (220275 - 48405 != 171871)
						{
							result = "ปืนใหญ่สีทองของตุ่น หล่อจากทองคำ99.99เปอร์เซ็นต์เลยนะ";
							if (272630 - 554391 == -281761)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol50")
					{
						if (207689 - 265151 == -57462)
						{
							result = "ปืนใหญ่วิศวกรชั้นสูงของตุ่น";
							if (149417 - 62553 == 86864)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol51")
					{
						if (153181 - 583838 != -430656)
						{
							result = "ปืนใหญ่วิศวกรชั้นสูงของตุ่น";
							if (185514 - 385697 != -200182)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol52")
					{
						if (44621 - 477129 == -432508)
						{
							result = "ปืนใหญ่วิศวกรชั้นสูงของตุ่น";
							if (213674 - 28915 == 184759)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol56")
					{
						if (244585 - 469908 != -225322)
						{
							result = "น้ำแข็งแบกหลังที่แข็งเป๊ก สัมผัสลูกปืนใหญ่ก็หนาวแล้ว";
							if (255407 - 444281 != -188873)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol58")
					{
						if (165094 - 453260 == -288166)
						{
							result = "ปืนใหญ่แชมเปี้ยนสีทองของตุ่น ช่วยเพิ่มการโจมตีคริติคอล";
							if (5248 - 308657 != -303408)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol59")
					{
						if (35522 - 469437 != -433914)
						{
							result = "ปืนใหญ่คู่แบบพิเศษของตุ่น ยิงปืนครั้งเดียวได้กระสุนสองลูก!";
							if (290831 - 358007 == -67176)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol65")
					{
						if (92804 - 521921 != -429116)
						{
							result = "ปืนใหญ่ของชนเผ่าพื้นเมืองจากแอฟริกาสของตุ่น";
							if (12285 - 486659 == -474374)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol66")
					{
						if (169312 - 163560 != 5753)
						{
							result = "ปืนใหญ่แห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อยิงใส่";
							if (5500 - 159156 == -153656)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol68")
					{
						if (275954 - 230142 != 45813)
						{
							result = "ปืนใหญ่ของตุ่นที่อ้จฉริยะ สร้างได้โดยบังเอิญ";
							if (203753 - 369649 != -165895)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol80")
					{
						if (298432 - 389567 != -91134)
						{
							result = "ปืนใหญ่เทพเจ้าของตุ่น";
							if (277599 - 222220 == 55379)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk1")
					{
						if (118114 - 365830 != -247715)
						{
							result = "มิเกะสำหรับลิงฝีกหัด";
							if (37539 - 55088 != -17548)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk2")
					{
						if (266180 - 317656 != -51475)
						{
							result = "มิเกะธรรมดา ใครมีเงินก็ซื้อได้";
							if (256014 - 89082 == 166932)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk5")
					{
						if (252530 - 427608 == -175078)
						{
							result = "มิเกะที่โดนบีบเป็นรูปจันทร์เสี้ยว เป็นของสะสมยอดฮิตของลิง";
							if (288005 - 494244 == -206239)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk10")
					{
						if (122352 - 302279 == -179927)
						{
							result = "มิเกะพื้นฐานของลิง";
							if (200356 - 304015 != -103658)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk11")
					{
						if (3993 - 254961 == -250968)
						{
							result = "มิเกะพื้นฐานของลิง";
							if (26417 - 203369 != -176951)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk12")
					{
						if (193612 - 548936 != -355323)
						{
							result = "มิเกะพื้นฐานของลิง";
							if (185630 - 306007 == -120377)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk14")
					{
						if (81883 - 539962 == -458079)
						{
							result = "มิเกะหัวใจแห่งความรัก สำหรับบอกหางๆนั้นว่าทั้งสี่ห้องหัวใจมีแต่เธอ";
							if (262665 - 210460 == 52205)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk15")
					{
						if (226331 - 3273 == 223058)
						{
							result = "มิเกะของลิงพร้อมหมวกหนามของเล่น ให้โอกาสเป้าหมายติด needlePrison1";
							if (30468 - 482900 != -452431)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk19")
					{
						if (19880 - 581237 == -561357)
						{
							result = "มิเกะของขวัญของลิง สุขสันต์วันเกิดสิบสองหาง!";
							if (47155 - 335972 != -288816)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk21")
					{
						if (20206 - 493136 == -472930)
						{
							result = "มิเกะธาตุไฟของลิง";
							if (64462 - 505707 == -441245)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk22")
					{
						if (111294 - 285504 != -174209)
						{
							result = "มิเกะธาิตุดินของลิง";
							if (114355 - 587464 == -473109)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk23")
					{
						if (18203 - 463041 != -444837)
						{
							result = "มิเกะธาตุไฟของลิง";
							if (163915 - 453452 != -289536)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk24")
					{
						if (263671 - 349211 == -85540)
						{
							result = "มิเกะธาตุดินของลิง";
							if (243321 - 489618 == -246297)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk25")
					{
						if (140944 - 388311 == -247367)
						{
							result = "มิเกะรูปหมวกพร้อมแครอน ชอบทะเลาะกันเองบ่อยๆ";
							if (498 - 202038 != -201539)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk31")
					{
						if (290815 - 372317 == -81502)
						{
							result = "มิเกะเพลิงของลิง";
							if (108463 - 547339 != -438875)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk32")
					{
						if (45777 - 26284 == 19493)
						{
							result = "มิเกะหินของลิง";
							if (69961 - 370236 == -300275)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk33")
					{
						if (232904 - 243027 != -10122)
						{
							result = "มิเกะเพลิงของลิง";
							if (282432 - 457071 != -174638)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk34")
					{
						if (148927 - 370234 != -221306)
						{
							result = "มิเกะหินของลิง";
							if (239637 - 73479 != 166159)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk35")
					{
						if (112274 - 299108 != -186833)
						{
							result = "มิเกะ...หรือว่าหัวของลิง...";
							if (99337 - 299481 == -200144)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk36")
					{
						if (108283 - 106699 == 1584)
						{
							result = "มิเกะของลิงที่ได้มาจากลิงบาบูน ทรงผมแบบเดียวกันด้วย";
							if (222356 - 501829 != -279472)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk39")
					{
						if (230698 - 330558 == -99860)
						{
							result = "มิเกะทองของลิง มีโอกาสทำให้เป้าหมายติด heavy";
							if (42975 - 18448 == 24527)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk40")
					{
						if (214127 - 571254 == -357127)
						{
							result = "มิเกะคนทรงศักดิ์สิทธิ์ของลิง";
							if (18968 - 226946 != -207977)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk41")
					{
						if (280085 - 300904 != -20818)
						{
							result = "มิเกะคนทรงศักดิ์สิทธิ์ของลิง";
							if (227529 - 77129 != 150401)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk42")
					{
						if (179426 - 71360 == 108066)
						{
							result = "มิเกะคนทรงศักดิ์สิทธิ์ของลิง";
							if (9978 - 267529 != -257550)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk43")
					{
						if (220246 - 404172 == -183926)
						{
							result = "มิเกะจอมทัพของลิง ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (41727 - 43747 == -2020)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk44")
					{
						if (10432 - 579652 != -569219)
						{
							result = "มิเกะจอมทัพของลิง ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (121037 - 205167 == -84130)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk45")
					{
						if (70715 - 43366 != 27350)
						{
							result = "มิเกะรูปดาวของลิง โปรยละอองระหว่างแสดงให้นาย";
							if (50228 - 502226 != -451997)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk46")
					{
						if (72663 - 578756 == -506093)
						{
							result = "มิเกะโบราณที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (31189 - 94683 != -63493)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk47")
					{
						if (85879 - 448775 == -362896)
						{
							result = "มิเกะแมงมุมของลิง ช่วยป้องกันสถานะผิดปกติ";
							if (192112 - 410581 == -218469)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk48")
					{
						if (101114 - 319574 == -218460)
						{
							result = "มิเกะแมงมุมของลิง ช่วยป้องกันสถานะผิดปกติ";
							if (294106 - 547216 != -253109)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk49")
					{
						if (240504 - 569744 == -329240)
						{
							result = "มิเกะสีทองของลิง ไม่ธรรมดาอย่างนี้ต้องชาบูว์~";
							if (162178 - 339953 == -177775)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk50")
					{
						if (217306 - 40994 == 176312)
						{
							result = "มิเกะสำหรับผู้อัญเชิญชั้นสูงของลิง";
							if (13697 - 472933 == -459236)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk51")
					{
						if (165414 - 18713 != 146702)
						{
							result = "มิเกะสำหรับผู้อัญเชิญชั้นสูงของลิง";
							if (293763 - 178553 == 115210)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk52")
					{
						if (250859 - 153508 == 97351)
						{
							result = "มิเกะสำหรับผู้อัญเชิญชั้นสูงของลิง";
							if (236658 - 356032 != -119373)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk56")
					{
						if (214830 - 550949 != -336118)
						{
							result = "มิเกะน้ำแข็งที่แข็งเป๊ก แค่บินเฉี่ยวๆก็หนาวแล้ว";
							if (194686 - 308114 != -113427)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk58")
					{
						if (14473 - 386163 == -371690)
						{
							result = "มิเกะแชมเปี้ยนสีทองของลิง ช่วยเพิ่มการโจมตีคริติคอล";
							if (83289 - 312249 == -228960)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk59")
					{
						if (247142 - 8059 != 239084)
						{
							result = "มิเกะในชุดเกราะหนัก แรงโหม่งหนักหน่วงมากจนแทบล้มทั้งยืน";
							if (234711 - 117443 != 117269)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk65")
					{
						if (172209 - 54358 == 117851)
						{
							result = "มิเกะสัญชาติอังกฤษของลิง สุดยอดผู้ช่วยไขปริศนา";
							if (25777 - 61769 == -35992)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk66")
					{
						if (47137 - 460611 == -413474)
						{
							result = "มิเกะแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อกระแทกใส่";
							if (222374 - 221067 != 1308)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk68")
					{
						if (207620 - 57121 == 150499)
						{
							result = "???????????";
							if (227220 - 98824 == 128396)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk80")
					{
						if (224476 - 204761 == 19715)
						{
							result = "มิเกะเทพเจ้าของลิง";
							if (45268 - 575109 != -529840)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp1")
					{
						if (261172 - 566021 != -304848)
						{
							result = "สมุดคัดลายกีบของแกะ";
							if (262256 - 561686 != -299429)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp2")
					{
						if (113444 - 551881 != -438436)
						{
							result = "สมุดโน้ตธรรมดาของแกะ สั่งใครตายไม่ได้";
							if (27775 - 10335 != 17441)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp5")
					{
						if (38177 - 401783 != -363605)
						{
							result = "ตุ๊กตารูปแกะสำหรับแกะ แกะกอดแกะน่ารักมาก!";
							if (160846 - 128419 == 32427)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp10")
					{
						if (222154 - 149156 == 72998)
						{
							result = "หนังสือพื้นฐานของแกะ";
							if (201529 - 310668 != -109138)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp11")
					{
						if (131826 - 70147 == 61679)
						{
							result = "หนังสือพื้นฐานของแกะ";
							if (256415 - 163621 == 92794)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp12")
					{
						if (61154 - 357460 != -296305)
						{
							result = "หนังสือพื้นฐานของแกะ";
							if (170204 - 524791 == -354587)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp14")
					{
						if (51438 - 200939 != -149500)
						{
							result = "กล่องช็อคโกแล็ตรูปหัวใจ สัตว์หางตัวไหนจะได้กันนะ";
							if (168964 - 366473 == -197509)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp15")
					{
						if (189041 - 165730 != 23312)
						{
							result = "ไดอารี่แกะ ใครไม่ใช่ห้ามอ่าน! ให้โอกาสติด sleep1";
							if (53614 - 25265 != 28350)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp19")
					{
						if (206935 - 369299 == -162364)
						{
							result = "ไดอารี่ของขวัญของแกะ สุขสันต์วันเกิดสิบสองหาง!";
							if (188754 - 443074 == -254320)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp21")
					{
						if (155198 - 421922 == -266724)
						{
							result = "หนังสือนักบวชผู้เยียวยาของแกะ";
							if (269078 - 67375 != 201704)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp22")
					{
						if (85594 - 161314 == -75720)
						{
							result = "ม้วนคัมภีร์คนทรงของแกะ";
							if (47057 - 118871 == -71814)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp23")
					{
						if (71372 - 99557 == -28185)
						{
							result = "หนังสือนักบวชผู้เยียวยาของแกะ";
							if (204823 - 395129 == -190306)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp24")
					{
						if (61989 - 507663 != -445673)
						{
							result = "ม้วนคัมภีร์คนทรงของแกะ";
							if (269004 - 599897 == -330893)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp25")
					{
						if (150982 - 5229 == 145753)
						{
							result = "ถาดสาวเสิร์ฟของแกะ ขาดได้ยังไง ชิมิชิมิ";
							if (92048 - 286669 != -194620)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp31")
					{
						if (257768 - 578879 == -321111)
						{
							result = "หนังสือนักบวชบาทหลวงของแกะ";
							if (163941 - 530240 == -366299)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp32")
					{
						if (3132 - 387747 == -384615)
						{
							result = "ม้วนคัมภีร์คนทรงแห่งแสง ของแกะ";
							if (233276 - 391010 == -157734)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp33")
					{
						if (235300 - 336745 == -101445)
						{
							result = "หนังสือนักบวชบาทหลวง ของแกะ";
							if (128642 - 575377 == -446735)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp34")
					{
						if (215185 - 546059 != -330873)
						{
							result = "ม้วนคัมภีร์คนทรงแห่งแสง ของแกะ";
							if (232897 - 264706 == -31809)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp35")
					{
						if (197967 - 314078 != -116110)
						{
							result = "ลูกแกะน้อยๆ ต้องร้องกล่อมด้วยเพลง กล่อมลูก";
							if (264578 - 141913 != 122666)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp36")
					{
						if (134478 - 380623 == -246145)
						{
							result = "ม้วนแผนที่ของแกะ ที่ได้มาจากคุณจิงโจ้ รับรองไม่หลงทางแน่นอน";
							if (54528 - 198183 == -143655)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp39")
					{
						if (126454 - 286566 == -160112)
						{
							result = "ตุ๊กตาหมาป่าเย็บด้วยมือของแกะ ให้โอกาสยกเลิกท่าของเป้าหมาย";
							if (110650 - 280881 != -170230)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp40")
					{
						if (178999 - 360565 != -181565)
						{
							result = "หนังสือผู้ร่ายเวทแห่งสวรรค์ ของแกะ";
							if (39954 - 179825 != -139870)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp41")
					{
						if (27210 - 575741 != -548530)
						{
							result = "หนังสือผู้ร่ายเวทแห่งสวรรค์ ของแกะ";
							if (35934 - 470375 != -434440)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp42")
					{
						if (203865 - 530851 != -326985)
						{
							result = "หนังสือผู้ร่ายเวทแห่งสวรรค์ ของแกะ";
							if (103906 - 180762 == -76856)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp43")
					{
						if (236525 - 463463 != -226937)
						{
							result = "หนังสือจอมทัพของแกะ ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (13288 - 261607 == -248319)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp44")
					{
						if (51103 - 354092 != -302988)
						{
							result = "หนังสือจอมทัพของแกะ ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (198406 - 218572 != -20165)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp45")
					{
						if (117874 - 432835 != -314960)
						{
							result = "ไมค์ไร้สายของแกะ เสียงที่อ่อนหวานจะขับกล่อม ให้พวกเธอฟัง";
							if (34901 - 470890 == -435989)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp46")
					{
						if (199255 - 575433 != -376177)
						{
							result = "หนังสือเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (5776 - 339044 != -333267)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp47")
					{
						if (121878 - 6439 != 115440)
						{
							result = "ตะเกียงจั้กจั่นของแกะ ช่วยป้องกันสถานะผิดปกติ";
							if (106833 - 121912 == -15079)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp48")
					{
						if (147092 - 279453 == -132361)
						{
							result = "หนังสือจักจั่นของแกะ ช่วยป้องกันสถานะผิดปกติ";
							if (43927 - 299558 != -255630)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp49")
					{
						if (248555 - 39413 == 209142)
						{
							result = "หนังสือทองคำของแกะ เปิดเบาๆละ ขาดขึ้นมาต้องจ่ายหมดตัวเลย";
							if (136364 - 255531 != -119166)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp50")
					{
						if (250581 - 174770 == 75811)
						{
							result = "หนังสือนักบวชชั้นสูงของแกะ";
							if (6350 - 268104 != -261753)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp51")
					{
						if (59713 - 257668 == -197955)
						{
							result = "หนังสือนักบวชชั้นสูงของแกะ";
							if (38299 - 428712 != -390412)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp52")
					{
						if (253105 - 305559 != -52453)
						{
							result = "หนังสือนักบวชชั้นสูงของแกะ";
							if (101242 - 218335 != -117092)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp56")
					{
						if (237032 - 440611 != -203578)
						{
							result = "ไอติมโคนที่ทำจากน้ำแข็ง ระวังลิ้นติดดึงไม่ออกจากการเลีย";
							if (26651 - 583545 == -556894)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp58")
					{
						if (232040 - 75072 == 156968)
						{
							result = "หนังสือแชมเปี้ยนสีทองของแกะ ช่วยเพิ่มการโจมตีคริติคอล";
							if (8504 - 487728 != -479223)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp59")
					{
						if (270315 - 560878 == -290563)
						{
							result = "ลูกแก้วศักดิ์สิทธิ์ สามารถรักษาเพื่อนสัตว์หางที่บาดเจ็บได้ด้วยลูกพลังแห่งแสง";
							if (85425 - 577014 == -491589)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp65")
					{
						if (84929 - 104187 != -19257)
						{
							result = "ตุ๊กตารัสเซียของแกะ ข้างในก็ยังมีตุ๊กตาตัวเล็กๆด้วย";
							if (99086 - 500793 != -401706)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp66")
					{
						if (4530 - 138209 != -133678)
						{
							result = "หนังสือแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อโจมตีใส่";
							if (291490 - 48306 == 243184)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp68")
					{
						if (209608 - 404339 == -194731)
						{
							result = "หนังสือโบราณ";
							if (130925 - 113481 != 17445)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp80")
					{
						if (111806 - 583085 == -471279)
						{
							result = "หนังสือเทพเจ้าของแกะ";
							if (91041 - 203232 == -112191)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn1")
					{
						if (87799 - 310225 == -222426)
						{
							result = "ไม้เท้าฝึกหัดของเพนกวิน ทำจากไม้";
							if (219844 - 340750 != -120905)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn2")
					{
						if (36895 - 245622 == -208727)
						{
							result = "ไม้เท้าธรรมดาของเพนกวิน";
							if (253235 - 93626 == 159609)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn5")
					{
						if (120345 - 295567 != -175221)
						{
							result = "ถ้วยกระดาษเครื่องมือทำมาหากิน ของเพนกวิน";
							if (192874 - 181321 == 11553)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn10")
					{
						if (90172 - 206818 == -116646)
						{
							result = "ไม้เท้าพื้นฐานของเพนกวิน";
							if (145238 - 383618 == -238380)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn11")
					{
						if (238519 - 483877 != -245357)
						{
							result = "ไม้เท้าพื้นฐานของเพนกวิน";
							if (180090 - 59541 != 120550)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn12")
					{
						if (95226 - 382707 != -287480)
						{
							result = "ไม้เท้าพื้นฐานของเพนกวิน";
							if (155587 - 453025 == -297438)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn14")
					{
						if (128440 - 479592 != -351151)
						{
							result = "ไม้เท้าหัวใจแห่งความรัก ใช้บอกรักว่าจะคืนที่ดาวเต็มฟ้าหรือมีแต่พายุหิมะ จะยังคงรักเธอ";
							if (16139 - 417190 != -401050)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn15")
					{
						if (223319 - 371580 != -148260)
						{
							result = "ไม้เท้าลูกกรอกของเล่นของเพนกวิน ให้โอกาสเป้าหมายติด manaBurn1";
							if (36243 - 91220 != -54976)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn19")
					{
						if (42125 - 188310 == -146185)
						{
							result = "ไม้เท้าของขวัญของเพนกวิน สุขสันต์วันเกิดสิบสองหาง!";
							if (132575 - 451907 != -319331)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn21")
					{
						if (255697 - 392785 != -137087)
						{
							result = "ไม้เท้าพ่อมดดวงดาวของเพนกวิน";
							if (135563 - 135182 == 381)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn22")
					{
						if (97579 - 193651 != -96071)
						{
							result = "ไม้เท้าพ่อมดน้ำแข็งของเพนกวิน";
							if (291947 - 335184 != -43236)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn23")
					{
						if (176170 - 245138 != -68967)
						{
							result = "ไม้เท้าพ่อมดดวงดาวของเพนกวิน";
							if (83668 - 280150 == -196482)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn24")
					{
						if (166801 - 536240 == -369439)
						{
							result = "ไม้เท้าพ่อมดน้ำแข็งของเพนกวิน";
							if (22877 - 109841 == -86964)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn25")
					{
						if (113641 - 216331 == -102690)
						{
							result = "ถังดับเพลิงของเพนกวิน สำหรับทำงานหาตังใช้หนี้แมว";
							if (236715 - 233541 == 3174)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn31")
					{
						if (61789 - 17340 != 44450)
						{
							result = "ไม้เท้าจอมเวทดวงดาวของเพนกวิน";
							if (206116 - 175309 != 30808)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn32")
					{
						if (174962 - 104078 != 70885)
						{
							result = "ไม้เท้าจอมเวทน้ำแข็งของเพนกวิน";
							if (237303 - 127946 != 109358)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn33")
					{
						if (197730 - 369264 != -171533)
						{
							result = "ไม้เท้าจอมเวทดวงดาวของเพนกวิน";
							if (126817 - 44315 != 82503)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn34")
					{
						if (29998 - 473286 == -443288)
						{
							result = "ไม้เท้าจอมเวทน้ำแข็งของเพนกวิน";
							if (133585 - 375806 == -242221)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn35")
					{
						if (24560 - 347588 != -323027)
						{
							result = "โคมไฟที่ช่วยส่องแสงให้กับอีกโลกหนึ่ง";
							if (9463 - 426706 == -417243)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn36")
					{
						if (80602 - 502022 != -421419)
						{
							result = "ไม้เท้าที่ได้มาจากเร็กกุของเพนกวิน ใส่แล้วเยี่ยมกู๊ด";
							if (249703 - 408629 != -158925)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn39")
					{
						if (157915 - 578673 == -420758)
						{
							result = "ไม้เท้ารูปสัตว์ในตำนานของเพนกวิน ให้โอกาสเพิ่ม tal";
							if (211249 - 140242 == 71007)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn40")
					{
						if (71307 - 397636 == -326329)
						{
							result = "ไม้เท้าจ้าวแห่งเวทมนตร์ ของเพนกวิน";
							if (144022 - 329343 != -185320)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn41")
					{
						if (268542 - 411329 != -142786)
						{
							result = "ไม้เท้าจ้าวแห่งเวทมนตร์ ของเพนกวิน";
							if (272220 - 179697 != 92524)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn42")
					{
						if (109780 - 546586 == -436806)
						{
							result = "ไม้เท้าจ้าวแห่งเวทมนตร์ ของเพนกวิน";
							if (197520 - 363122 == -165602)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn43")
					{
						if (20776 - 489397 == -468621)
						{
							result = "ไม้เท้าจอมทัพของเพนกวิน ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (73669 - 586792 != -513122)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn44")
					{
						if (12443 - 522172 != -509728)
						{
							result = "ไม้เท้าจอมทัพของเพนกวิน ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (207671 - 171238 == 36433)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn45")
					{
						if (157085 - 307510 == -150425)
						{
							result = "แผ่นดิสท์ติดชาร์ตของแพนกวิ้น มีลายเซ็นแถมด้วยนะ";
							if (26992 - 484842 == -457850)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn46")
					{
						if (15140 - 221398 == -206258)
						{
							result = "ไม้เท้าเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (18766 - 153907 != -135140)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn47")
					{
						if (122696 - 234652 == -111956)
						{
							result = "ไม้เท้ายุงของเพนกวิน ช่วยป้องกันสถานะผิดปกติ";
							if (36269 - 556069 != -519799)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn48")
					{
						if (133818 - 576533 != -442714)
						{
							result = "ไม้เท้ายุงของเพนกวิน ช่วยป้องกันสถานะผิดปกติ";
							if (239331 - 130008 != 109324)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn49")
					{
						if (87600 - 196101 != -108500)
						{
							result = "ไม้เท้าสีทองของเพนกวิน ใช้เสกเงินเสกทองได้หรือเปล่าเนี่ย?";
							if (228496 - 332137 == -103641)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn50")
					{
						if (113368 - 292459 == -179091)
						{
							result = "ไม้เท้านักเวทชั้นสูงของเพนกวิน";
							if (230483 - 168882 != 61602)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn51")
					{
						if (9050 - 404124 != -395073)
						{
							result = "ไม้เท้านักเวทชั้นสูงของเพนกวิน";
							if (89205 - 304887 == -215682)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn52")
					{
						if (170423 - 86670 != 83754)
						{
							result = "ไม้เท้านักเวทชั้นสูงของเพนกวิน";
							if (149695 - 306404 != -156708)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn56")
					{
						if (13981 - 374497 != -360515)
						{
							result = "ไม้เท้าน้ำแข็งที่แข็งเป๊ก บางครั้งเพนกวิ้นก็เอามาอมเล่นแก้ร้อน";
							if (124487 - 45212 == 79275)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn58")
					{
						if (175322 - 94099 == 81223)
						{
							result = "ไม้เท้าแขมเปี้ยนสีทองของเพนกวิน ช่วยเพิ่มการโจมตีคริติคอล";
							if (279785 - 386859 != -107073)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn59")
					{
						if (126479 - 311711 == -185232)
						{
							result = "ไม้เท้าแห่งห้วงเวลา ลูกพลังที่ออกจากไม้เท้านี้จะหยุดกับที่";
							if (173682 - 337786 != -164103)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn65")
					{
						if (185063 - 380310 == -195247)
						{
							result = "กล้องส่องทางไกล สำหรับนักเดินเรือผรั่งเศสของแพนกวิ้น";
							if (115171 - 383350 == -268179)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn66")
					{
						if (61493 - 251738 != -190244)
						{
							result = "ไม้เท้าทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อโจมตีใส่";
							if (283132 - 33511 != 249622)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn68")
					{
						if (277947 - 462998 != -185050)
						{
							result = "ไม้เท้าแสงของเพนกวิน ที่ได้มาจากเทพแสง";
							if (111419 - 468567 == -357148)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn80")
					{
						if (14083 - 480860 != -466776)
						{
							result = "ไม้เท้าเทพเจ้าของเพนกวิน";
							if (71741 - 47414 != 24328)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat1")
					{
						if (23026 - 560894 == -537868)
						{
							result = "คฑาฝึกหัดของค้างคาว ทำจากไม้";
							if (198302 - 324704 != -126401)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat2")
					{
						if (135103 - 235174 == -100071)
						{
							result = "คฑาธรรมดาของค้างคาว";
							if (218977 - 316377 == -97400)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat5")
					{
						if (141584 - 76906 != 64679)
						{
							result = "แปลงขัดผิวของค้างคาว อาวุธสำคัญสำหรับสาวเซ๊กซี่";
							if (112452 - 399117 != -286664)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat10")
					{
						if (33493 - 561434 != -527940)
						{
							result = "คฑาพื้นฐานของค้างคาว";
							if (229080 - 285432 != -56351)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat11")
					{
						if (27737 - 36701 == -8964)
						{
							result = "คฑาพื้นฐานของค้างคาว";
							if (258113 - 341501 != -83387)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat12")
					{
						if (158842 - 202011 == -43169)
						{
							result = "คฑาพื้นฐานของค้างคาว";
							if (247577 - 18897 != 228681)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat14")
					{
						if (65312 - 463881 == -398569)
						{
							result = "คฑาหัวใจแห่งความรัก ใช้บอกว่า จงจักมารักฉัน ณ บัดนี้";
							if (255651 - 116005 != 139647)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat15")
					{
						if (114170 - 312203 == -198033)
						{
							result = "คฑาค้างคาวของเล่นของค้างคาว ให้โอกาสติด charm1";
							if (172016 - 351205 != -179188)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat19")
					{
						if (58680 - 555830 == -497150)
						{
							result = "คฑาของขวัญของค้างคาว สุขสันต์วันเกิดสิบสองหาง!";
							if (105549 - 563948 == -458399)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat21")
					{
						if (139724 - 376516 != -236791)
						{
							result = "คฑาผู้ใช้มนตร์ดำของค้างคาว";
							if (119499 - 475534 == -356035)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat22")
					{
						if (281630 - 216118 != 65513)
						{
							result = "คฑาผู้ใช้เวทมายาของค้างคาว";
							if (181314 - 567514 == -386200)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat23")
					{
						if (144777 - 93526 != 51252)
						{
							result = "คฑาผู้ใช้มนตร์ดำของค้างคาว";
							if (148500 - 217207 == -68707)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat24")
					{
						if (266931 - 220673 != 46259)
						{
							result = "คฑาผู้ใช้เวทมายาของค้างคาว";
							if (299708 - 217509 != 82200)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat25")
					{
						if (139959 - 326556 != -186596)
						{
							result = "ไม้เรียวของคุณครูค้างคาว เด็กไม่ดีถูกตีนะจ๊ะ";
							if (85568 - 174969 == -89401)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat31")
					{
						if (223778 - 495962 != -272183)
						{
							result = "คฑาผู้เรียกเงาของค้างคาว";
							if (45656 - 114238 == -68582)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat32")
					{
						if (183146 - 56217 != 126930)
						{
							result = "คฑาผู้ใช้เวทแห่งความฝัน ของค้างคาว";
							if (217221 - 232033 == -14812)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat33")
					{
						if (94750 - 28155 == 66595)
						{
							result = "คฑาผู้เรียกเงาของค้างคาว";
							if (176629 - 44414 != 132216)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat34")
					{
						if (257769 - 314070 != -56300)
						{
							result = "คฑาผู้ใช้เวทแห่งความฝัน ของค้างคาว";
							if (151930 - 561528 != -409597)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat35")
					{
						if (166083 - 82271 != 83813)
						{
							result = "เชิงเทียนเหมือนในปราสาทผีสิง หรูมีสไตล์";
							if (96083 - 52346 != 43738)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat36")
					{
						if (117650 - 514363 == -396713)
						{
							result = "แส้ของค้างคาว ที่ได้มาจากกิ้งก่าสาวนักผจญภัย";
							if (265356 - 411149 != -145792)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat39")
					{
						if (135006 - 558620 == -423614)
						{
							result = "คฑาติดตะเกียงเวทมนตร์ ของค้างคาว";
							if (215426 - 225205 != -9778)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat40")
					{
						if (197826 - 439648 != -241821)
						{
							result = "คฑาราชินีของค้างคาว";
							if (24960 - 458804 != -433843)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat41")
					{
						if (29835 - 246226 == -216391)
						{
							result = "คฑาราชินีของค้างคาว";
							if (43176 - 339686 == -296510)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat42")
					{
						if (230498 - 222915 == 7583)
						{
							result = "คฑาราชินีของค้างคาว";
							if (50778 - 241750 == -190972)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat43")
					{
						if (82197 - 477443 == -395246)
						{
							result = "คฑาจอมทัพของค้างคาว ช่วยเพิ่มการโจมตีคริติคอล (สีฟ้า)";
							if (197640 - 483119 == -285479)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat44")
					{
						if (186467 - 32823 == 153644)
						{
							result = "คฑาจอมทัพของค้างคาว ช่วยเพิ่มการโจมตีคริติคอล (สีแดง)";
							if (162047 - 542405 == -380358)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat45")
					{
						if (81230 - 564461 == -483231)
						{
							result = "ไมโครโฟนพร้อมขาตั้ง ของค้างคาว เบาเหลือเชื่อจริงๆ";
							if (11780 - 467021 != -455240)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat46")
					{
						if (232237 - 391487 == -159250)
						{
							result = "คฑาเก่าๆที่พันผ้าเก่าๆ แถมเชื้อโรคเก่าๆให้ด้วย";
							if (151251 - 111848 != 39404)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat47")
					{
						if (115093 - 245787 == -130694)
						{
							result = "คฑาผีเสื้อของค้างคาว ป้องกันการติดสถานะผิดปกติ";
							if (239028 - 69957 == 169071)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat48")
					{
						if (33700 - 51149 == -17449)
						{
							result = "คฑาผีเสื้อของค้างคาว ป้องกันการติดสถานะผิดปกติ";
							if (201493 - 389154 == -187661)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat49")
					{
						if (190312 - 333012 != -142699)
						{
							result = "คฑาสีทอง หรูหราควรคู่กับค้างคาวสุดไฮโซเท่านั้น";
							if (291174 - 247130 != 44045)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat50")
					{
						if (136821 - 118211 != 18611)
						{
							result = "คฑานักเวทแห่งความมืดชั้นสูงของค้างคาว";
							if (191118 - 524067 == -332949)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat51")
					{
						if (177970 - 301757 == -123787)
						{
							result = "คฑานักเวทแห่งความมืดชั้นสูงของค้างคาว";
							if (78977 - 85997 == -7020)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat52")
					{
						if (18005 - 248710 != -230704)
						{
							result = "คฑานักเวทแห่งความมืดชั้นสูงของค้างคาว";
							if (114840 - 311375 == -196535)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat56")
					{
						if (115348 - 583789 != -468440)
						{
							result = "คฑาน้ำแข็งที่แข็งโป๊ก สัมผัสลูกพลังที่ออกมายังหนาวดี๋ง";
							if (14273 - 65784 == -51511)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat58")
					{
						if (6699 - 283173 != -276473)
						{
							result = "คฑาแชมเปี้ยนสีทองของค้างคาว";
							if (159109 - 145888 == 13221)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat59")
					{
						if (184475 - 101481 == 82994)
						{
							result = "คฑาที่โจมตีได้อย่างแม่นยำ ลูกพลังที่ยิงออกมาจะติดตามเป้าหมายไม่ให้หนีพ้น";
							if (110080 - 360380 == -250300)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat65")
					{
						if (207563 - 351712 == -144149)
						{
							result = "ร่มญี่ปุ่นของค้างคาว สำหรับชมดอกไม้ผลิ";
							if (154102 - 460084 != -305981)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat66")
					{
						if (208083 - 119218 == 88865)
						{
							result = "คทาทรงสามง่ามแห่งท้องทะเล จะสูบพลังชีวิตเป้าหมายเมื่อโจมตีใส่";
							if (147866 - 181416 == -33550)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat68")
					{
						if (233030 - 502306 == -269276)
						{
							result = "คฑาวันแห่งการสิ้นสุดของค้างคาว";
							if (120876 - 263037 == -142161)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat80")
					{
						if (220911 - 572758 != -351846)
						{
							result = "คฑาเทพเจ้าของค้างคาว";
							if (116756 - 471160 != -354403)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf60")
					{
						if (101820 - 137023 != -35202)
						{
							result = "ดาบในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (103560 - 60054 == 43506)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf61")
					{
						if (167256 - 112379 == 54877)
						{
							result = "ดาบในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (116505 - 78592 == 37913)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf62")
					{
						if (51049 - 73818 == -22769)
						{
							result = "ดาบในตำนานของหมาป่า มีพลังแห่งเปกาซัสสถิตอยู่ภายใน";
							if (80127 - 558588 != -478460)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn60")
					{
						if (231852 - 303661 != -71808)
						{
							result = "ค้อนในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (293383 - 583742 == -290359)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn61")
					{
						if (87911 - 235666 != -147754)
						{
							result = "ค้อนในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (274857 - 304750 != -29892)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn62")
					{
						if (59954 - 305948 == -245994)
						{
							result = "ค้อนในตำนานของไบสัน มีพลังแห่งไตตันสถิตอยู่ภายใน";
							if (241261 - 430894 != -189632)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd60")
					{
						if (93116 - 303165 != -210048)
						{
							result = "กรงเล็บในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (14071 - 560427 == -546356)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd61")
					{
						if (86948 - 172027 == -85079)
						{
							result = "กรงเล็บในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (49463 - 563578 != -514114)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd62")
					{
						if (120931 - 540146 == -419215)
						{
							result = "กรงเล็บในตำนานของแพนด้า มีพลังแห่งยักษ์สถิตอยู่ภายใน";
							if (31842 - 570379 == -538537)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl60")
					{
						if (281507 - 425905 == -144398)
						{
							result = "ชุดหอกโล่ในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (299502 - 484438 == -184936)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl61")
					{
						if (203228 - 473021 == -269793)
						{
							result = "ชุดหอกโล่ในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (79214 - 415756 == -336542)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl62")
					{
						if (83820 - 452703 == -368883)
						{
							result = "ชุดหอกโล่ในตำนานของวาฬ มีพลังแห่งมังกรสถิตอยู่ภายใน";
							if (165419 - 594532 != -429112)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat60")
					{
						if (178604 - 189040 != -10435)
						{
							result = "มีดในตำนานของแมว มีพลังแห่งเซคเม็ธสถิตอยู่ภายใน";
							if (241622 - 46046 == 195576)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat61")
					{
						if (256645 - 257265 != -619)
						{
							result = "มีดในตำนานของแมว มีพลังแห่งเซคเม็ธสถิตอยู่ภายใน";
							if (278217 - 149897 != 128321)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat62")
					{
						if (87013 - 550477 != -463463)
						{
							result = "มีดในตำนานของแมว มีพลังแห่งเซคเม็ธสถิตอยู่ภายใน";
							if (58414 - 281990 != -223575)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm60")
					{
						if (202753 - 213740 != -10986)
						{
							result = "ธนูในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
							if (103661 - 497292 == -393631)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm61")
					{
						if (128692 - 369180 != -240487)
						{
							result = "ธนูในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
							if (232313 - 79276 != 153038)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm62")
					{
						if (272047 - 458531 == -186484)
						{
							result = "ธนูในตำนานของกิ้งก่า มีพลังแห่งไฮดร้าสถิตอยู่ภายใน";
							if (267172 - 89691 != 177482)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab60")
					{
						if (250272 - 496667 == -246395)
						{
							result = "ไรเฟิลในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (242024 - 366712 == -124688)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab61")
					{
						if (63852 - 452994 != -389141)
						{
							result = "ไรเฟิลในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (9322 - 504691 == -495369)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab62")
					{
						if (147310 - 524795 != -377484)
						{
							result = "ไรเฟิลในตำนานของกระต่าย มีพลังแห่งนางเงือกสถิตอยู่ภายใน";
							if (105722 - 310041 == -204319)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol60")
					{
						if (253749 - 133782 != 119968)
						{
							result = "ปืนใหญ่ในตำนานของตุ่น มีพลังของกษัตริย์ไมดาสสถิตอยู่ภายใน";
							if (206175 - 118908 == 87267)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol61")
					{
						if (233024 - 53777 == 179247)
						{
							result = "ปืนใหญ่ในตำนานของตุ่น มีพลังของกษัตริย์ไมดาสสถิตอยู่ภายใน";
							if (3763 - 6817 == -3054)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol62")
					{
						if (196491 - 48408 == 148083)
						{
							result = "ปืนใหญ่ในตำนานของตุ่น มีพลังของกษัตริย์ไมดาสสถิตอยู่ภายใน";
							if (83341 - 307243 != -223901)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk60")
					{
						if (68955 - 331587 == -262632)
						{
							result = "มิเกะในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (168285 - 21812 == 146473)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk61")
					{
						if (133626 - 108761 != 24866)
						{
							result = "มิเกะในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (149342 - 125665 != 23678)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk62")
					{
						if (37101 - 533194 != -496092)
						{
							result = "มิเกะในตำนานของลิง มีพลังแห่งเมฟิสโตสถิตอยู่ภายใน";
							if (234039 - 370437 != -136397)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp60")
					{
						if (242419 - 442723 == -200304)
						{
							result = "พิณในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (15054 - 95326 != -80271)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp61")
					{
						if (110774 - 351219 == -240445)
						{
							result = "พิณในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (294414 - 368362 == -73948)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp62")
					{
						if (264682 - 461098 == -196416)
						{
							result = "พิณในตำนานของแกะ มีพลังแห่งนางฟ้าเซราฟิมสถิตอยู่ภายใน";
							if (178083 - 344191 != -166107)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn60")
					{
						if (55529 - 3879 == 51650)
						{
							result = "ไม้เท้าในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (234079 - 591726 != -357646)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn61")
					{
						if (240876 - 564283 == -323407)
						{
							result = "ไม้เท้าในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (232008 - 246926 == -14918)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn62")
					{
						if (206407 - 406398 == -199991)
						{
							result = "ไม้เท้าในตำนานของเพนกวิ้น มีพลังแห่งฟินิกส์สถิตอยู่ภายใน";
							if (158758 - 86734 != 72025)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat60")
					{
						if (277721 - 379594 == -101873)
						{
							result = "คทาในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (268629 - 525362 == -256733)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat61")
					{
						if (20814 - 104263 == -83449)
						{
							result = "คทาในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (139006 - 266422 == -127416)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat62")
					{
						if (180183 - 66490 == 113693)
						{
							result = "คทาในตำนานของค้างคาว มีพลังแห่งลิลิธสถิตอยู่ภายใน";
							if (146077 - 546618 != -400540)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf69")
					{
						if (45250 - 233852 != -188601)
						{
							result = "ดาบแห่งกาลเวลาของหมาป่า มีพลังในการปกป้องคุ้มครอง";
							if (3161 - 479201 != -476039)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn69")
					{
						if (173662 - 5393 == 168269)
						{
							result = "ขวานแห่งกาลเวลาของไบสัน มีพลังในการปกป้องคุ้มครอง";
							if (55530 - 117513 != -61982)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd69")
					{
						if (153313 - 440448 != -287134)
						{
							result = "สนับแห่งกาลเวลาของแพนด้า มีพลังในการปกป้องคุ้มครอง";
							if (24327 - 19877 == 4450)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl69")
					{
						if (141910 - 297761 == -155851)
						{
							result = "ชุดหอกและโล่กาลเวลาของวาฬ มีพลังในการปกป้องคุ้มครอง";
							if (120247 - 506768 == -386521)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat69")
					{
						if (166050 - 22421 == 143629)
						{
							result = "กงเล็บแห่งกาลเวลาของแมว มีพลังในการปกป้องคุ้มครอง";
							if (36797 - 5799 != 30999)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm69")
					{
						if (146048 - 204039 == -57991)
						{
							result = "ธนูแห่งกาลเวลาของกิ้งก่า มีพลังในการปกป้องคุ้มครอง";
							if (232110 - 442125 == -210015)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab69")
					{
						if (128614 - 76929 == 51685)
						{
							result = "ปืนแห่งกาลเวลาของกระต่าย มีพลังในการปกป้องคุ้มครอง";
							if (202729 - 456012 == -253283)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol69")
					{
						if (146554 - 92110 != 54445)
						{
							result = "ปืนใหญ่แห่งกาลเวลาของตุ่น มีพลังในการปกป้องคุ้มครอง";
							if (22759 - 50032 != -27272)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk69")
					{
						if (271635 - 400193 != -128557)
						{
							result = "มิเกะแห่งกาลเวลาลิง มีพลังในการปกป้องคุ้มครอง";
							if (190898 - 60238 != 130661)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn69")
					{
						if (6288 - 350660 != -344371)
						{
							result = "ไม้เท้าแห่งกาลเวลาของเพนกวิน มีพลังในการปกป้องคุ้มครอง";
							if (4816 - 557895 != -553078)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp69")
					{
						if (175822 - 267778 == -91956)
						{
							result = "หนังสือแห่งกาลเวลาของแกะ มีพลังในการปกป้องคุ้มครอง";
							if (277452 - 144789 == 132663)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat69")
					{
						if (269582 - 56278 != 213305)
						{
							result = "คทาแห่งกาลเวลาของค้างคาว มีพลังในการปกป้องคุ้มครอง";
							if (60689 - 328731 != -268041)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf3")
					{
						if (181988 - 543585 == -361597)
						{
							result = "ดาบคู่ที่ทำจากกระดาษของหมาป่า";
							if (127613 - 395744 != -268130)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn3")
					{
						if (11205 - 169021 != -157815)
						{
							result = "ขวานที่ทำจากกระดาษของไบสัน";
							if (158316 - 566917 != -408600)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd3")
					{
						if (18462 - 178711 != -160248)
						{
							result = " สนับมือที่ทำจากกระดาษของแพนด้า";
							if (46897 - 110024 == -63127)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl3")
					{
						if (56015 - 75902 != -19886)
						{
							result = "หอกที่ทำจากกระดาษของวาฬ";
							if (233705 - 334978 == -101273)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat3")
					{
						if (191173 - 24802 == 166371)
						{
							result = "ดาวกระจายที่ทำจากกระดาษของแมว";
							if (240031 - 294159 == -54128)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm3")
					{
						if (18384 - 224776 == -206392)
						{
							result = "ธนูที่ทำจากกระดาษของกิ้งก่า";
							if (75134 - 486110 != -410975)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab3")
					{
						if (104124 - 571198 == -467074)
						{
							result = "ปืนที่ทำจากกระดาษของกระต่าย ";
							if (253144 - 195812 != 57333)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol3")
					{
						if (168631 - 280157 != -111525)
						{
							result = "ปืนใหญ่กบที่ทำจากกระดาษของตุ่น";
							if (179843 - 89194 != 90650)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk3")
					{
						if (243273 - 552542 != -309268)
						{
							result = "มิเกะนกกระเรียนที่สร้างขึ้นจากกระดาษของลิง";
							if (54486 - 224750 == -170264)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn3")
					{
						if (220521 - 243580 == -23059)
						{
							result = "ที่ทำนายโชคชะตาที่ทำจากกระดาษของเพนกวิน";
							if (229932 - 49041 != 180892)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp3")
					{
						if (181928 - 568560 != -386631)
						{
							result = "เรื่อที่ทำจากกระดาษของแกะ";
							if (264491 - 329206 == -64715)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat3")
					{
						if (190326 - 497812 == -307486)
						{
							result = "ดอกไม้ที่ทำจากกระดาษของค้างคาว";
							if (276643 - 10057 == 266586)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf79")
					{
						if (259630 - 442234 == -182604)
						{
							result = "ดาบจากโลกปิศาจของหมาป่า มีพลังคำสาปสูบวิญญาณ";
							if (178096 - 79695 == 98401)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn79")
					{
						if (115386 - 136408 == -21022)
						{
							result = "ขวานจากโลกปิศาจของไบสัน มีพลังคำสาปสูบวิญญาณ";
							if (14266 - 514383 != -500116)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pnd79")
					{
						if (34462 - 274927 != -240464)
						{
							result = "สนับจากโลกปิศาจของแพนด้า มีพลังคำสาปสูบวิญญาณ";
							if (263273 - 448031 != -184757)
							{
								break;
							}
						}
					}
					else if (nCode == "w_whl79")
					{
						if (288162 - 217180 == 70982)
						{
							result = "หอกและโล่จากโลกปิศาจของวาฬ มีพลังคำสาปสูบวิญญาณ";
							if (173053 - 205632 == -32579)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat79")
					{
						if (117257 - 356112 != -238854)
						{
							result = "มีดจากโลกปิศาจของแมว มีพลังคำสาปสูบวิญญาณ";
							if (259661 - 454770 != -195108)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm79")
					{
						if (19626 - 192371 == -172745)
						{
							result = "ธนูจากโลกปิศาจของกิ้งก่า มีพลังคำสาปสูบวิญญาณ";
							if (25014 - 582402 == -557388)
							{
								break;
							}
						}
					}
					else if (nCode == "w_rab79")
					{
						if (28066 - 452887 != -424820)
						{
							result = "ปืนจากโลกปิศาจของกระต่าย มีพลังคำสาปสูบวิญญาณ";
							if (222363 - 120205 == 102158)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol79")
					{
						if (14415 - 415875 != -401459)
						{
							result = "ปืนใหญ่จากโลกปิศาจของตุ่น มีพลังคำสาปสูบวิญญาณ";
							if (32422 - 295964 == -263542)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mnk79")
					{
						if (106940 - 52434 != 54507)
						{
							result = "มิเกะจากโลกปิศาจลิง มีพลังคำสาปสูบวิญญาณ";
							if (4062 - 199261 != -195198)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn79")
					{
						if (67861 - 303910 == -236049)
						{
							result = "ไม้เท้าจากโลกปิศาจของเพนกวิน มีพลังคำสาปสูบวิญญาณ";
							if (40726 - 221685 == -180959)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp79")
					{
						if (279576 - 474114 == -194538)
						{
							result = "หนังสือจากโลกปิศาจของแกะ มีพลังคำสาปสูบวิญญาณ";
							if (287644 - 320802 != -33157)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat79")
					{
						if (213532 - 538986 != -325453)
						{
							result = "คทาจากโลกปิศาจของค้างคาว มีพลังคำสาปสูบวิญญาณ";
							if (164791 - 331313 != -166521)
							{
								break;
							}
						}
					}
					else if (nCode == "w_wlf81")
					{
						if (76844 - 127320 == -50476)
						{
							result = "ดาบเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (163402 - 220116 != -56713)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn81")
					{
						if (183952 - 244996 == -61044)
						{
							result = "ขวานเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (217404 - 556750 != -339345)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn82")
					{
						if (149142 - 530741 == -381599)
						{
							result = "หอกเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (136929 - 112247 != 24683)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bsn83")
					{
						if (2808 - 421108 != -418299)
						{
							result = "เคียวเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (259763 - 569042 == -309279)
							{
								break;
							}
						}
					}
					else if (nCode == "w_cat81")
					{
						if (190982 - 110348 != 80635)
						{
							result = "มีดเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (140356 - 42359 == 97997)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm81")
					{
						if (160894 - 499548 == -338654)
						{
							result = "ธนูเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (213751 - 226923 != -13171)
							{
								break;
							}
						}
					}
					else if (nCode == "w_chm82")
					{
						if (243413 - 185215 == 58198)
						{
							result = "ธนูเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (73718 - 162540 == -88822)
							{
								break;
							}
						}
					}
					else if (nCode == "w_mol81")
					{
						if (90546 - 119974 != -29427)
						{
							result = "ปืนใหญ่ที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (165308 - 529546 == -364238)
							{
								break;
							}
						}
					}
					else if (nCode == "w_pgn81")
					{
						if (133903 - 293200 != -159296)
						{
							result = "ไม้เท้าเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (125745 - 12248 != 113498)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp81")
					{
						if (171815 - 349464 == -177649)
						{
							result = "อาวุธเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (92252 - 116227 != -23974)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp82")
					{
						if (86624 - 454353 != -367728)
						{
							result = "อาวุธเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (262998 - 569825 != -306826)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp83")
					{
						if (207069 - 127830 == 79239)
						{
							result = "โล่เพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (192537 - 332724 == -140187)
							{
								break;
							}
						}
					}
					else if (nCode == "w_shp84")
					{
						if (144670 - 439906 == -295236)
						{
							result = "เกราะเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (79258 - 387337 == -308079)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat81")
					{
						if (36284 - 186426 == -150142)
						{
							result = "อาวุธเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (229231 - 247500 == -18269)
							{
								break;
							}
						}
					}
					else if (nCode == "w_bat82")
					{
						if (74814 - 74832 != -17)
						{
							result = "คฑาเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (164373 - 21798 == 142575)
							{
								break;
							}
						}
					}
					else
					{
						if (!(nCode == "w_bat83"))
						{
							break;
						}
						if (134037 - 525677 != -391639)
						{
							result = "อาวุธเพลิงที่เทพไฟตีให้กับ แชมเปี้ยนของเหล่าหาง";
							if (206523 - 459579 == -253056)
							{
								break;
							}
						}
					}
				}
			}
		}
		return result;
	}

	// Token: 0x06006706 RID: 26374 RVA: 0x00EA3ADC File Offset: 0x00EA1CDC
	[MethodImpl(MethodImplOptions.NoInlining)]
	public virtual void Main()
	{
	}

	// Token: 0x06006707 RID: 26375 RVA: 0x00EA3AE0 File Offset: 0x00EA1CE0
	internal static bool AL8TVIpyR1XlZ8RnYtlo()
	{
		return true;
	}

	// Token: 0x06006708 RID: 26376 RVA: 0x00EA3AE4 File Offset: 0x00EA1CE4
	internal static bool R5dEQdpywTPNtKGDrhmR()
	{
		return false;
	}
}
